{
  "id": "a07umb8pq01bag",
  "created": "2025-09-30T07:14:37.326Z",
  "closed": "2025-10-01T09:45:33.512Z",
  "duration_minutes": 1590,
  "first_response_minutes": 7,
  "name": "dashboard",
  "description": "Viete sa mi pozrie콘 na z치lo쬶u dashboard, zrejme sa mi ju podarilo \"zhodi콘\" t칳m, 쬰 som pri vytv치ran칤 pou쬴l nespr치vnu kombin치ciu 칰dajov. V캞aka",
  "owner": "Tomas_Polak",
  "priority": "Norm치ln칤",
  "surveyquality": "Highest",
  "surveyterm": "Highest",
  "type": "Konzultace/dat. servis",
  "area": "Bez",
  "comment_stats": {
    "total": 12,
    "from_owner": 6,
    "from_others": 6,
    "unique_authors": 1
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim Vas, nie som si isty co myslite. Dashboard sa nachadza na projekte alebo potom v ciernej liste hore (to je dashboard nad vsetkym)."
    },
    {
      "creator": "Tomas_Polak",
      "comment": "hral som sa s dashboardami a tro코ka som to prep칤skol, zvolil som zrejme n치ro캜n칰 kombin치ciu 칰dajov na zobrazenie, tak odvtedy sa to캜칤m a to캜칤m a to캜칤m, viete to nejako vymaza콘, zhodi콘 ? 20250930-0749-41.4125618.mp4"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "nereaguje Vam vobec ALITEO, alebo to takto vytuhne pri otvoreni dashboardov?"
    },
    {
      "creator": "Tomas_Polak",
      "comment": "len pri dashboarde, ostatn칠 캜asti Alitea s칰 v poriadku"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Super, na chybu sme prisli, opravujeme, v noci bude nasadeny opravny patch a malo by to byt v poriadku."
    },
    {
      "creator": "Tomas_Polak",
      "comment": "캞akujem a ospravedl켿ujem sa, 쬰 som to zhodil. Chcel som v dashboarde vidie콘 aj sekcie / status jednotliv칳ch vytvoren칳ch tiketov / 칰loh a ke캞 som sa ich tam sna쬴l prida콘, spadlo mi to. Celkovo budem asi potrebova콘 poradi콘 ako si vytvori콘 dashboard alebo preh쬬d tiketov  v jednotliv칳ch f치zach nad v코etk칳mi projektami, lebo projektov prib칰da a nie je efekt칤vne robi콘 ka쬯odenn칳 scrum nad v코etk칳mi tiketami, neviem 캜i to rie코i콘 cez priority alebo deadlines na tiketoch, asi budem potrebova콘 캞al코iu konzult치ciu ako nastavi콘 workflow a celkovo syst칠m pr치ce, od akej 칰rovne vytv치ra콘 nov칠 projekty a v nich 칰lohy a kedy len 칰lohu z nejak칳m pr칤znakom."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Nic ste nezhodili, je to len u Vas.. neslo to nacitat lebo nma pozadi bola chyba.. ale to neznamena ze ste to zhodili ostatnym.. 游뗵 Dajte dokopy co by ste si predstavovali, teda: X projektov, v Y pracovnych priestoroch a chcem to vidiet tak a tak.. Teda fajn by bolo mat nejaky diagram ako pracujete, v kolkych projektoch mate uloh a skusime potom nastavit nejaky flow.. dohodneme termin konzultacie opat.."
    },
    {
      "creator": "Tomas_Polak",
      "comment": "okey, tak som spravil z치콘a쬺v칳 test 游뗵 jj tak som to myslel, podobne ako tomu bolo minule, vytvor칤m udalos콘 a d치m tam nejak칠 body, ktor칠 ma zauj칤maj칰. Dnes som si otestoval ten n치코 intern칳 service desk a eskal치ciu po쬴adaviek na zmenu do Sanga a tam vytvorenie subtaskov z t칳chto po쬴adaviek v r치mci parent / sumariza캜n칠ho tasku zmenov칳ch po쬴adaviek. Neviem 캜i tam je nejak칠 obmedzenie vzh쬬dom na to, 쬰 je to napojen칠 na Karat ale mne to fungovalo pekne. Neviem si predstavi콘 쬰 to budeme robi콘 ako doteraz cez koment치re a pr칤padne si cez koment치re posiela콘 v칳sledky testov, opravovanie chyba a n치sledn칠 pretestov치vanie ... ako d치 sa cez linkovanie koment치rov, ale uprimne to sa mi nechce a je to tak칠 코kr치banie sa za ucho cez nos. Tak쬰 m칪j cie je vytvori콘 3EC service desk, aby u쮂셨atelia z 3EC boli ako extern칳 a t칤 ktor칤 re치lne rie코ime tasky budeme ma콘 licencie (zatia 2, do bud칰cna roz코칤rime) a mi potom tieto chyby / po쬴adavky budeme posiela콘 na SANGO a t칤 pr칤padne eskalova콘 na KARAT a zmenovky si m칪쬿 zlu캜ova콘 do jedn칠ho parent tiketu a po 캜ase sa na to pozrie콘 a sprocesova콘 nastavi콘 workflow (napr. anal칳za, nacenenie, poslanie sp칛콘 k n치m na ods칰hlasenie a po ods칰hlasen칤 v칳voj , UAT, a nasadenie do produkcie )"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Ja si osobne myslim ze to nebol zatazovy problem.. Podla chyby ktora sa vygenerovala je to len chybajuce ID niekde medzi cache a DB..  takze aplikacii to nespravilo nic, mozno cyklenie na klientovi maximalne.."
    },
    {
      "creator": "Tomas_Polak",
      "comment": "myslel som to len obrazne 游땔"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Rozumiem 游뗵 kazdopadne bola chyba opravena a malo by to byt v poriadku"
    },
    {
      "creator": "Tomas_Polak",
      "comment": "jasn칠, je to v poriadku, m칪쬰me uzavrie콘. 캞akujem"
    }
  ]
}