{
  "id": "a082avf2pg1k5l",
  "created": "2025-10-28T14:40:09.473Z",
  "closed": "2025-11-11T21:32:34.314Z",
  "duration_minutes": 20572,
  "first_response_minutes": 32,
  "name": "Pr칤stup u쮂셨ate쬬 do projektu v spolo캜nosti KARAT a 3EC",
  "description": "Pozdravujem. Potreboval by som preveri콘 a vyrie코i콘 pr칤stup u쮂셨ate쬬 zuzana.maslikova@3ec.sk v spolo캜nosti KARAT na projekte #289 3EC International a.s. . Medzi u쮂셨ate쬸i projektu ju vid칤m ale m치 status Invitation miesto External ako in칳 u쮂셨atelia, ktor칳ch m칪쬰m prida콘 medzi Followerov (treba im preposla콘 pozv치nku, resp. musia ju potvrdi콘 ? )",
  "owner": "Tomas_Polak",
  "priority": "Norm치ln칤",
  "surveyquality": "Unknown",
  "surveyterm": "Unknown",
  "type": "Konzultace/dat. servis",
  "area": "Bez",
  "comment_stats": {
    "total": 25,
    "from_owner": 12,
    "from_others": 13,
    "unique_authors": 2
  },
  "comments": [
    {
      "creator": "Tomas_Polak",
      "comment": "The escalated task has been successfully completed. The result is available at this link: https://app.aliteo.com/Task/a080sqpftg1dlq . You can continue working on this task."
    },
    {
      "creator": "Tomas_Polak",
      "comment": "na jednom tikete #324280 Odosielanie zmluvy e-mailom v spolo캜nost Karat som ZUM a MIS ozna캜il, uvid칤m, 캜i im pr칤de upozornenie a n치sledne bud칰 vidie콘 obsah tiketu"
    },
    {
      "creator": "Tomas_Polak",
      "comment": "Posielam op칛tovne, preto쬰 ani po odkliknut칤 pozv치nky do spolo캜nosti KARAT u쮂셨ate쬺vi zuzana.maslikva@3ec.sk pr칤stup do spolo캜nosti KARAT nefunguje a ke캞 klikne na odkaz na tiket v spolo캜nosti 3EC International zobrazuje sa jej to 캜o vid칤te v pr칤lohe. 캛o je zvl치코tne pri oboch u쮂셨ate쬺ch : zuzana.maslikova@3ec.sk aj miroslava.srdosova@3ec.sk 쬰 obe maj칰 v nastaveniach pr칤stup do spolo캜nosti 3EC international a.s. a z치rove켿 do spolo캜nosti z ich menom a ch칳ba im tam spolo캜nos콘 KARAT.  Viete to pros칤m e코te raz preveri콘, pr칤padne si s nimi da콘 teams / call a preveri콘 nastavenia ? 캝akujem"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim pan Polak, predpokladam ze toto nie je na support ALITEO ale niekoho z KARAT. Je tak?"
    },
    {
      "creator": "Tomas_Polak",
      "comment": "Pod쬬 m켿a u na support. Z nejak칠ho d칪vodu im vytv치ra spolo캜nos콘 z n치zvom ich mena a aj po viacn치sobnom zaslan칤 pozv치nky sa nem칪쬿 dosta콘 do spolo캜nosti KARAT a v spolo캜nosti 3EC International a.s. sa im nezobrazuj칰 tikety aj ke캞 prijali pozv치nku a zobraz칤 sa im okno v pr칤lohe. Tak쬰 tam bude nejak칳 bug"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "analyza: - existencia uzivatelov: - zuzana.maslikova@3ec.sk - OK - miroslava.srdosova@3ec.sk - NOK - existuju uzivatela miriam.srdosova@3ec.sk a katarina.srdosova@3ec.sk"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Skusim popisat co som zistil a zosumarizovat: - pre prijatie do spolocnosti nestaci len kliknut na tlacidlo z pozvanky, je treba potom kliknut na webe ze prijima a prihlasit sa pod danym emailom - ak tento postup nie je kompletny, spolocnost kde bola pozvana neuvidi - pani Maslikova ma pristup do spolocnosti 3EC, vidi tam ulohy - ad uloha z obrazku - ak nie su sledujuce ani supervizorky tak na tu ulohu nemaju skratka pravo - uzivatel miroslava.srdosova@3ec.sk neexistuje - existuje Miriam a Katarina"
    },
    {
      "creator": "Tomas_Polak",
      "comment": "- 치no to som dnes rie코il s 캞al코ou kolegy켿ou emilia.puterova@3ec.sk. Ako p칤코te museli sme sa registrova콘, zasla콘 potvrdzovac칤 k칩d a po jeho vyplnen칤 n치m syst칠m nedovolil sa prihl치si콘 Tak som jej preposlal nov칰 pozv치nku aby som vyl칰캜il to, 쬰 je tam nejak치 expir치cia. - u쮂셨ate쬬 zuzana.maslikova@3ec.sk pozriem zajtra, zrejme sa nezaregistrovala a uvid칤m, 캜i jej pri코la pozv치nku zo spolo캜nosti KARAT - 치no pri miroslave som urobil preklep je tom miriam.srdosova@3ec.sk"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Ak pise ze konto nie je moze najst, tak neexistuje uzivatel s tymto emailom.. Je treba teda nieco riesit z nasej strany?"
    },
    {
      "creator": "Tomas_Polak",
      "comment": "no, st치le m치me probl칠m 쬰 u쮂셨ate zuzana.maslikova@3ec.sk neobdr쬬la do e-mailu  pozv치nku z firmy Karat aj ke캞 ju v치코 kolega zasielal a nerozumieme ako m칪쬰 ma콘 vytvoren칰 spolo캜nos콘 so svojim menom a priezviskom. A pri u쮂셨ate쬺vi emilia.puterova@3ec.sk st치le vyhadzuje t칰 hl치코ku aj ke캞 som jej skopr칤oval invitation v spolo캜nosti 3EC International a.s. a skontroloval e-mailov칠 adresy. Je tam pod쬬 m켿a nejak칳 technick칳 probl칠m. Plus ak im prepo코lem pozv치nku z Alitea, 쬴adny e-mail im nechod칤, nerozumiem tomu."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Spolocnost s menom a priezviskom sa vytvori vtedy, ak sa registrujete sami od seba a nie na zaklade pozvanky z inej spolocnosti. Este to popisem inak - dve moznosti: 1. nie som vobec v ALITEO, dostanem pozvanku z nejakej spolocnosti ABC, pri potvrdzovani sa registrujem a vtedy mam len spolocnost ABC 2. uz som sa sam od seba registroval (bez pozvanky), nemoze sa stat zeby nebola ziadna spolocnost a preto sa automaticky vytvara spolocnost s mojim menom. - nasledne ak mi niekto posle pozvanku do ABC, potom pri prijimani sa uz neregistrujem len sa prihlasim a vtedy mam svoju a potom aj ABC Asi nam potom nic ine neostane, len sa asi spojit, vy si pripravte ich emailove konto (aby ste videli emaily) a idealne aj prihlasovacie udaje, aby sme vedeli skontrolovat aj ucet ALITEO. A zistime o co ide. Este pred tym sem teda napiste problemy vo formate: _email_ - popis_problemu (napriklad: peter@email.cz - nevidi spolocnost X a Y, nevidi ulohy atd)"
    },
    {
      "creator": "Tomas_Polak",
      "comment": "Pozdravujem. zuzana.maslikova@3ec.sk nem치 pr칤stup do spolo캜nosti KARAT projektu 3EC International a.s. (nevid칤 ju ani medzi spolo캜nos콘ami), po kliknut칤 na tiket v spolo캜nosti 3EC International a.s. sa jej objav칤 chybov치 hl치코ka miroslava.srdosova@3ec.sk nem치 pr칤stup do spolo캜nosti KARAT a nezobrazuj칰 sa jej tikety ani v spolo캜nosti 3EC International a.s. emilia.puterova@3ec.sk poslal som jej pozv치nku, zaregistrovala sa, ale po zaregistrovan칤 sa nevie prihl치si콘, vyhadzuje jej chybob칰 hl치코ku."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "takze, mozeme sa dohodnut tak, ze ziskate pristup k ich emailom, a ich ALITEO uctu, dame si call a vyriesime to takto? napiste kedy mate tento tyzden cas... predpokladam ze u pani Srdosovej ste znova urobili preklep a mala to byt Miriam alebo Katarina, je tak?"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "@ KSWPMS - Petr Masa콏칤k (petr.masarik@karatsoftware.cz) prosim Ta, mam to s nimi spravit priamo cez URL linky?"
    },
    {
      "creator": "Tomas_Polak",
      "comment": "emiliu.puterovu a miriam.srdosovu mozeme poriesit zajtra cca o 12 ?"
    },
    {
      "creator": "KSWPMS - Petr Masa콏칤k",
      "comment": "@ Daniel Dzuro (daniel.dzuro@karatsoftware.sk) zuzana.maslikova@3ec.sk - pozv치nka: https://app.aliteo.com/invitation/a0676qi0bg1oa8/18a5ec18-11d5-49f2-8daa-ea34fe12ec28 - nyn칤 jsem poslal, klidn캩 jim to nakop칤ruj. miroslava.srdosova@3ec.sk - nevid칤m ji jako u쬴vatele v aliteo ani v karatu - tak쬰 je pot콏eba aby ji RPA zalo쬴l do osob a pak ji mo쬹칠 ji poslat. emilia.puterova@3ec.sk - - nevid칤m ji jako u쬴vatele v aliteo ani v karatu - tak쬰 je pot콏eba aby ji RPA zalo쬴l do osob a pak ji mo쬹칠 ji poslat."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Ano, zajtra o 12:00 sa mozeme spojit. Mimo toho som zistil ze: - pani zuzana.maslikova@3ec.sk bola odoslana pozvanka a link k nej prikladam aj sem - cez tento link moze pozvanku prijat, prihlasit sa problem by byt nemal https://app.aliteo.com/invitation/a0676qi0bg1oa8/18a5ec18-11d5-49f2-8daa-ea34fe12ec28 (kolega jej ju poslal este raz aj do emailu) - pani miriam.srdosova@3ec.sk ma link tu: https://app.aliteo.com/invitation/a04f27ga0g1vqv/8bad74cb-1eec-4635-870c-86a0becc271d - pani emilia.puterova@3ec.sk ak sa bavime o pozvanke to vasej spolocnosti, tak takisto ak si ju najdete medzi uzivatelmi, v zalozke pokrocile a mozete jej poslat pozvanku do spolocnosti opakovane alebo najst URL link k pozvanke - naviac tento email sa ani nenachadza medzi registrovanymi uzivatelmi, teda takyto uzivatel ani neexistuje (skratka sa nezaregistrovala) Mozno Vam k tomu pomoze aj tutorial video k pozvanke a registracii: https://www.youtube.com/watch?v=2smS4DUiKsM&list=PLLotJPTXmdg3C_MvZ7GLa7NQitekh0KkX&index=4 Potvrdte mi prosim, ci je stretnutie nutne. Dakujem"
    },
    {
      "creator": "Tomas_Polak",
      "comment": "Potvrdzujem, m칪쬰te posla콘 MS Teams pozv치nku na emilia.puterova@3ec.sk na 12 hodinu ?"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "zdravim Vas, nieco mi medzitym do toho voslo, mozme aj 12:30-13:00 ?"
    },
    {
      "creator": "Tomas_Polak",
      "comment": "m칪쬰 by콘, mo쬹o tu dovtedy bude aj miriam srdosova, ak nie tak aspo켿 p. Puterovu porie코ime, lebo jej som dnes op칛콘 posielal pozv치nku aj z Alitea aj odkaz e-mailom a st치le t치 ist치 chyba a pritom medzi u쮂셨ate쬸i v spolo캜nosti 3EC Interrnational a.s. ju vid칤m, tak ver칤m, 쬰 nebude chyba medzi stoli캜kou a kl치vesnicou :)"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Pozvanku som odoslal. Stale plati ze ucet s emailom emilia.puterova@3ec.sk neexistuje, takze pani Puterova nedokoncila registraciu. Vy ju v spolocnosti vidite, lebo poslanie pozvanky nie je podmienene existenciou uctu v ALITEO. Este mozete zistit ci Vam chodia emaily z microsoftu pre overenie a registraciu v AAD. Predpokladam ze to problem nebude, kedze vy ste sa registrovali. Ale niekedy sa stane ze verifikacny server MS posle kod, ale zastavi to brana emailov a uzivatel nedostane email. Kod potom expiruje a clovek sa nevie registrovat. Pocujeme sa o 12:30."
    },
    {
      "creator": "Tomas_Polak",
      "comment": "Pam칛t치m si, 쬰 sme vyp컄켿ali aj registra캜n칳 k칩d a 치no ob캜as sa stene 쬰 napr. z m칪jho e-mailov칠ho 칰캜tu tomas.polak@outlook.sk, 캜o je m칪j s칰kromn칳 e-mail na platforme Microsoft 365 (z치kladn칠 predplatn칠)., mi ho n치코 po코tov칳 server v 3EC international blokuje. Mal som rozsiahle diskusie s na코im extern칳m IT, ktor칠 mi krvopotne tvrd칤, 쬰 je chyba na strane Microsoftu, Microsoft podpora mi ale zdokladovala, 쬰 chyba je u n치s a nejak칠 nastavenie n치코ho serveru blokuje e-maily od microsoftu. Ke캞 som s t칳m konfronotval na코eho IT poskytovate쬬 slu쬴eb, tak sa to miesto h쬬dania rie코enia skon캜ilo tak, 쬰 kontaktovali riadite쬶u na코ej firmy, za캜ali ju stra코i콘 s t칳m 쬰 ide o poru코enie bezpe캜nosti ak pou쮂셨am s칰kromn칰 e-mailov칰 adresu a vraj brusel n치m to zakatuje (캜칤m in칳m stra코i콘 ak nie EU), tak odvtedy m치m zak치zan칠 pou쮂셨a콘 svoj s칰kromn칳 e-mail na testovanie 캜i u KARATu alebo ALITEA. Probl칠m sa nevyrie코il ale v코etci s칰 dostato캜ne vystra코en칳 aby rad코ej ni캜 nerobili :)"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Dakujem za zaujimavu skusenost 游뗵 taky nas nesvar \"a캜ohentizmus\" - ak neviem vyriesit problem, obratim pozornost inde, ze je problem inde 游뗵 Som rad ze sme dnes vyriesili co bolo treba. Ulohu teda predavam na Vas, aby ste sa pozreli na ostatne kolegyne, p. Srdsovu a p. Maslikovu."
    },
    {
      "creator": "Tomas_Polak",
      "comment": "Aj ja 캞akujem za asistenciu, nau캜ili  sme sa 쬰 registr치cia nie je ukon캜en치 overen칤m k칩du ale treba e코te posun칰콘 kurzor ni쮄멸e a potvrdi콘 ju tla캜idlom. Vysk칰코am aj pri ostatn칳ch kolegyniach a ver칤m, 쬰 to bude ok a potom tiket uzavrieme."
    },
    {
      "creator": "KSWPMS - Petr Masa콏칤k",
      "comment": "@ Daniel Dzuro (daniel.dzuro@karatsoftware.sk) asi nem캩li na 90% a tedy tu volbu nevid캩li, 쬰 maj칤 pokra캜ovat je tak? s t칤m jsem se taky setk치val 캜asto - ale rozum칤m, 쬰 to nejde za v치mi, proto쬰 to nen칤 n치코 formul치콏."
    }
  ]
}