{
  "id": "a07j8ngufg1c02",
  "created": "2025-07-03T13:22:12.152Z",
  "closed": "2025-07-09T06:51:53.717Z",
  "duration_minutes": 8249,
  "first_response_minutes": 18,
  "name": "FW: ALITEO - #7121 - žádost o uzavření: FW: Monofil - požadavek výroba - filtrace oleje",
  "description": "Dobrý den, jen info, že nově níže zaslané – přes volbu „Zobrazit úkol“ navede do jiného zobrazení a to následující S pozdravem a přáním pěkného dne Ilona Remešová Nákupní manažerka ELTON hodinářská, a.s. M: (+420) 730 855 366| E: ilona.remesova@prim.cz< > UPOZORNĚNÍ Informace obsažené v tomto e-mailu a všech připojených souborech jsou důvěrné, mohou být chráněny zákonem a jsou určené výlučně příjemci. Nejste-li zamýšleným příjemcem, je zakázáno jakékoliv zveřejňování, zprostředkování nebo jiné použití těchto informací. Obdrželi jste e-mail neoprávněně, informujte o tom prosím odesílatele a vymažte neprodleně všechny kopie tohoto e-mailu i všech jeho příloh. From: notifications@aliteo.com <notifications@aliteo.com> Sent: Thursday, July 3, 2025 1:56 PM To: Remešová Ilona <ilona.remesova@prim.cz> Subject: ALITEO - #7121 - žádost o uzavření: FW: Monofil - požadavek výroba - filtrace oleje Pozor! Tento e-mail přišel z externí organizace. [Logo Aliteo] Nová žádost o uzavření úkolu PRIM / ELTON hodinářská, a.s.  /  NÁKUPNÍ oddělení  /  Objednávky  /  Ilona Remešová #7121  FW: Monofil - požadavek výroba - filtrace oleje Schválit     < > Zamítnout     < > Zobrazit úkol     < > [Logo Aliteo] Copyright 2022 ALITEO • Powered by KARAT Software",
  "owner": null,
  "priority": "Normální",
  "surveyquality": "Unknown",
  "surveyterm": "Unknown",
  "type": "Chyba",
  "area": "Bez",
  "comment_stats": {
    "total": 7,
    "from_owner": 3,
    "from_others": 4,
    "unique_authors": 1
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim Vas, viete mi poslat prosim aj ten email do prilohy, v ktorom to tlacidlo stlacate ? Dakujem vopred"
    },
    {
      "creator": null,
      "comment": "Zdravím, nahrané v příloze. Dnes se mi to stalo u více úkolů."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Nejak nepresla priloha, prosim odpovedzte emailom, lebo sa mi nejako nedari otvorit tu prilohu - neviem ci ste nezatvorili portal skor ako sa priloha nahrala.. dakujem a ospravedlnujems a za neprijemnosti.."
    },
    {
      "creator": null,
      "comment": "Omlouvám se a posílám znovu.\r\n\r\n\r\nS pozdravem a přáním pěkného dne\r\nIlona Remešová\r\nNákupní manažerka\r\n\r\nM: (+420) 730 855 366| E: ilona.remesova@prim.cz< >"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "dakujem pekne, zanalyzujeme a dame vediet.."
    },
    {
      "creator": null,
      "comment": "Také děkuji, vůbec to není priorita - nám to ničemu nevadí, jen jsem na to narazila, tak jsem dala vědět 🙂"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim, tak chybu sme opravili - uz by ste mali v dalsich emailoch dostavat spravne odkazy a tlacidla by mali fungovat spravne."
    }
  ]
}