{
  "id": "a06c4f1thg0hq6",
  "created": "2024-09-02T14:23:58.433Z",
  "closed": "2024-09-05T06:34:07.582Z",
  "duration_minutes": 3850,
  "first_response_minutes": 264,
  "name": "Upozorn캩n칤 - p콏idat \"stav\" u nov캩 p콏idan칳ch",
  "description": "nov칠 upozorn캩n칤 je super, jen pros칤m p콏idat \"stav\" jako je u ji zobrazen칳ch. nap콏: - vid칤m 쬰 synchronizace p콏idala koment치콏, ale a po rozkliku vid칤m, 쬰 캜ek치 na reakci. U ji p콏e캜ten칳ch vid칤m, \"v 콏e코en칤\", \"쮂멳ost k uzav콏en칤\". Osobn캩 nev칤m, k 캜emu je to \"kole캜ko s fajkou\" ale asi je to znak \"upozorn캩n칤\". - kdyby tam byl stav ikonou jako je vedle 콏e코en칤, tak by tam nemusel b칳t ten text.",
  "owner": "KSWPMS - Petr Masa콏칤k",
  "priority": "Norm치ln칤",
  "surveyquality": "Highest",
  "surveyterm": "Highest",
  "type": "Podn캩t",
  "area": "Bez",
  "comment_stats": {
    "total": 9,
    "from_owner": 3,
    "from_others": 6,
    "unique_authors": 2
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Ahoj, nejde mi otvorit obrazok.. mozes prilozit este raz prosim?"
    },
    {
      "creator": "KSWPMS - Petr Masa콏칤k",
      "comment": "zaj칤mav칠, to by se nem캩lo st치vat, 쬰 ta p콏칤loha nejde otev콏칤t , ale tak nen칤 to nic d콢le쬴t칠ho a tak p콏ilo쮂셠 jin칳 obr치zek, je jen pro dokreslen칤. tak쬰 p콏ikl치d치m:"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "@ KSWPMS - Petr Masa콏칤k (petr.masarik@karatsoftware.cz) nemalo by sa to stavat a ani sa to nedialo, ale zatial to neviem nasimulovat Co sa tyka chyby, mozem to zobrat na UI, avsak mne to prave pride z ak je to nove upozornenie, tam tych zmien moze byt viac a mas ich otvorene.. ale ked uz su \"precitane\" (otvorene a zatvorene viem) tak uz to je nejaka suhrna informacia, ktora obsahuje vycuc nejaky - stav, datum posledneho upozrnenia a pocet.."
    },
    {
      "creator": "KSWPMS - Petr Masa콏칤k",
      "comment": "nevn칤m치m to jako chybu s t칤m upozorn캩n칤. J치 jen 콏칤k치m, 쬰 i u nov칳ch upozorn캩n칤 by se hodil m칤t \"Stav\" a nemusel by b칳t textem, sta캜ila by ikonka. (nav칤c je tam u ka쬯칠ho upozorn캩n칤 ikona kter치 je v코ude stejn치 = zbyte캜n치, tak kdyby se zam캩nila za tu, co reprezentuje stav, tak by to bylo za m캩 ok, ale je to jen n치vrh."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "@ KSWPMS - Petr Masa콏칤k (petr.masarik@karatsoftware.cz) to ze mas vacsinou ulohy sposobi ze sa ti zda ze je vacsinou rovnaka.. ale akonahle tam su upozornenia na projekty, porady, body porad, timy tak uz to nieje ta ista ikona.. zoberiem teda na UI poradu tvoj podnet.. aby sa stav danej ulohy zobrazil aj v rozbalenej verzii (mimochodom tooltip takisto funguje 游뗵 )?"
    },
    {
      "creator": "KSWPMS - Petr Masa콏칤k",
      "comment": "ok, to mi nedo코lo - tak쬰 tam to kole캜ko s fajkou nechat - znak pro 칰kol - rozum칤m. a jen tam p콏idat stav cel칠ho po쬬davku."
    },
    {
      "creator": "Peter 캝ur캜치k",
      "comment": "Zaver z porady: 1. Doplnit riadok podla poziadavky aj k novym pripadom. 2. Optimalizovat aj spacig, aby bolo jasne co k comu patri."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Pridat do sprintu 24.2 a hodit na PDU"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "@ KSWPMS - Petr Masa콏칤k (petr.masarik@karatsoftware.cz) zaradili sme do planu vyvoja - ze pridame tam ten novy riadok, zaroven zoptimalizujeme spacing, aby to bolo viac UX friendly"
    }
  ]
}