{
  "id": "a07bmulrn01mho",
  "created": "2025-05-05T20:55:12.467Z",
  "closed": "2025-05-20T20:33:43.287Z",
  "duration_minutes": 21578,
  "first_response_minutes": 550,
  "name": "dotaz \"reply to\"",
  "description": "Zdrav칤m, pokud je po콏칤zen email od anonymn칤ho u쬴vatele, kte콏칤 m치 nastaven n캩jak칳 \"reply to\" parametr. Um칤te pos칤lat emaily automaticky na tento parametr?Je mo쬹칠 toto p콏칤apdn캩 zapracovat ? d캩kuji Michal",
  "owner": "Michal P콏ibyl",
  "priority": "Norm치ln칤",
  "surveyquality": "Unknown",
  "surveyterm": "Unknown",
  "type": "Konzultace/dat. servis",
  "area": "Bez",
  "comment_stats": {
    "total": 13,
    "from_owner": 3,
    "from_others": 10,
    "unique_authors": 3
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim Vas, preberiem s kolegami a budem Vas informovat..."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "@ Allan Kone캜n칳 (allan.konecny@karatsoftware.cz) vies mi k tomu nieco povedat? ja neviem uplne presne co mysli.. chapem spravne ze by chcel davat do reply to nejake ID, aby sa mu vsetky emaily k jednej ulohe zgrupovali do jednej konverzacie - ak si to takto nastavis v emailovom klientovi? To sa nezda ako zly napad.. co myslis? Rozumiem tomu spravne?"
    },
    {
      "creator": "Allan Kone캜n칳",
      "comment": "Reply-to je email, na kter칳 se m치 odeslat odpov캩캞 po stisku Odpov캩d캩t. Podle mne chce abychom si zapamatovali krom캩 email i reply-to email a nap콏. p콏i po콏칤zen칤 koment치콏e pos칤lali na n캩j, tedy aby se zm캩nil komunika캜n칤 email. Je ot치zkou zda se nem치 reply-to email zapamatovat jako anonymn칤 email... ale nev칤m nakolik je to obecn칠. Mo쬹치 jde o situaci, 쬰 emaily odes칤l치 automat z jin칠ho emailu a v reply-to je skute캜n칳 zadavatel."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Mohli by ste mi prosim napisat Vas use case, aby sme lepsie pochopili pouzitie?켿 Predpokladam ze reply-to nie je parameter dostupny beznemu uzivatelovi pri odosielani emailu. Dakujem"
    },
    {
      "creator": "Michal P콏ibyl",
      "comment": "Dobr칳 den, m치me extern칤 syst칠m, kde pos칤l치me do Aliteo tickety p콏es emaily. Email je odes칤l치n \"neexistuj칤c칤 schr치nkou\", jeliko to neum칤me poslat emailem za toho u쬴vatele, ne v코ichni jsou v na코칤 s칤ti. Nicm칠n캩 ta adresa co to odes칤l치 m치 nastaveno , \"reply to parametr\" a p콏i odpov캩di na tento mail, m콢쬰me p콢vodn칤mu u쬴vateli d칤ky tomu odpov캩d캩t. Michal"
    },
    {
      "creator": "Allan Kone캜n칳",
      "comment": "Dane pak je to jak jsem 콏칤kal, i ten use case. Asi vra콘 na poradu a m콢쬰me se dohodnout, 쬰 reply to vezmeme p콏ednostn캩 jako email vlastn칤ka."
    },
    {
      "creator": "Michal P콏ibyl",
      "comment": "Dobr 칳den, je to jasn칠, nebo k tomu je코t캩 n캩co pot콏ebujete? d칤ky za info MIchal"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Je nam to jasne, preberieme podnet na porade a dam Vam vediet.. Dakujem"
    },
    {
      "creator": "Peter 캝ur캜치k",
      "comment": "Zaver z porady: Akceptujeme, dopracujeme podla poziadavky. Vytvorme do vyvoja."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdrav칤m, prebrali sme s kolegami a zarad칤me t칰to po쬴adavku do v칳voja. Sumarizujem: v pr칤pade 쬰 prich치dzaj칰ci email m치 vyplnen칳 parameter Reply-to, tento email sa stane vlastn칤kom 칰lohy. Mozeme tento pripad uzatvorit?"
    },
    {
      "creator": "Michal P콏ibyl",
      "comment": "dobr칳 den, od d칤ky za info a m치te p콏edstavu, kdy by to mohlo b칳t implementov치no? d캩kuji"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Pokusim sa zistit podla planu a dam Vam vediet"
    },
    {
      "creator": "Peter 캝ur캜치k",
      "comment": "Zdrav칤m v치s @ Michal P콏ibyl (Michal.Pribyl@respect.cz) va코a po쬴adavka je u쮁 zapracovavan치 a bude dostupn치 v najbli쮄면j verzii, ktor칰 pl치nujeme vyda콘 do mesiaca. D치me V치m vedie콘, ke캞 bude vonku. D칤ky za podnet멇릦"
    }
  ]
}