{
  "id": "a05nm36q500o39",
  "created": "2024-03-27T18:25:00.267Z",
  "closed": "2024-03-28T12:45:15.362Z",
  "duration_minutes": 1100,
  "first_response_minutes": 785,
  "name": "uzav콏en칤",
  "description": "Nev칤m, jak to c칤t칤 ostatn칤, ale mn캩 tento dialog z obr치zku v쬯y vystra코칤. Dal코칤 v캩c je, 쬰 jej mus칤m zav콏칤t, abych si mohl p콏e캜칤st ten text, kter칳 je pod n칤m, proto쬰 nev칤m, co mi tam ten 콏e코itel p칤코e. Mo쬹치 se tam p칤코e, 쬰 se na to 콏e코itel vyka코lal a chci to zam칤tnout, nebo to mo쬹치 vy콏e코il a chci to schv치lit, ale to bez p콏e캜ten칤 toho textu nev칤m, tak쬰 dialog mus칤m zav콏칤t a pak u m치m na sv치len칤 norm치ln칤 tla캜칤tko. Nenapad치 m캩, kdy bych tento dialog pou쬴l.\r\n\r\n[Image001]",
  "owner": "Pavel Drtil",
  "priority": "Norm치ln칤",
  "surveyquality": "Highest",
  "surveyterm": "Highest",
  "type": "Konzultace/dat. servis",
  "area": "Bez",
  "comment_stats": {
    "total": 12,
    "from_owner": 2,
    "from_others": 10,
    "unique_authors": 3
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Ahoj Pavle, mozem k tomu povedat: - chcelo sa to aj zo strany KSW - kedze zakaznici nezatvarali pripad, ktore nasi navrhli na uzatvorenie - tato pripomienka sa mozue zjavovat pri: - otvoreni pripadu - pri odoslani komentar a nastavuje sa to separatne, teda to mozes aj vypnut: Co teda navrhujes? Resp co potrebujes?"
    },
    {
      "creator": "Pavel Drtil",
      "comment": "캛au, nev칤m, kdo to cht캩l, tak to s n칤m nem콢쬿 konzultovat. Uzn치v치m, 쬰 opravdu n캩kdy chceme hrozn칠 hovadiny. Hlavn캩 na코i klienti p콏i uzav콏en칤 dostanou 10 dn콢 na odpov캩캞 a pokud to neuzav콏ou, tak se to uzav콏e samo. T칤m sp칤코 ten terorizmus v podob캩 plachty p콏es celou obrazovku ned치v치 smysl. Je코t캩 to je umocn캩no t칤m, 쬰 takto t콏eba schvaluj칤 fakturaci a vlastn캩 nev칤, co schvaluj칤. V m칠m nastaven칤 nic takov칠ho nen칤, tak쬰 p콏edpokl치d치m, 쬰 je to n캩jak칠 nastaven칤 spole캜nosti nebo n캩캜eho, kam se nedostanu. Tak쬰 asi m치m cht칤t n캩jak칠 info od LBE nebo nev칤m koho. Co tedy chci? Sezn치men칤 s pachatelem."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "no mozete sa o tom porozpravat s @ KSWPMS - Petr Masa콏칤k (petr.masarik@karatsoftware.cz) 游뗵 good luck 游뗵"
    },
    {
      "creator": "KSWPMS - Petr Masa콏칤k",
      "comment": "@ Pavel Drtil (pavel.drtil@karatsoftware.cz) cht캩li jsme to za Servis - proto je to povoleno (po쬬dov치no) v pracovn칤m prostoru Assistance. Neust치le 콏e코칤me, 쬰 n캩kdo nev캩d캩l, 쬰 se po n캩m chce uzav콏칤t po쬬davek, p칤코ou tma, 쬰 je mo쬹칠 uzav콏칤t, ale nezm치캜knou tla캜칤tko pro uzav콏en칤. 콎e코en칤m by bylo, od코krtnout prvn칤 volbu - p콏i vstupu - nyn칤 ur캜it캩 na v칳voji a o Assistance se m콢쬰me pobavit a se MHR vr치t칤 z dov - z칤sk치me zp캩tnou vazbu od z치kazn칤k콢. @ Lubom칤r Bedn치콏 (lubomir.bednar@karatsoftware.cz) pls m콢쬰코 na prac. prostoru v칳voje od코krtnout prvn칤 volbu?"
    },
    {
      "creator": "Pavel Drtil",
      "comment": "Jsme si o tom volali, druh치 fajka nen칤 probl칠m. Na v칳voji n캩jak칳 tlak na uzav칤r치n칤 vlastn칤kem nen칤 pot콏eba, tak쬰 p콏i vstupu nen칤 pot콏eba. V캩콏칤m, 쬰 to Lubo코ek vypne. Naㅁssistance je za m캩 ten tlak p콏ehnan칳, ale jako posta캜uj칤c칤 beru p콏칤slib, 쬰 se nad t칤m n캩kdo je코t캩 se zp캩tnou vazbou zamysl칤. Podle m캩 by n캩jak칠 zv칳razn캩n칤 tla캜칤tka schv치len칤 vlastn칤kovi ud캩lalo v캩t코칤 slu쬭u. Nebo u p콏칤pad콢 s fakturac칤 vkl치dat t콏i dny p콏ed automatick칳m uzav콏en칤m dal코칤 upozorn캩n칤 do p콏칤padu. Ka쬯op치dn캩 to ji nen칤 probl칠m ALITEO a p콏칤pad se tedy m콢쬰 uzav콏칤t. D캩kuji."
    },
    {
      "creator": "KSWPMS - Petr Masa콏칤k",
      "comment": "a jen dopln칤m z praxe, tak j치 jsem vlastn칤kem hodn캩 p콏칤pad콢 a je pravda to, co 콏칤k치 PDR a 쬰 ten dialog stejn캩 v쬯ycky zav콏u. (a to 콏칤k치m s v캩dom칤m toho, kdo prosazoval, 쬰 ho tam chceme v assistance). Ale z치rove켿 kdy ho tam m치m, tak jasn캩 v칤m, 쬰 se po m캩 chce uzav콏칤t po쬬davek a to je to, co se cht캩lo."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "ok, som rad ze ste si to vyhovorili..takze staci ked sa to nastavi vo vasom priestore.."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "@ Pavel Drtil (pavel.drtil@karatsoftware.cz) vidis a ja to nastavene nemam 游뗵"
    },
    {
      "creator": "Lubom칤r Bedn치콏",
      "comment": "m캩l jsem jinou pr치ci a ne jsem v치m nachystal data, u se to zav콏elo, ale nevad칤. Zapl jsem to j치, v캩dom캩 a m캩l jsem z dan칠 funk캜nosti radost, jeliko jak po쬬davky na pl치n v칳voje tak i operativu pro jin칠 se 캜asto uzav칤ralo automatem a to se m캩 moc nel칤bilo. 25.3.2024 jsem to zapl, (ch치pu, je to kr치tk치 doba), ale v칳voj uzav콏en칤 automatem je takov칳to zde je podklad AO - 칰koly_20240328014828.xlsx tedy za m캩 p콏esn캩 to co jsem o캜ek치val, 쬰 se po캜et uzav콏eno automatem zmen코칤 na minimum (a to pozor, to jsou 쮂멳치ny o schv치len칤 na코e osoby, n칠 z치kazn칤k). Ale OK, j치 jsem s치m rozhodl, zapnu to, PavelD 콏칤k치 vypni to, je to jeden na jednoho a tak nyn칤 d치m dle Pavla, pokud n캩kdo rozhodne, 쬰 je lep코칤 m칤t vy코코칤 procento uzav콏enosti p콏칤pad콢 jinak ne automatem, d치 se to kdykoliv zapnout :-D Nyn칤 vypnuto Lubo코"
    },
    {
      "creator": "Lubom칤r Bedn치콏",
      "comment": "N캩komu by se mo쬹치 mohl l칤bit takov칳 graf (je to jen za projekty Pl치n v칳voje a Operativa), jeliko dokumentace a testov치n칤 m치 vlastn칤ka, kter칳 se do AO nehl치s칤, tedy tam to skoro ve 100% bude automat"
    },
    {
      "creator": "Lubom칤r Bedn치콏",
      "comment": "tak je코t캩 na uzav콏en칠m p콏칤padu nelze opravit intern칤 koment치콏, tak zde i s 캜칤slama"
    },
    {
      "creator": "Lubom칤r Bedn치콏",
      "comment": "pro zaj칤mavost v칳voj uzav콏enosti automatem v pracovn칤m prostoru Asisstance mno uvid칤me, mo쬹치 se tam n캩kte콏칤 vlastn칤ci ani nep콏ihla코uj칤 a tak se to bude zav칤rat automatem i tak"
    }
  ]
}