{
  "id": "a05r43u54g1mfc",
  "created": "2024-04-23T11:20:45.532Z",
  "closed": "2024-04-29T10:43:37.682Z",
  "duration_minutes": 8602,
  "first_response_minutes": 519,
  "name": "Porada + Make + Konzultace",
  "description": "Dobr칳 den,\r\nM치m na v치s dv캩 prosby:\r\n\r\n  *   Kolega v r치mci na코칤 Porady veden칤 vytvo콏il poradu s opakov치n칤m a opakuje se mu neust치le vnit콏ek porady. Pot콏eboval by to zm캩nit a nem콢쬰me p콏ij칤t na to, jak j칤 zm캩nit obsah od te캞 d치l. Popravd캩 nev칤m ani jak tu poradu zastavit, aby se neopakovala.\r\n[Image001]\r\n  *   M치me projekt se syst칠mem Make a hled치me mo쬹칠 automatizace. Nem치te n캩kde rozchozen칳 p콏칤klad integrace? Pokud ne, pros칤m, moc by n치m to pomohlo. 游땕\r\n  *   Jak jsem m캩l nyn칤 tu hodinu 코kolen칤 na Aliteo. Pros칤m, pot콏eboval bych je코t캩 jednu hodinu, kde bychom probrali automatizace. Zalo쬴l jsem nov칳 prostor i projekt a ud캩lal jsem to spr치vn캩 podle etap, ale r치d bych si tam je코t캩 pohr치l s atributy a povinnostmi zapisovat tyhle v캩ci p콏i p콏esunu do jin칳ch etap, ale nem콢쬿 na to 칰pln캩 doj칤t.\r\nMoc d캩kuji\r\n\r\nS pozdravem a p콏치n칤m p캩kn칠ho dne\r\n\r\nIng. Ji콏칤 Dvo콏치k, Ph.D.\r\nMana쬰r digitalizace\r\n[Image002]\r\nNC Line a.s.\r\n742 01  Suchdol nad Odrou 233\r\nMobil: +420 608 242 700\r\nE-mail: dvorak@ncline.cz\r\nInternet: www.ncline.cz",
  "owner": "Neregistrovan칳 u쮂셨ate",
  "priority": "Norm치ln칤",
  "surveyquality": "Unknown",
  "surveyterm": "Unknown",
  "type": "Konzultace/dat. servis",
  "area": "Bez",
  "comment_stats": {
    "total": 6,
    "from_owner": 0,
    "from_others": 6,
    "unique_authors": 2
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim vas, 1 - zastavenie rady porad - otvorit poradu, kliknete na \"Radu porad\" kliknete pre upravu nastavenia, a skratite datum ukoncenia na dnesny/zajtra (kedy chcete ukoncit) den a odoslete zmeny, vid tento gif: 2 - co sa tyka prepojenia, tak k tomu mame dostupnu API dokumentaciu na tejto adrese: https://api.aliteo.com/swagger/ui 3 - ad konzultacia - na to si zalozime novu ulohu, kde sa dohodneme - len sa dohodnem s kolegom v ktorom projekte a budem Vas informovat.."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "@ Peter 캝ur캜치k (peter.durcak@karatsoftware.sk) prosim Ta, kde sme hovorili ze budeme zakladat tieto hodinove konzultacie pre NC Line? do Karatu alebo len tuto v supporte ako platenu konzultaciu. Vyhoda v karate je, ze urobim vykaz prace a hotovo. A v supporte by som asi musel davat si tvorit fakturu a nejako to riesit nie?"
    },
    {
      "creator": "Peter 캝ur캜치k",
      "comment": "jj urcite to sprav v KA, tam to pojde autonomnejsie, ak maju vytvoreny projekt, ak nie tak vytvorme ako fakturacia hodinovkou, ktoru dohodol Peter."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "@ Peter 캝ur캜치k (peter.durcak@karatsoftware.sk) spravil som ulohu #292091 Konzultacia ALITEO 2 len neviem preco nemozem nastavit p. Dvoraka ako vlastnika. V inej ulohe v tom isto projekte vlastnikom je. Dokonca ju zalozil. Cakam na vyjadrenie od AKO."
    },
    {
      "creator": "Peter 캝ur캜치k",
      "comment": "@ Daniel Dzuro (daniel.dzuro@karatsoftware.sk) koli tomu, ze ta uloha bola prenesena i ineho projektu."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "@ Peter 캝ur캜치k (peter.durcak@karatsoftware.sk) ano, uz mi to AKO vysvetlil ked to skumal lebo ja som na to neprisiel.. :) nevadi dik"
    }
  ]
}