{
  "id": "a0844e9gjg0da0",
  "created": "2025-11-11T13:25:02.470Z",
  "closed": "2025-11-16T19:21:10.160Z",
  "duration_minutes": 7556,
  "first_response_minutes": 195,
  "name": "#325746",
  "description": "Dobrý den,\r\nviděla jsem, že jste případ #325746\r\npředali na p. Straku, ten je ale hodně vytížený a my toto potřebujeme udělat přednostně a docela rychle.\r\nDěkuji\r\n\r\nS pozdravem / Best regards\r\n\r\n\r\n\r\nMgr. Lucie Sapáková\r\n\r\nIT Manažer\r\n\r\n\r\n\r\ntel. +420 724 504 328 | e-mail: lsapakova@pal.cz\r\n\r\nP & L, spol. s r.o. | Oslavice 209 | 594 01 Oslavice\r\n\r\nWeb < > Facebook < > Youtube < > Instagram < >\r\n\r\n\r\n\r\n\r\nPokud není uvedeno jinak, je obsah této e-mailové zprávy důvěrný a legislativně chráněný. Zpráva je adresována pouze uvedenému adresátovi. Jakákoliv jiná osoba nemá právo získávat ani nijak používat informace obsažené v této zprávě. Pokud nejste určeným adresátem, jakákoliv Vaše manipulace s těmito informacemi, týkající se reprodukce, šíření, kopírování, otevírání, úprav a/nebo publikování této e-mailové zprávy, je přísně zakázána a může být považována za protizákonnou. Pokud se k Vám tato e-mailová zpráva dostala omylem či porušená, informujte nás prosím neprodleně na info@pal.cz. V takovém případě prosím odstraňte tuto zprávu z Vašeho počítače.\r\n\r\n ​​\r\n\r\nUnless explicitly stated otherwise, the information in this e-mail is confidential and may be legally privileged. This e-mail is intended solely for the addressee. Access to this e-mail by anyone else is unauthorized. If you are not the intended recipient, any action taken or omitted to be taken in reliance on it, any form of reproduction, dissemination, copying, disclosure, modification, distribution and/or publication of this e-mail message is strictly prohibited and may be unlawful. If you have received this e-mail message in error, please e-mail info@pal.cz to inform us immediately. In such case please destroy and delete the message from your computer.\r\n\r\n​",
  "owner": null,
  "priority": "Normální",
  "surveyquality": "Unknown",
  "surveyterm": "Unknown",
  "type": "Podnět",
  "area": "Bez",
  "comment_stats": {
    "total": 1,
    "from_owner": 0,
    "from_others": 1,
    "unique_authors": 1
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Dobrý deň, portal support@aliteo.com riesi primarne technicku stranku aplikacie ALITEO. Nevieme Vam teda pomoct s problemami tykajucimi sa spolocnosti KARAT. Ak to chapem spravne, mate problem s riesenim ulohy v ramci ISK. Napiste to priamo do pripadu pripadne kontaktujte servis managera. Ďakujem S pozdravom ALITEO support team"
    }
  ]
}