{
  "id": "a05nl3qrpg17nq",
  "created": "2024-03-27T12:42:19.391Z",
  "closed": "2024-04-10T06:46:15.648Z",
  "duration_minutes": 19803,
  "first_response_minutes": 161,
  "name": "Projekty - pohled nezobrazuje řídící úkoly - počet",
  "description": "v pohledu projektů se zobrazuje počet řídících úkolů 0 a i když jsou aktivní 3",
  "owner": "Juraj Matěj",
  "priority": "Normální",
  "surveyquality": "Unknown",
  "surveyterm": "Unknown",
  "type": "Chyba",
  "area": "Bez",
  "comment_stats": {
    "total": 7,
    "from_owner": 1,
    "from_others": 6,
    "unique_authors": 3
  },
  "comments": [
    {
      "creator": "Juraj Matěj",
      "comment": "Otázka je, jestli je správně, že řídící úkoly naplánované k reakci teamu jsou chápány jako \"aktivní\"."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Ak zrusis reakciu, objavia sa v tomto pocitadle? podla toho co som si testoval, tak ak das na reakciu, tak sa odpocitaju z riadiacich a pripocitaju k reakcnym.. Problem je ze ked sa da na reakciu vlastnika alebo ineho projektu ci timu  - potom sa strati uplne.."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "@ Allan Konečný (allan.konecny@karatsoftware.cz) je spravne ze - mam riadiacu ulohu: - je v rieseni - objavuje sa v pocitadle \"aktivne riadaice ulohy\" - dam do reakcie na ten isty projekt - zmizni z pocitadla na \"aktivne riadiace\" a pribudne do pocitadla pre \"ulohy na reakciu\" - dam do reakcie vlastnika alebo ineho projektu/tímiu - zmizne z pocitadla  \"aktivne riadiace\" uplne"
    },
    {
      "creator": "Allan Konečný",
      "comment": "To je podle mne zcela správně, v čem je problém?"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Uprimne si nie som isty  - riadiaca uloha je stale riadiacou ulohou aj ked zmeni stav.. Poradme sa na porade.."
    },
    {
      "creator": "Peter Ďurčák",
      "comment": "Zaver z porady: Ostava to tak ako to je."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "@ Juraj Matěj (juraj.matej@karatsoftware.cz) zda sa to teraz spravne ako to je.. ze tie ulohy preskakuju z pocitadla do pocitadla podla ich stavu.. v principe tie pocty by mali kopirovat tie iste pocty v detaile ulohy  (kombinacia spravne zalozky a nastaveneho radio buttonu v lavom paneli):"
    }
  ]
}