{
  "id": "a07nnreen01kv7",
  "created": "2025-08-07T07:07:09.906Z",
  "closed": "2025-08-08T08:14:12.731Z",
  "duration_minutes": 1507,
  "first_response_minutes": 19,
  "name": "presiahnut칤 po캜et 칰loh",
  "description": "Dobr칠 r치no, Dnes mi system vyhodil t칰to hl치코ku o prekro캜en칤 30 akt칤vnych 칰loh, no vo filtra na 쬬vej strane m치m vyfiltroven칠 akt칤vne tasky a celkovo mi ich zr치talo 19. Viete sa mi pros칤m na to pozrie콘 ? Aj v minulosti som narazil na tento limit a po uzatvoren칤 akt칤vnych 칰loh, mi system dovolil pokra캜ova콘. V캞aka za pomoc Tom치코 Pol치k Project Leader [Image002] 3EC International a.s. Ru쬺v치 605/2 920 42 캛erven칤k Slovensk치 republika Mob.:   +421 (0)917 909 353 www.3ec.sk< >",
  "owner": null,
  "priority": "Norm치ln칤",
  "surveyquality": "Unknown",
  "surveyterm": "Unknown",
  "type": "Konzultace/dat. servis",
  "area": "Bez",
  "comment_stats": {
    "total": 8,
    "from_owner": 3,
    "from_others": 5,
    "unique_authors": 1
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim, nachadzate sa v projekte, ja by som radsej zistoval vsetky ulohy tak ze by som: - otvoril evidenciu Ulohy (v cierneho hornej liste) - vytvoril by som pohlad, kde by som zadal vsetky moznosti (okrem archivovanych - tie sa nepocitaju do licencie) A to je vlastne pocet ktory by mal sediet v poctom licencii v nastaveni spolocnosti. -> Skuste to tak a poslite mi info ci to sedi.."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Pridavam este jednu informaciu - uistite sa ze mate zapnute pravo supervizor bez neho nevidite vsetky ulohy."
    },
    {
      "creator": null,
      "comment": "urobil som ten nov칳 poh쬬d a zobrazilo mi tam 27 tiketov (neuvedomil som si 쬰 uzavret칠 s칰 tie akt칤vne a 쬰 sa do akt칤vnych nazah콋켿aj칰 len archivovan칠) a v licencii mi uk치zalo 30.  Tak to je d칪vod k칰pi콘 licenciu :)"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "No ako som pisal, v druhom komentari, ktory ste uz asi nevideli - mate zapnuteho supervizora? Ak existuje viacer uzivatelov a ani jeden nema zapnuteho supervizora potom sa moze stat ze jeden nevidi ulohy toho druheho (za predpokladu, ze v kazdej sa nedaju navzajom sledujucimi). Skontrolujte to, mozno tie tri zalozil niekto iny a nemate na nich pravo, preto ich vidite 27 a nie 30."
    },
    {
      "creator": null,
      "comment": "v코imol v코imol, ja som tento projekt zakladal tak ja predpoklad치m 쬰 som administr치tor a 칰primne ani nevid칤m mo쬹os콘 kde si zapa콘 suprev칤zora."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "No administrator a supervizor su 2 separatne role: - admin - dokaze nastavovat vsetko co vidi - supervizor - dokaze vidiet vsetko je to preto lebo vela krat sa chce aby niekto vsetko videl ale nemal pravo nieco nastavovat a vice versa. Supervizora si mozete zapnut v nastaveni spoocnosti -> uzivatelia -> vyberiete seba a potom nizsie su moznosti administrator, supervizor atd."
    },
    {
      "creator": null,
      "comment": "치no zafungovalo to. Ke캞 som si zapal superv칤zora, tak som uvidel tikety 캜o zalo쬴la kolegy켿a ke캞 to testovala.  Len teda nerozumiem, pre캜o m치 admin obmedzen칳 poh쬬d na tikety a superv칤zor vid칤 v코etko. Tieto role a pr치va mi v쬯y robili probl칠m pochopi콘 aj v SAPe aj Microsofte aj Jire, ale ob캜as to d치valo logiku ale pam칛t치m si, 쬰 v쬯y to bolo z m칪jho poh쬬du extr칠mne komplikovan칠 na pochopenie, ale tak z치klad, je 쬰 je dobr치 a sk칰sen치 podpora, ktor치 vie o 캜om 游뗵. Ok tak m칪쬰me zatvori콘 aj tento tiket, bu캞 teda niektor칠 tikety poma쬰m alebo teda k칰pim licenciu aspo켿 pre seba, nech si tam zaznamen치vame zmenov칠 po쬴adavky a budem ich linkova콘 na ten sum치rny tiket v SANGO"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "U nas je to s tymy pravami jednoduche, skusim popisat v skratke: Zakladne superprava: - admin - nastavuje vsetko - supervizor - vidi vsetko (je mozne este modifikovat ci ma len vidiet alebo vidiet + upravovat) Miesto kde mozu byt tieto prava zapnute - su dedicne a teda: - na spolocnosti - potom automaticky plati na vsetky pracovneho priestory (projekty v nich) a timy a ulohy v nich - na pracovnom priestore - plati pre vsetky projekty v nom a ulohy v nich - v projekte - plati pre projekt iba a ulohy v nom - v time - plati na tento tim a ulohy v nom Pomoze mozne tento obrazok: Este tam su nejake prava ale tie su specificke - teda ktore spristupnuju konkretnu funkciu.. Vsetko by malo byt dostupne na help.aliteo.com Ulohu teda zatvaram a dakujem 游뗵"
    }
  ]
}