{
  "id": "a05tu7l0ag0pd0",
  "created": "2024-05-15T08:18:36.378Z",
  "closed": "2024-05-21T08:31:08.571Z",
  "duration_minutes": 8652,
  "first_response_minutes": 78,
  "name": "Past ve formě kolapsu editoru komentáře s velkým textem",
  "description": "Ahojte, omylem jsem z clipboardu do textového pole pro psaní komentáře vložil hodně velký text (asi 5500 řádků) a jsem v pasti.... Nemůžu dát Ctrl+Z, můžu dát Ctrl+A, ale delete, nebo backspace způsobí totální zaseknutí stránky (cosi to šrotuje ve scriptu a vytěžuje morbidně procesor). Pokud dám znovu načíst stránku tak se mi zpět načte s tím obr textem v komentáři. Takže nemám možnost co dělat, snad bych musel jít smazat data stránky....",
  "owner": "Lukáš Trunečka",
  "priority": "Normální",
  "surveyquality": "Unknown",
  "surveyterm": "Unknown",
  "type": "Chyba",
  "area": "Bez",
  "comment_stats": {
    "total": 32,
    "from_owner": 13,
    "from_others": 19,
    "unique_authors": 2
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Ahoj, chapem, takze je problem s velkym textom.. je tak? Resp vlozenie je ok, ale akonahle ho chces cely oznacit a potom dat delete tak sa to kusne?"
    },
    {
      "creator": "Lukáš Trunečka",
      "comment": "No tak nějak.... Možná v tom hrálo roli i to, že jsem intuiivně zmáčkl Ctrl+Z... to nezafungovalo, tak pak Ctrl+A a Backspace.... protože když jsem si to zkusil znova, tak mi to bez toho Ctrl+Z fungovalo...."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "ok, predal som na vyvoj.. dik za report.. chces nechat otvorene?"
    },
    {
      "creator": "Lukáš Trunečka",
      "comment": "Ano..."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Prosim Ta, vies mi napisat pocet znakov o kolko islo v tom komentari? Lebo moze ist o riadok plny textu alebo aj par znakov.."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "- skusal som to nejak odhadom tak z obrazka mi vyslo ze mas priemerne 30 znakov na riadok x 5500 riadkov, tak to mame 165000 znakovň - tento objem dat som sa snazil dat do konkurencnych nastrojov a bol to problem aj tam, jeden nastroj chcel reload a ani neulozil, druhy neumoznil vlozit taky objem - metodou polenia intervalov som sa dostal na nejaku hranicu 45 000, kto oba nastroje zvladli aj ctrl+z a aj postnut - skusal som do dat aj k nam do komentara, ctrl+z nefunguje (to vieme a nefunguje to aj pri 10 znakoch) ale ctrl+a a del fungoval bezu problemov - moj a asi aj Allanov navrh je obmedzit pocet znakov co myslis?"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "este inak, asi ide o speci text, lebo som nakoniec skusil aj k nam vlozil 186000 znakov a ctrl+a a potom DEL mi zafungoval mam teda podozrenie ze je tam nejaka cast kodu, ktora spobuje problem.."
    },
    {
      "creator": "Lukáš Trunečka",
      "comment": "long_text_example.txt Toto ;-) Jinak ano, asi by neměl být problém to omezit na nějaký rozumný počet znaků, ale nerad bych na něj narážel při běžných situacích. Má to být takový počet, který je běžným psaním textu člověkem těžko dosažitelný, ale ošetřuje to, že někdo něco vloží z clipboardu. Ale taky zároveň je potřeba mít ošetřené to, že když už se někomu podaří tam něco omylem z clipboardu vloží, tak že to může vrátit zpět, což ta moje situace byla taková, že běžný uživatel byl v pasti.... musel jsem přes F12 jít a odebrat vnitřní elementy z editable divu. Pravděpodobně to po tom Ctrl+Z bylo v nějakém marném zacyklení, protože to přes F12 nešlo ani pausnout, abych se podíval v čem se to zacyklilo."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Nerozumiem co si skusal: - do komentara si vlozil text ktory ma, ak som to dobre vybral cez 25k riadkov (neviem preco do komentara - asi aby sa mi horsie pracovalo :) ) - prilozil si textak, ktory ma 450 riadkov Ani jeden sa nezda byt velkostou ten ktory ti sposobil problem. Tych 450 vlozenie, ctrl+a a del mi nesposobil problem, tych 25k riadkov kopirovat a skusat nebudem.. :) Prosim posli mi v txt ten kod ktory ti sposobil problem - 5500 riadkovy"
    },
    {
      "creator": "Lukáš Trunečka",
      "comment": "Ano, moc se omlouvám, ujelo mi to, omylem jsem do komentáře vložil text z clipboardu a omylem zmáčkl Odeslat komentář. Fakt jsem \"nechtěl\", ale systém mi to umožnil a já to prostě zmáčkl a ono to prošlo..... ;-) ... jj, přilohu jsem dal špatně jiný text.... posílám správný long_text_example2.txt"
    },
    {
      "creator": "Lukáš Trunečka",
      "comment": "Jo a ano, nevím jak jsem původně přišel na těch 5500 řádků, možná jsem se blbě koukl na pozici v textu.... ale mělo to být cca 17 tis. řádků - tedy tu se upřímně omlouvám za mistifikaci. Jinak ano, nebuď srab :-) a do clipboardu ten 1M textu vezmi... my s tím celkem běžně pracujeme a snadno se to stane ;-)"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Lukas, je to v poriadku ze zoberies takyto obsah textu do clipboardu, ale je nezmysel toto davat do komentarov. Vzhladom na to, ze vidim ze ti preslo aj 25k riadkov co je ak som dobre pozeral cez 1 mil znakov, tak to asi nema zmysel takto skusat. Evidentne nie je problem vo velkosti textu a co v tom texte bolo, ktory si pastol a ja neviem ako prist na to, co to sposobilo. Bolo by dobre aby si sem dal teda len ten text, ktory evidentne zhodil komunikaciu.."
    },
    {
      "creator": "Lukáš Trunečka",
      "comment": "Tedy ještě jednou, zcela vážně a polopatě. Máme dva scénáře: 1) Uživatel má z předchozí práce v clipboardu 1M text a v domění, že před tím zkopíroval jiný text, vloží to do pole s komentářem. To se úplně klidně může stát a úplně klidně tam může mít třeba 100MB. Aplikace má mít toto ošetřené buď tak, že před paste kontroluje kolik dat se bude vkládat, nějak to omezuje a nedovolí to. Pokud to nejde takto ošetřit, je potřeba dát uživateli možnost se takového textu zbavit z textového pole, což nelze. Text, který to způsobil jsem přiložil v textovém souboru v ##11 2) Kdokoli, klidně i ze škodolibosti, blbosti může udělat to, co jsem schválně demonstroval a tedy pokud to textové pole umožňuje, tak vloží extrémně velký text. Systém musí být proti tomu odolný a ošetřovat to jak na úrovni toho, že nedovolí, aby přes textové pole takový text prošel, což ale nezamezuje tomu, aby text i tak serveru odeslal větší a tím pádem to má být ošetřeno i na úrovni funkčnosti, která ta data zpracovává/vkládá do DB."
    },
    {
      "creator": "Lukáš Trunečka",
      "comment": "... uznávám a omlouvám se, že jsem byl v prvních příspěvcích trošku škodolibý."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "- ak ti to robi dobre, kludne pokracuj v skodoradosti :) tak nejak som si na to zvykol - suhlasim - kontrola pri vlozeni na obsah - idealne na velkost aj pocet znakov - skusal som tych 1mil znakov, problem s vlozenim nebol, s oznaceniom takisto nie, ale pri mazani uz stranka neodpovedala.. takze obmedzime velkost co ja viem na 30000 znakov - osobne by som dal este menej - nema zmysel robit tak obrovsky komentar na 8x A4. Dal by som este menej a s hlaskou ze to je prilis velke, nech si to daju ako dokument do priloh. Tak to navrhnem aj na porade.."
    },
    {
      "creator": "Lukáš Trunečka",
      "comment": "Ano, zaseknutí při pokusu o smazání je onen problém ;-) S tím omezením na počet... jen opatrně s tím, aby to nezapočítávalo i objem dat z vložených obrázků do příspěvku. Díky ;-)"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Ano, jasne idealne je aby sme vedeli kde je text a kde su nahlady obrazkov - ak to dokazeme tak potom vieme separatne definovat limit pre znaky a separatne pre nahlady, u ktorych ale pocitam ze to je par kB. Uvidime potom, co detekujeme, co z toho textu sposobilo ten pad.."
    },
    {
      "creator": "Pavel Drtil",
      "comment": "Čau, pěkně si povídáte, ale chtěl jsem přispět spíše statistickou informací o délce příspěvku. první sloupec je zaokrouhlená délka na desítkový řád, druhý sloupec počet Pro fajnšmekry v přirozené logaritmické škále to vypadá takto: Nebo jednodušeji, co chci říct, je to, že nad 30 000 znaků je dnes téměř 8 tisíc komentářů: Při limitu 64 KB by to bylo 2 tisíce komentářů: Takže spíše tak limit kolem 100 000 znaků s jedním tisícem komentářů vypadá reálněji: Pro úplnost 200 000 znaků: (A myslím si, že už i v tom jsou započteny zmenšené náhledy obrázků, protože tam vidím src=\"data:... a neumím je jednoduše z výpočtu vyloučit.) Toto je top 10: https://app.aliteo.com/task/a05fd29btg0amp/ https://app.aliteo.com/task/a04uko1nhg0i61/ https://app.aliteo.com/task/a05c1kmbk005fc/ https://app.aliteo.com/task/a05p684sf00kur/ https://app.aliteo.com/task/a0524sad9018to/ https://app.aliteo.com/task/a0524sad9018to/ https://app.aliteo.com/task/a04rre21sg02hg/ https://app.aliteo.com/task/a04p0g1nn018qm/ https://app.aliteo.com/task/a04p0g1nn018qm/ https://app.aliteo.com/task/a05tu5aii02pd0/"
    },
    {
      "creator": "Pavel Drtil",
      "comment": "Koukal jsem a ono stačí nějakých 20 obrázků a je to dlouhé: comment2.txt comment.txt a většina \"textu\" z toho komentáře tvoří nějaký ten Base64 mišmaš z náhledů: Pokud bys chtěl, tak asi můžu napsat složitější dotaz a odfiltrovat obrázky ven."
    },
    {
      "creator": "Pavel Drtil",
      "comment": "Tak nedalo mi to, i server se u toho zapotil na 45 minut a top 20 komentářů jen podle textu bez img: Top ten odkazy: https://app.aliteo.com/task/a0415nl5vg08tg/ https://app.aliteo.com/task/a03qd3enng0gth/ https://app.aliteo.com/task/a043ht12e0145a/ https://app.aliteo.com/task/a03talgep0183d/ https://app.aliteo.com/task/a029568cc01c9v/ https://app.aliteo.com/task/a03u11n3qg1019/ https://app.aliteo.com/task/a03u0pshbg1019/ https://app.aliteo.com/task/a03t4ikb300eg3/ https://app.aliteo.com/task/a02956aji011ig/ https://app.aliteo.com/task/a03t4ikdmg0eg3/ Takže jen texty bez obrázků jsou většinou dlouhá chybová hlášení, většinou z update databáze. Často je tam takto vkládá přímo klient. Asi je to zamrzí, když to nepůjde, ale donutí je to dát do přílohy. Bez obrázků by těch 30 tisíc znaků (nebo spíše až 2x víc) mělo cca vyhovět. S náhledy řekněme těch 100 tisíc znaků (nebo spíše až 2x víc) by mělo také cca vyhovět. V principu jste tedy měli oba pravdu a sry, pokud jsem se nevhodně vmísil. Pokud jsem pomohl, tak se rádo stalo."
    },
    {
      "creator": "Lukáš Trunečka",
      "comment": ":-D .... fakta jsou potřeba ;-)"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "dik, avsak nie som ani v jednej ulohe sledujuci, takze neotvorim nic.. trochu prilejem do ohna, chcete mi povedat ze sa Vam takto dobre pracuje? ze analyzujete chybu v komentari ALITEO . Nekopirujete si to niekam, kde mozete lepsie hladat resp, kde Vam iny nastroj farebne zafarbi syntax a podobne ? Za mna to nie je ok, ja by som tak pracovat nechcel... kam tym mierim je to, ci by sme nemal zapracovat na postupe aby to tam tak zakaznik nedaval, nech to da tak ako to my potrebujeme - obmedzenim velkosti ich k tomu tak trochu aj donutime.. videl by som priestor viac v tom aby ste vy potom ten kod otvorili v toole kde chcete rychlejsie"
    },
    {
      "creator": "Lukáš Trunečka",
      "comment": "Dal jsem tě zde do sledujících #108320 patche (KA:108247) No, máš určitě pravdu, že by bylo fajn různé logy, kousky kódů, hlášky apod. dávat do příloh.... jenže to by pak muselo fungovat fulltextové vyhledávání i v těch přílohách, což asi nejde a bojím se, že ani nepůjde. V takovém případě jsem šťastný za to, když to kdokoli hodí do příspěvku, protože pak snadno vyhledám, že se daná věc už někdy někde řešila..... Jinak případy zadané přímo z Karatu dávají do přílohy soubor Status. txt, který přikládá souhrn a případně i obsah hlášky a už teď nás dost mrzí to, že v tom nejde hledat. Dokonce bychom očekávali, že v dnešní době AI už se bude uvažovat i o realizaci možnosti vyhledávat i text nad obrázkovými přílohami.... Tím chci říct Dane, že může být i hůř a ty nároky budou naopak větší."
    },
    {
      "creator": "Pavel Drtil",
      "comment": "To nemáte nějaký servisní přístup, kde uvidíte vše? Na těch případech je prostě velký text (většinou nějaký SQL kód). Na práci to není dobré. Na druhou stranu, na toho uživatele už tak vyskočila brutální chyba a je naštvaný a přidat mu k tomu to, že mu řekneme, že mu s tím ani nepůjde založit případ, to nedopadne dobře. V lepším případě jen napíše \"nějaká chyba\" a bude z toho detektivka. Tedy pokud nemáte v plánu dotaz jako: \"Text vložený přes Ctrl+V do komentáře je příliš dlouhý, mám jej uložit jako přílohu a sem dát jen odkaz? Ano/Ne\" Jinak dnes to často končí tím, že se to do něčeho kopíruje, ale to i proto, aby mi to našlo chyby. Varianta B je, že člověk dá Ctrl+F a studuje ten vadný kousek i takto v komentáři. Většinou v jednom případu není víc než jeden takový dlouhý, takže na konec nebo začátek není problém skočit. Vytahovat ten text z přílohy totiž taky není zrovna zábava a často se přílohy přehlíží (jsou někde mimo)."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "@ Lukáš Trunečka (lukas.trunecka@karatsoftware.cz) - ano, aj to sa da osetrit - chce to len proces ktore bude dodrziavat - ostatne ak chces mat nejakui bazu znalosti, potom je dobre udrzaivat nejaky postup pri rieseni pripadu. Z toho mi vyplyva, ze ak by som som aj nasiel problem, v ktorom viem ze tento kus kodu je podstatny, nevidim problem v tom, aby sa na zaver púre ucely zberu knowledge vytiahol vysek kodu, ktory bol problem a mavime sa o tisickach a nie o milionoch znakov - suhlasim ze zahrnut AI je fajn a planujeme to v roznych podobach - ale ako iste viete pracujete aktualne s toolom za par euro a to ti proste nevyjde ak ta bude AI stat radovo viac - ano aj na to su odpovede - priplatit sa funkcionalitu, zvysit cenu tarifu atd - ale asi to ma svoj cas. Ver ze ja som posledny kto by brzdil AI, OCR a podobne feature v ALITEO @ Pavel Drtil (pavel.drtil@karatsoftware.cz) - pokial je to mozne, podme standardnou cestou a teda ja nie som supervizor v  spolocnosti KARAT, takze bohuzial nevidim vsetko - nepoznam vsetky cesty ako sa zakladaju tickety do ALITEO - ale naposledy ked som sa ponukol ze podme sa pozriet na proces bolo mi naznacene: \"vsechno vime, co nam uz jen ty chces nabidnout\". Takze od tohto upustam. - ako by to bolo mozne a ako potencialna varianta vlozenie txt a pridat ako prilohu - preco nie.. mozme prebrat - co sa tyka poslednej odrazky mne to pride spravne to studovat inde - preto vzdy budem za variantu podporit proces toho ako v tom najlepsie pracovat, ak znasilnovat funkcie nastroja, ktory na to nie je stavany aby sa priblizil tomu profi nastroju, Pozeral som na ten pripad ktory mi LTR spristupnil - v komentari je to preto lebo je to prenesene z popisu - takze to tam uzivatel sam nevlozil je to znasilnena funkcia - v prilohach je subor realne s tou hlaskou - takze tam proste je a nemusel by vznikat v komentaroch - co tak zamysliet sa nad tym, ci by nebolo mozne urobit funkcionalitu, ktora by dokazala na klik v ALITEO otvorit danu prilohu v nadefinovanom programe"
    },
    {
      "creator": "Pavel Drtil",
      "comment": "Myslím si, že jsem tady v případu nebyl nijak ošklivý, proto mě celkem uráží jakože citace \"vsechno vime, co nam uz jen ty chces nabidnout\". Jsem si naprosto jistý, že jsem nepsal slovensky bez diakritiky a i významově jsi pokroutil to, co jsem psal v úplně jiném případu. Navíc se tu v případu bavíme o tom, že ty případy zadávají klienti, takže třeba v kontextu #108320 patche (KA:108247) by si o pořizování případů povídat měla nějaká Marie Kotková z Charmontu, která přístup do ALITEO jistě má. Proč je z toho vždy nějaké brutální hádání se. Jsem tady v případu věnoval nemalý čas, abych získal nějakou statistiku velikosti komentářů, protože jsem chtěl pomoct. Neřekl jsem jediného křivého slova, či ironie, nebo sarkasmu. Dokonce jsem i psal, že bych to od nějaké velikosti zařezal, aby ty extrémní komentáře ani nevznikaly, takže jsme navíc ve shodě. Mám za to nějaké citace, které jsem ani neřekl."
    },
    {
      "creator": "Pavel Drtil",
      "comment": "Ne vážně, koukám tady a v ##21 ještě píšu \" V principu jste tedy měli oba pravdu a sry, pokud jsem se nevhodně vmísil. Pokud jsem pomohl, tak se rádo stalo.\" Kde jsem jakože šlápnul na to kuří oko? To jako tím dotazem \"To nemáte nějaký servisní přístup, kde uvidíte vše?\" - to mi přišlo na mysl, když jsem četl \"nie som ani v jednej ulohe sledujuci, takze neotvorim nic..\", že bych nějaký takový prostě čekal, výrobce obvykle toto má a nemyslel jsem to nijak špatně, spíše, že by bylo dobré to mít. Chtěl jsem se za něco špatného omluvit, ale opravdu to nevidím. Lukášovi asi dlužím zbytek informací k tomu druhému případu, když už to tu s ním řešíme. Chtěl jsem změnu v řazení komentářů, kde jsem chtěl při řazení od posledního ty bez komentáře na začátku. Logika toho je ta, že případ bez komentářů je nový, starý případ už nějaké komentáře má, že ty bez pro práci potřebuji nahoře, když mi přiskočí na dno, tak je nevidím. Byla dlouhá diskuze Dan říkal, že by ty bez komentáře chtěl vždy dole, při řazení vzestupně i sestupně, protože zrovna takto to implementoval Excel při řazení. Samozřejmě existuje mrtě jiných implementací a mohl jsem se hádat, ale za předpokladu, že tedy Dan říká, že už dnes je to blbě a já jsem to chtěl jen z jeho pohledu jinak blbě, ale pro mě dobře, technicky to bylo o trapné změně jedné konstanty, tak přesto to neprošlo. V okamžiku, kdy už mi bylo řečeno, že si mám trhnout, že na mě nezáleží a počká se, až s tím přijde skutečný klient (toto jsem úmyslně přehnal, ale snad si rozumíme, co říkám), tak mi bylo nabídnuto, že místo toho, abych si popovídal o tom, že mám pracovat nějak jinak. Abych nám ušetřil čas, tak jsem nabídl, že to oželím a to byla ta jakože citovaná jakože arogantní urážka, kdy jsem nejchytřejší. Asi bych k tomu dodal, že po těch hodinách hádání se v kruhu jsem na to opravdu neměl sil. Navíc najít cestu, jak s ALITEO pracovat, mi trvalo hodně dlouho a odhadoval jsem, že jiná cesta bude znamenat, že se uklikám k smrti (třeba přidávání značek), nebo nebudu mít právo (třeba používání nějakých sekcí nebo něčeho), že si ještě vyslechnu, jak to Allan s Lubou blbě naimplementovali, znásilnili a kde co, že se to má reimplementovat a to se stejně nestane, nebo to vyřeší něco, co přijde za pár let. Pak jsme si stejně volali, protože jsem nedal radostné hodnocení se zamítnutým námětem na triviální změnu, která nebyla proti ničemu, a kde se ve výsledku v případu neudělalo vlastně vůbec nic. Navíc si to prostě vyřeším za sebe tak, že při předání na mě triggerem založím první komentář, který přijde synchronizací, což jsem to takto znásilňovat nechtěl, ale potřebuji to nějak používat a toto řešení jsem znal, tak i proto jsem ten ústní rozhovor písemně odmítl. Z pohledu Dana to mohlo vypadat jinak a myslel jsem si, že jsme si to vyříkali, ale asi ne. (Lukáši chraň tě Bůh tady vytáhnout nultý komentář, nebo řazení za poslední aktivitu. Fakt na to nemám náladu a jen bychom spadli do toho stejného.) Takže se omlouvám i za to, co jsem neudělal a neřekl. Odeberu se ze sledujících a pokud mám o tom ještě něco vědět, tak jiným kanálem, nebo mě zpět zmiňte."
    },
    {
      "creator": "Lukáš Trunečka",
      "comment": "Pokud bych se vrátil zpět k tématu, tak jsi Dane zamlčel to hlavní - ty dlouhé a \"nesmyslné\" texty jsou v komentáři i proto, aby byly vyhledatelé, protože v přílohách je nic nenajde. A tohle žádný proces a metodika nespraví. Těch případů se valí opravdu hodně od zákazníků a není možné každý jednotlivý případ honit po zákazníkovi způsobem, že se mu bude neustále vracet dokud nesplní všechny metodické pokyny k správnému zadání případů. A odbavující člověk bude buzerovaný za to, že nechal něco v komentáři, nerozpadl to do příloh, nevypreparoval co měl (on to v tu dobu ani nemusí vědět, co v tom logu bylo hodnotného), navíc kdybych z toho  chtěl nějaký souhrn, AI mi ho může dát apod..... udělejte fulltext nad přílohami a není se o čem bavit. Víš, Dane... je pravda, že jsme trošku unavení z té vaší permanentní odmítavosti nás slyšet. Máme zde s konstruktivními připomínkami k Aliteu brutální procento neúspěchu a už to lidi deptá, uchylujeme se k sarkazmu a škodolibosti apod....  Máte na všechno nějakou výmluvu, možná by bylo lepší, aby jste se do těch diskuzí ani nepouštěli, pokud už dopředu víte, že výsledek zaříznete třeba proto, že jen nestíháte, nebo máte prostě instrukce to co nejvíc posílat k šípku. Pamatuji si, jak když jsem před cca 14 lety nastoupil do Karatu, jak mě Allan na každé poradě drbal za to, abych neměl výmluvy proč něco nejde a místo toho hledal způsob, jak to udělat... Byla to dobrá myšlenka, kterou jsem si vzal k srdci, ale všímám si poslední dobou jak brutálně se tohle otočilo jak u Allana, tak i u vás :-( Tento případ považuji primárně za reklamaci celkem fatálního problému. Ale po tém minulém poslání k šípku s řazením pouze za komentář, což je to samé, s čím jste vypakovali i Pavla, to považuji stále za něco, kvůli čemu jsem minimálně na dobu neurčitou zlomil hůl nad tím  se o něco snažit :-( Konec diskuze.... prosím, opravte chybu."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "@ Pavel Drtil (pavel.drtil@karatsoftware.cz) - umysel bol parafraza - nieco  ako si napisal ty v komentari ##28 \"mi bylo řečeno, že si mám trhnout, že na mě nezáleží\" -   nikdy som ti nic take nepovedal, takze urazeny by som tu mohol byt ja. Pouzivas to bezne, nasim smerom ked Ti nevyhovieme a pri tom som zivote som nikomu nepovedal ze si ma trhnut alebo ze na nom nezalezi. Ty si to vysvetlil v zatvorkach za tym, ze to prehanas a ja som to dal do uvodzoviek - ale myslim ze to vsetci pochopili ako to bolo myslene - preco je z toho hadanie sa? - mozno preto , ze ked je vysledkom nesuhlas s Vasim riesenim urazite sa a je to. A ked som sa niekolko krat ponukol ze chcem pomoct inak, tak ine riesenie neberiete, tak sa mi uz nechce ked dostanem zakazdym po rypaku. - za to ze si tomu venoval cas ti patri velka vdaka - aj napriek tomu si myslim ze mat komentar na viac ako 2x A4 je blbost - opat sme pri tom, ze argument ako sa to robi teraz je pre vas nepriestrielny a zmeny nie su vitane.. pochopil som Ad radenie komentarov - no a zevraj ja to prekrucam co si povedal - fakt som povedal, ze sme to dali preto tak lebo to tak robi excel? nepovedal a neurobili sme to preto... iba som poskytol argument v podobe excelu, ktory hodnoty ktore nema k dispozicii radi nakoniec. Za mna je to takisto aj tu... Ak je hodnota null, teda ziadna, preco by som ju mal zohladnovat pri radeni - nie je to ani 1901 ani 9999. To ze si v tom nasiel logiku pre teba vhodnu je v poriadku, ale preco to prezentujes ako vseobecnu pravdu a vsetkych ktory to takto neberu vnimas ako nelogicky rozmyslajucich neviem - zasa nespokojnost s riesenim aj ked som priznal ze rozumiem tvoju problemu a chcel som ti pomoct ho vyriesit - na to si mi napisal co si napisal (mimochodom zapracujeme funkciu do pohladu \"neexistuje komentar\") - splni to ciel - jeden pohlad na nove a bez pohladu so standardnym radenim - lenze Vam uz aj jeden klik naviac vadi - opat nepacilo sa ti riesenie lebo to nebolo to tvoje - radenie za poslednu zmenu som chcel - ale bol to technicky problem, kvoli pravam na vsetky aktivity ktore vznikaju @ Lukáš Trunečka (lukas.trunecka@karatsoftware.cz) - ved som to pisal v komentari ##26 ze ano, pridat AI a vyhladavanie v prilohach by sme chceli ale neda sa to hned - neda sa to len tak spravit - potom hned za tym pride ze vyhladavanie trva prilis dlho - na druhu stranu aj to je nejaka praca s AI - nie len tam nasypat text a potom cakat - ak jej das hodnotne informacie a bez balastu bude vyhladavat lepsie, kvalitnejsie a rychlejsie - to je to stale dookola, ako som pisal aj Pavlovi, mate problem a zaroven aj riesenie - ak sa neurobi presne to co vy navrhujete je to obrovsky problem ( a je jedno co je za tym, proste sa Vam nevyhovelo a pisete take hluposti - ze nam niekto povedal nech to posielame ku dnu a podobne. Dokonca ked Vam povie ze neskor, ze je to v plane vyvoja, tak ani to neberiete - co by mala byt dobra sprava ze to spravime len neskor. Proste bud \"hned a tak ako sme povedali\" alebo nic. Jednoducho treba respektovat rozhodnutia druhej strany, tak ako ini musia respektovat tie Vase o tom co rozhodujete vy, tak by ste vy mali respektovat tie nase. Ak je to take na hrane, ze nie a nie pochopit, spravte si zoznam a potom to preberieme osobne . A vidite zasa mam tendenciu veci urovnavat, napravat, snazit sa vyjst v ustrety, aby ked sa nieco neda,. aby ste dostali relevantne informacie ale neviem ci to bude pochopene alebo si niekto len povie, kasleme my na teba, neurobil si co sme chceli. Suhlasim koniec diskusie... chybu ma na stole Dusan, snad sa mu podari najst cast kodu ktory sposobuje problem. @ Lukáš Trunečka (lukas.trunecka@karatsoftware.cz) chces to nechat otvorene?"
    },
    {
      "creator": "Lukáš Trunečka",
      "comment": "Můžeme uzavřít.... díky ;-)"
    },
    {
      "creator": "Pavel Drtil",
      "comment": "Už jsem ani odpověď neočekával a vůbec nic to nezměnilo / nepřineslo. Má smysl se o tom nějak dál bavit? Mně to nevadí, ať si to už řadí klidně dál tím nepoužitelným způsobem, který je správný. Já už jsem si přidal trigger, který mi vygeneruje privátní komentář, když je na mě případ předán a nemá komentář (možná ještě změním podmínku, že pokud komentáře neobsahují zadání). Jen až pak budeš povídat něco o znásilněném ALITEO, tak si na to vzpomeň, jak takové věci asi vznikají. Se s dovolením opět odpojím."
    }
  ]
}