{
  "id": "a05ps5hjs00q4d",
  "created": "2024-04-13T18:37:18.649Z",
  "closed": "2024-04-23T05:52:15.395Z",
  "duration_minutes": 13634,
  "first_response_minutes": 2124,
  "name": "Porady notifikace",
  "description": "Dobr칳 den, jak pros칤m funguj칤 notifikace na porady. V콢bec mi nechod칤 notifikace do mailu ve ch칤li kdy n캩kdo ud캩l치 poradu a pozve m캩 tam jako 칰캜astn칤ka. P콏ijde mi pak ve chv칤li, kdy m캩 n캩kdo nastav칤 jak oprezentuj칤. Ale absence prvn칤ho mailu mi p콏ijde divn치. d칤ky za info Michal",
  "owner": "Michal P콏ibyl",
  "priority": "Norm치ln칤",
  "surveyquality": "Unknown",
  "surveyterm": "Unknown",
  "type": "Konzultace/dat. servis",
  "area": "Bez",
  "comment_stats": {
    "total": 9,
    "from_owner": 4,
    "from_others": 5,
    "unique_authors": 1
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim Vas, rozumiem tomu spravne, ze sa pytate na to, ze preco nechodi email s upozornenim pri pozvanke do porady? Predpokladam, ze do emailu Vam pride pozvanka na udalost tak ci tak, je tak? A do ALITEO pride pozvanka na praveho panela. Dakujem za upresnenie.."
    },
    {
      "creator": "Michal P콏ibyl",
      "comment": "Ano ch치pete to spr치vn캩. ud캩lal jsem poradu TEST Ani m캩 ani kolegovy nep콏i코el email o tom, 쬰 dan치 porada je. V kalend치콏iv aliteo ho vid칤m, ale moje o캜ek치v치n칤 je, 쬰 mi to p콏ijde i do mailu. Nebo se pletu ? Ale ne치d치v mi to pak moc smysl Michal"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Ale predpokladam ze pozvanka na udalost Vam prisla - standardne ako chodi ak Vas niekto pozve na schodzku v Outlooku. Chcete mat teda 2 emaily o tom istom. Je tak? Pozn. Vam ako organizatorovi ani nema prist informacia o tom, co ste sami urobili, alebo to chapem nespravne? Ked pozvete kolegu na schodzku v Outlooku, Vam uz pozvanka nepride - vy ste organizator."
    },
    {
      "creator": "Michal P콏ibyl",
      "comment": "Dobr칳 den, J치 ud캩l치m sch콢zku v Aliteu. A moje o캜ek치v치n칤 je, 쬰: se sch콢zka objev칤 v m칠m kalend치콏i v otlocku, p콏ed UPG toto podle m캩 fungovalo. 쬰 se v코em 칰캜astn칤k콢m p콏ijde do mailu pozv치nka. Tady 쮂멳n치 nedorazila. Mail k tomu, nepot콏ebuji ( to jsem se jen 코patn캩 vyj치d콏il v p콏edchoz칤m koment치콏i.) snad u je to pochopiteln칠, ale matn캩 si vybavuji, 쬰 toto d콏칤ve fungovalo. Michal"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Uz rozumiem, je teda problem v principe so synchronizaciou. Ze urobite poradu/udalost v ALITEO a Vam sa to nesynchronizuje. Ok idem to riesit a budem Vas informovat.."
    },
    {
      "creator": "Michal P콏ibyl",
      "comment": "ano ch치pete spr치vn캩,. sorry za 코patn칠 칰vodn칤 pops치n칤游뗵 Michal"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim, deje sa Vam to opakovane? Prave som si to vyskusal a mne to ide v poriadku. Skusil som zalozit poradu projektu, prizval som ucastnikov a skusil rozne posuny a vsetko sa zda byt v poriadku. Sice zmeny, ktore urobim mimo ALITEO maju trochu delay, ale inak to funguje ok. Skuste preverit stav synchronizacie uzivatela s exchange - v nastaveniach uzivatela - ci tam nahodou nemate nejaku chybu synchronizacie. Ak je chyba tam, potom vlastne nema ALITEO spojenie s exchange, teda neexistuje organizator a to by bolo vysvetlenie."
    },
    {
      "creator": "Michal P콏ibyl",
      "comment": "D칤ky, za info. kolegov칠 to tedy prov캩콏칤 na na코i stran캩 a d치m v캩d캩t. Michal"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "No podstatne je aby organizator synchronizoval s exchange.."
    }
  ]
}