{
  "id": "a07gvtubg0089h",
  "created": "2025-06-15T21:16:57.923Z",
  "closed": "2025-06-25T15:07:52.022Z",
  "duration_minutes": 14030,
  "first_response_minutes": 661,
  "name": "dotaz opakuj칤c칤 se 코ablony",
  "description": "Dobr칳 den, chci se zeptat, k t캩m opakuj칤m 칰kol콢m ( 코ablony 칰kol콢). Ch치pu, 쬰 jsem dan칠 코ablony na코el v m칠m nastaven칤. Daj칤 se tyto 코ablony n캩jak sd칤let mezi u쬴vateli ? jako ch치pu, pro m캩, kdy si budu cht칤t vytvo콏it 칰kol opakuj칤c칤 se. Ale j치 bych cht캩l vytvo콏ti sadu opakuj칤ch se 칰kol콢, kde bych r치d, aby to bylo na firm캩. Nap콏칤klad odejdu a nerad bych, aby t칤m ty 코ablony skon캜ili. P콏ipadn캩 bych r치d, aby dan칠 ukoly n캩kdo zpravoval, a nebyly pouze u m캩. nebo jsem to 코patn캩 pochopil ? d캩kuji Michal",
  "owner": "Michal P콏ibyl",
  "priority": "Norm치ln칤",
  "surveyquality": "Unknown",
  "surveyterm": "Unknown",
  "type": "Konzultace/dat. servis",
  "area": "Bez",
  "comment_stats": {
    "total": 9,
    "from_owner": 3,
    "from_others": 6,
    "unique_authors": 2
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim, presne rozumiem o co ide, len datovo je to zatial tak, ze je to ulozene na uzivatelovi a len on ich pouziva. Mozem sa pobavit s kolegami ci sa toto planuje nejako zdielat alebo je to vyslovene vec daneho uzivatela. Vas napad mi pride logicky ale samozrejem bude to chciet analyzu kvoli pravam a podobne."
    },
    {
      "creator": "Michal P콏ibyl",
      "comment": "ok d칤ky, za info za캜nu tedy pou쮂셨at takto. Budu r치d, kdy to budoucna zv치쮂셦e 칰pravu, kdyby to nebylo jans칠 dejte mi v캩d캩t. s t캩mi opakuj칤c칤mi tickety m치m relativn캩 dost zku코enost칤 游뗵 ticket asi zav콏ete,a le dejte do backlogu na v칳voj.d칤ky Michal"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Ono je tam trochu problem s pravami a kde by to malo byt ulozene.. podla dat asi nad pracovnym priestorom.. Pobavim sa s kolegami a uvidime.."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "zaver z porady: - AKO: pracne, ale dokaze si predstavit, dava to zmysel - sablony uloh sa budu zdielat v ramci pracovneho priestoru (podobne ako pohlady, ktora potom tak ci tak budu prerabat) - @ Peter 캝ur캜치k (peter.durcak@karatsoftware.sk) zalozime do vyvoja?"
    },
    {
      "creator": "Peter 캝ur캜치k",
      "comment": "@ Daniel Dzuro (daniel.dzuro@karatsoftware.sk) kludne to zaloz do vyvoja s popisom ktory to vystihuje a hod to do 25.3. pls."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "zdravim, zhodnotili sme, ze je to dobry napad a preto zaradime do vyvoja.. Mozeme teda uzatvorit tento pripad?"
    },
    {
      "creator": "Michal P콏ibyl",
      "comment": "D칤ky za info. m치te n캩jak칳 odhad, kdy to asi bude - sta캜칤 r치mcov캩?"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "To je tazko odhadnut, ale myslim ze skor ako do pol roka to nebude.."
    },
    {
      "creator": "Michal P콏ibyl",
      "comment": "ok, d칤ky za info. Ticekt tedy zav콏ete"
    }
  ]
}