{
  "id": "a07nbmfu801iq4",
  "created": "2025-08-04T08:18:45.283Z",
  "closed": "2025-08-11T06:36:54.192Z",
  "duration_minutes": 9978,
  "first_response_minutes": 10,
  "name": "farba koment치rov v 칰loh치ch / tiketoch",
  "description": "Dobr칳 de켿,\r\n\r\nV코imol som si, 쬰 pozadie koment치rov je niekedy v 쬷tej, inokedy v bledo캜ervenej farbe. Viete mi poradi콘, 캜o ktor치 farba znamen치, kde n치jdem tieto inform치cie ?\r\n\r\nA e코te jedna inform치cia ma zauj칤ma. Na prezent치cii aplik치cie ste prezentovali V치코 agile v칳voj, ak칳m sp칪sobom zbierate user stories, pre 캞al코칤 rozvoj. (Microsoft mal kedysi uservoices, teraz m치 feedback, SAP m치 SAP Influence) m치 nie캜o aj KARAT pre product Aliteo ?\r\n\r\n캝akujem za odpovede\r\n\r\n\r\n[Image001]\r\n\r\n\r\n\r\nTom치코 Pol치k\r\nProject Leader\r\n\r\n[Image002]\r\n\r\n3EC International a.s.\r\nRu쬺v치 605/2\r\n920 42 캛erven칤k\r\nSlovensk치 republika\r\n\r\nMob.:   +421 (0)917 909 353\r\n\r\nwww.3ec.sk< >",
  "owner": null,
  "priority": "Norm치ln칤",
  "surveyquality": "Unknown",
  "surveyterm": "Unknown",
  "type": "Konzultace/dat. servis",
  "area": "Bez",
  "comment_stats": {
    "total": 10,
    "from_owner": 5,
    "from_others": 5,
    "unique_authors": 1
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim Vas, v ramci nastaveni uzivatela si dokazete farebne odlisit sukromie komentarov - . Standardne su tieto nastavenia vypnute a sukromie komentarov sa odlisuje bez tohto nastavenia minimalisticky - odtiene sedej. Ak som spravne pochopil druhu cast, tak sa zaujimate o to akym sposobom zbierame namety na ALITEO od zakaznikov? Zatial takto, vy napisete podnet, my ho zhodnotime pre produkt a ak sa nam paci, davame o tom info, davame do backlogu a nasledne sa to planuje do sprintov. Takze pravidelne prechadzame podnety a hodnotime co by davalo zmysel. Neviem ci som Vam odpovedal."
    },
    {
      "creator": null,
      "comment": "Zdrav칤m. V캞aka, na코iel som to, tro코ku mi to trvalo k칳m som sa preklikol na 칰lohy. 캛o je v코ak zvl치stne, 쬰 mi tam zobrazuje silver pre public a yellow pre internal. Nie som s칤ce 쬰na, ktor칠 rozpozn치vaj칰 1 mil farieb, ale mne to pr칤de, 쬰 pre public m치m 캜erven칰, svetlo 캜erven칰 游뗵 A druh치 캜as콘 ot치zky, v캞aka za odpove캞, budem ALITEO v r치mci 3EC pou쮂셨a콘 aby som bol pripraven칳 ak sa vedenie rozhodne znovu otvori콘 tento projekt. E코te jeden business case ma napadol. Sango (n치코 partner pre implement치ciu Karat-u), nechce aby som vytv치ral zmenov칠 po쬴adavky per tiket. Chce si to evidova콘 v koment치roch jedn칠ho tiketu, s t칳m aby som im nevytv치ral ve쬬 tiketov. Za m켿a je to zas nepraktick칠 a chcem 1 zmenov치 po쬴adavky = 1 tiket. Napadlo ma, 쬰 by som u n치s v 3EC international vytv치ral zmenov칰 po쬴adavku per tiket a potom by som tieto tikety mergoval do jedn칠ho tiketu v r치mci spolo캜nosti SANGO, viem 쬰 sa d치 tiket MOVE nu콘 cez spolo캜nosti, len neviem 캜i sa to d치 prepoji콘 aj s ALITEOM v spolo캜nosti KARAT ke캞쬰 je to napojen칠 na IS Karat."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Ad farba komentarov - jasne, mate pravdu, ze to svetlo cervene a ten preklad je nespravny - reportujem na vyvoj aby sa to opravilo Ad reportovanie - za mna je takisto spravne, co zmena to pripad - neviem si osobne predstavit ako sa sleduju komentare k jednotlivym veciam, odvedena praca, ci terminy.. nejako mi to hlava neberie a zatial si neviem predstavit argumenty, ktore by ma presvedcili. Musi to byt aj chaos pre Vas a cielom ALITEO je presny opak. Chapem teda spravne ze mate v SANGO jednu ulohu a v nej su vsetky poziadavky? Ulohy sa cez spolocnosti nedaju presuvat, naviac predpokladam ze nie ste v oboch spolocnostiach internym uzivatelom. Teda ak sa zalozi poziadavka u Vas, jedine co sa s tym da robit, je: - eskalovat ulohu (teda vytvori sa nova v inej spolocnosti a zostane prepojena z touto) - alebo (a to je asi vas pripad ak mate jednu ulohu na vsetky zmeny) sa ta uloha u Vas nastavi na stav \"caka na ulohu\" a zadate tam ulohu, ktora je zalozena v SANGO - ale toto Vam asi nepomoze, pretoze ak su sucastou jednej ulohy 4 zmeny tak kym nie su vsetky hotove tak Vam ju nauzatvoria a tym padom dostanete do tej svojej info az vtedy ked bude ta v SANGO uzatvorena.."
    },
    {
      "creator": null,
      "comment": "Zdrav칤m. Za tie farbi캜ky 캞akujem, je to dobr치 fi캜칰rka, ak sme v minulosti nad tiketom komunikovali s developermi, u코etrili sme tejto komunik치cie z치kazn칤ka K zmenov칳m po쬴adavk치m to vid칤me rovnako, p. Putyra zo Sanga to chce takto, kvoli tomu aby nemali ve쬬 tiketov. Ja to vyrie코im tak, 쬰 si ich budem separ치tne vies콘 u n치s v 3EC a budem d치va콘 linky do predmetu spolo캜n칠ho tiketu alebo do koment치rov a jeho si pozvem ako extern칠ho u쮂셨ate쬬.  Je to tiket : 319544 a spolo캜n칳 tiket pre zmenov칠 po쬴adavky 319560"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Ano, tie farby su fajn, hlavne kde je nutne to odlisovat... a takisto je tam aj to defaultne nastavenie sukromia aby sa nestalo ze nieco poslete tam kde nechcete.. (radsej neposlat a potom to zmenit ako poslat a nemalo sa to stat) 游뗵 Co sa tyka tych poziadaviek, premyslal som este nad tym, a napadlo ma ze je to pripaad od pripadu.. moze nastat situacia, ked je dovod mat vsetky zmeny v jednom pripade, ak sa tykaju nejakej spolocnej veci alebo okruhu.. u nas vo vyvoji ak riesime planovanie gantom tak riesime vsetky zmeny a opravy v jednom  poziadavku, aby sme mali prehlad.. Takze aby som bol objektivny, zalezi na pouziti.. 游뗵"
    },
    {
      "creator": null,
      "comment": "Ja som to porie코il tak, 쬰 som si u n치s vytvoril separ치tny tiket a ten kop칤rujem do koment치ra spolo캜n칠ho tiketu v Sangu. E코te ma napadlo, keby to t칠maticky s칰vis칤 tak by som to dal ako 칰lohy v r치mci tiketu."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "ok, takze vsetky otazky v tomto tickete su zodpovedane?"
    },
    {
      "creator": null,
      "comment": "jasn칠, 캞akujem za asistenciu, m칪쬰me zatvori콘. Inak je mo쬹칠 sa na tento projekt pripoji콘 aj cez web prehliada캜, tak ako sa prip치jam k ostatn칳m ? predpoklad치m, 쬰 toto je ten verejn칳 port치l (podobne ako Jira Service Desk), pre 쬿d칤 zvonku."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim, no, emailova komunikacia je verejna, dostupna na support@aliteo.com. Vsetky svoje zalozene pripad potom mozete vidiet cez portal, ked v emaile kliknete na tlacidlo \"zobrazit ulohu\" a v spodnej casti tohto portalu sa potom dokazete prekliknut na vsetky svoje poziadavky na supporte. Ak napisete email, ide to do nasej spolocnosti (neverejnej) do projektu, ktory sa venuje supportu a odkial Vam potom odpisujeme. Ak by ste teda chceli mat k dispoziici support medzi svojimi projektmi, museli by sme Vas pozvat do spolocnosti a pridat do projektu. Toto automaticky nerobime pre vsetkych uzivatelov ALITEO - znamenalo by to totiz ze kazdy uzivatel ALITEO by bol clenom nasej spolocnosti, co by bolo koniec koncov znacne zatazujuce. ALE, ak sa uzivatel  rozhodne zakupit si nejaku licenciu a komunikacia s nim je bezproblemova, potom zvazujeme jeho pozvanie do spolocnosti a projektu - aby sme ulahcili jemu i nam spolocnu komunikaciu."
    },
    {
      "creator": null,
      "comment": "Super, v캞aka za info. Mne sta캜칤 zatia t치 funkcionalita (view) v dolnej 캜asti port치lu, nako쬶o to spl켿uje moju po쬴adavku aby som si vedel pozrie콘 svoje zalo쬰n칠 tikety, a nemusel som dohlad치va콘 status konkr칠tnej 칰lohy cez e-mail칠ho klient, 캜i쬰 takto mi 칰plne sta캜칤. Ak by sme sa do bud칰cna rozhodli za캜a콘 ako spolo캜nos콘 pou쮂셨a콘 ALITEO, bolo by pre m켿a fajn ma콘 pr칤stup do projektu Support, len z toho titulu aby som si vedel vytvori콘 dashboard kde vid칤m, v코etky moje tikety naprie캜 v코etk칳mi spolo캜nos콘ami a projektami. Plus aj so Sangom by som mal r치d 2 stup켿ov칳 servis desk, 쬰 쬿dia nahl치sia tikety k n치m, na Key Userov a ak dan칰 칰lohu nebudeme vedie콘 rie코i콘, eskalujeme ju do spolo캜nosti KARAT, aby sme 코etrili zdroje na oboch stran치ch a prebiehal aj ur캜it칳 transfer vedomost칤. Tak쬰 m칪쬰me tento tiket zatvori콘, v캞aka za vysvetlenie a pekn칳 v칤kend prajem."
    }
  ]
}