{
  "id": "a074v09akg1tlh",
  "created": "2025-03-14T10:55:18.171Z",
  "closed": "2025-03-23T15:58:10.291Z",
  "duration_minutes": 13262,
  "first_response_minutes": 28,
  "name": "Dotaz - úkol #3518 - doručení email",
  "description": "Dobrý den, mohu poprosit o prověření, zda dodavatelé obdrželi z Alitea email ohledně úkolu, přenechávám včetně komunikace #3518 Poptávka - RUČKY - Taratec< https://app.aliteo.com/task/a072up38102vv5/ > S pozdravem a přáním pěkného dne Ilona Remešová Nákupní manažerka ELTON hodinářská, a.s. M: (+420) 730 855 366| E: ilona.remesova@prim.cz< mailto:ilona.remesova@prim.cz > UPOZORNĚNÍ Informace obsažené v tomto e-mailu a všech připojených souborech jsou důvěrné, mohou být chráněny zákonem a jsou určené výlučně příjemci. Nejste-li zamýšleným příjemcem, je zakázáno jakékoliv zveřejňování, zprostředkování nebo jiné použití těchto informací. Obdrželi jste e-mail neoprávněně, informujte o tom prosím odesílatele a vymažte neprodleně všechny kopie tohoto e-mailu i všech jeho příloh. From: Naveen Sent: Friday, March 14, 2025 11:25 AM To: 'Vincent Alberola' ; Remešová Ilona Subject: RE: Inquiry - HANDS - ORLÍK 38 RESPEKT LE * TARATEC Pozor! Tento e-mail přišel z externí organizace. Just received and not earlier. Naveen Senior Manager-Marketing Mobile: +91 9900051132 Whatsapp : + 91 9632390100 Address : KDDL Ltd , 296/297, 5th Main, 4th Phase. Peenya Industrial Area Bengaluru 560058 www.taratec-kddl.com< http://www.taratec-kddl.com/ > [Image002]< https://youtu.be/8YDKROo_PJI > From: Vincent Alberola mailto:vincent.alberola@kddl.com>> Sent: 14 March 2025 15:53 To: Ilona Remešová mailto:Ilona.Remesova@prim.cz>> Cc: Naveen mailto:bv.naveen@kddl.com>> Subject: Re: Inquiry - HANDS - ORLÍK 38 RESPEKT LE * TARATEC Naveen You received it? Envoyé de mon iPhone Le 14 mars 2025 à 11:20, Remešová Ilona mailto:Ilona.Remesova@prim.cz>> a écrit : ﻿ Dear Vincent, apparently, we are having some trouble receiving email notifications from our Aliteo system. Could you kindly check if you are receiving the emails or if you are able to access the tasks? #3518 Poptávka - RUČKY - Taratec< https://app.aliteo.com/task/a072up38102vv5/ > Could you kindly provide an offer for the following HANDS – PRIM ORLÍK 38 RESPEKT LE 350/533/95 // 2-49267 - HOUR HAND 351/533/95 // 2-49268 - MINUTE HAND Qty:  100 - 150 -200 pcs Please find attached drawing Thank you in advance. Best regards, Ilona Remešová Purchasing Manager ELTON hodinářská, a.s. Náchodská 2105 | 549 01 Nové Město nad Metují M: (+420) 730 855 366| E: ilona.remesova@prim.cz< mailto:ilona.remesova@prim.cz > www.prim.cz< http://www.prim.cz/ > | Facebook< https://www.facebook.com/PRIMManufacture1949/ > | Instagram< https://www.instagram.com/prim_manufacture1949 > | Twitter< https://twitter.com/PRIM_Elton > | YouTube< https://www.youtube.com/channel/UCJodOxcpTeWaR3C_u8WYyQg > WARNING The information contained in this e-mail and all attached files is confidential, it may be protected by law, and is intended solely for the recipient. If you are not the intended recipient, any disclosure, transmission, or other use of this information is prohibited. You have received an e-mail without authorization, please inform the sender and delete all copies of this e-mail and any attachments immediately. <350_533_95_EN (2).pdf> <351_533_95_EN (1).pdf>",
  "owner": "Neregistrovaný užívateľ",
  "priority": "Normální",
  "surveyquality": "Unknown",
  "surveyterm": "Unknown",
  "type": "Konzultace/dat. servis",
  "area": "Bez",
  "comment_stats": {
    "total": 6,
    "from_owner": 2,
    "from_others": 4,
    "unique_authors": 1
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim, o ktoreho uzivatela teda ide? bv.naveen@kddl.com? Dakujem"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Zistil som nasledovne: - v danej ulohe su sledovatelmi uzivatelia vincent.alberola@kddl.com a bv.naveen@kddl.com - uzivatel vincent.alberola@kddl.com ma ucet zalozeny, prijatu pozvanku a je sledujucim ulohy, co ale nema zapnute je asi podrobne upozornenie na ulohe a teda mu nepridu vsetky notifikacie iba tie zakladne. Treba skontrolovat ci ma v nastaveniach zapnute, aby sa mi na ulohe zapli podrobne notifikacie ak sa stane sledujucim: malo by to potom fungovat - je treba samozrejme odlisovat o upozornenie coho ide - pridanie komentaram zmienka, zmena atributov alebo ostatnych vlastnosti - podla toho a nastaveni mu potom budu chodit notifikacie - to ci ma zapnute podobne upozornenia vidite formou zvonceka pri jeho meno v sledujucich - uzivatel bv.naveen@kddl.com v ALITEO ani neexistujte a preto jediny email ktory mu odisiel je pozvanka"
    },
    {
      "creator": "Neregistrovaný užívateľ",
      "comment": "Vlastně všichni ve firmě Taratec - bv.naveen@kddl.com, vincent.alberola@kddl.com - ten ale koukám je nyní aktivní sales.taratec@kddl.com (v jiném úkolu) Zatím nikdo se zahraničních kontaktů nereaguje. Bude spíše problém v ignoraci doručených emailů z Alitea.  Budu muset řešit jak to vidí z jejich strany, že se tomu brání. Protože v rámci jednoho úkolu potřebujeme, aby v komunikaci bylo více externích osob z dané firmy. Možná bude pro ně ideální  zpracovat návodku s obrázky."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Rozumiem tomu spravne, ze oni ALITEO pouzivat nechcu? ak ano, preco sa potom registrovali."
    },
    {
      "creator": "Neregistrovaný užívateľ",
      "comment": "Ano jedna osoba z firmy se registrovala a nyní mi napsal, že mají zakázáno stahovat soubory z jiného programu. Opravdu budu muset zpracovat nějaký návod pro zahraniční uživatele."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "No, neviem ci som pochopil spravne, ale ak sa uzivatel neregistruje potom by mu mali chodit upozornenia standardne a ziadny problem nie je. Problem nastane ak sa registruje a potom tie nastavenia su nejake a moze sa stat ze sa nezhoduju s tym ktore ma \"neregistrovany\". Pokusime sa to otestovat. Kazdopadne, myslite ze je treba navod pre neregistrovaneho? Ktory len odpisuje na emaily?"
    }
  ]
}