{
  "id": "a0735a94m01epc",
  "created": "2025-02-28T10:51:59.800Z",
  "closed": "2025-02-28T13:35:00.837Z",
  "duration_minutes": 163,
  "first_response_minutes": 46,
  "name": "Otázka, kdo je nyní řešitel?",
  "description": "Takže před změnou byl řešitel BPA, ukazovalo se MBA (asi jsem BPA dal v jiné záložce) a nyní to ukazuje Po F5 Trošku mě to předtím vyděsilo. Luboš",
  "owner": "Lubomír Bednář",
  "priority": "Normální",
  "surveyquality": "Unknown",
  "surveyterm": "Unknown",
  "type": "Chyba",
  "area": "Bez",
  "comment_stats": {
    "total": 7,
    "from_owner": 3,
    "from_others": 4,
    "unique_authors": 1
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Ahoj, v com je prosim problem? Zmenil si riesitela z A na B a tebe sa tam zobrazovalo A+B a po refreshi to ukazuje B?"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Resp, rozumiem, ze si dokazal zachytit stav ked to bolo A+B resp dokonca B+C ale v aktivitach to nie je?"
    },
    {
      "creator": "Lubomír Bednář",
      "comment": "tak řešitel byl C, před změnou se zobrazoval A, změnil jsem na B a po změně ukazoval, že je řešitel A + B a přitom měl být jen B, tedy muselo dojít k refreshi a to na hodnotu, která nemohla být v datech"
    },
    {
      "creator": "Lubomír Bednář",
      "comment": "tady aktivity změny řešitele"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "chapem, a vies to nejako zreplikovat? snazil som sa u seba to rozne menit aj na inych zalozkach ale nepodarilo sa mi to.. vobec nerozumiem ako sa tam ten MBA dostal"
    },
    {
      "creator": "Lubomír Bednář",
      "comment": "nyní asi ne, pokud bych si všiml, kdy s to stalo klidně založím nový případ, já o tom jen chtěl informovat, jelikož mě to trošku vyděsilo, říkal jsem si, tak já jsem to na toho Broňu nepředal? pak jsem dal Přebírám si řešení (toto jsem mohl uvést už v popisu) a naráz řešitel MBA a LBE (říkám si, co to je, nově je Přebírám si řešení přidává a nenahrazuje?) a pak jsme si říkal, to asi tak nebude, to bude jen chybně zobrazeno, dle Aktivit taky že jo a tak jsem to zadal. Chápu, neví se jak nasimulovat, těžko se řeší, klidně zavřeme, já jsme informaci nyní předal :-) Luboš"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "snazil som este nieco otestovat, ale bohuzail sa mi nepodarilo nasimulovat ten stav aby tam \"bezdovodne\" boli 2 riesitelia, s tym ze v aktivitach sa jedne z nich nenachadza.. :/"
    }
  ]
}