{
  "id": "a07likut3g19n2",
  "created": "2025-07-21T11:59:04.395Z",
  "closed": "2025-07-24T07:34:02.929Z",
  "duration_minutes": 4054,
  "first_response_minutes": 1489,
  "name": "HD: zadani hodnoceni pri uzavreni ticketu",
  "description": "Dobr칳 den,\r\n\r\nPosledn칤 dobou se n치m st치v치, 쬰 u쬴vatel칠 nemohou zadat hodnoceni p콏i potvrzen칤 uzav콏en칤 ticketu. Zd치 se, 쬰 to cca odpov칤d치 dob캩 nasazen칤 nov칠 verze HD (ale mohu se m칳lit). 콯치dn치 nastaven칤 v pracovn칤m prostoru pro doty캜n칳 projekt jsem nem캩nil.\r\nZat칤m jsem na코el dva sc칠n치콏e:\r\n\r\n  1.  콎e코itel zakl치d치 ticket za u쬴vatele a po vytvo콏en칤 ticketu u쬴vatele nastav칤 jako vlastn칤ka. Kdy se ticket nastav칤 k uzav콏en칤, vlastn칤kovi nep콏ijde emailov치 notifikace, 쬰 m치 potvrdit uzav콏en칤 a z치rove켿 zadat hodnocen칤. Ticket je po 7-mi dnech uzav콏en automatem.\r\n  2.  U쬴vatel je notifikov치n emailem, 쬰 je jeho ticket ve stavu k uzav콏en칤 a pou쬴je tla캜칤tko Schv치lit z emailu pro uzav콏en칤 ticketu. Hodnocen칤 se mu nezobraz칤. Pokud vyu쬴je webov칠 rozhran칤 HD tzn. zobrazen칤 칰kolu, tak hodnotit m콢쬰.\r\n\r\nPros칤m o prov캩콏en칤 funk캜nosti pop콏. naveden칤 rukou kde a jak upravit nastaven칤. Hodnocen칤 ticket콢 vyu쮂셨치me pro dal코칤 vyhodnocov치n칤 spokojenosti u쬴vatel콢.\r\n\r\nP콏edem d칤ky,\r\n\r\nMartin P콎IKRYL\r\nIT Coordinator\r\nLesaffre 캛esko & Lesaffre Slovensko\r\n\r\nMob. +420 739403300\r\nHodolansk치 34, 779 00 Olomouc, Czechia\r\n\r\n[Image001]\r\n\r\n[Image002]< >  [Image003] < >   [Image004] < >   [Image005] < >\r\n\r\nm.prikryl@lesaffre.com< > - www.lesaffre.cz - www.lesaffre.sk< > - www.lesaffre.com\r\n\r\nZva쬾e, je-li nutn칠 tento e-mail vytisknout. - Please only print this email if it is necessary.\r\n\r\n[Image006]< >",
  "owner": null,
  "priority": "Norm치ln칤",
  "surveyquality": "Unknown",
  "surveyterm": "Unknown",
  "type": "Chyba",
  "area": "Bez",
  "comment_stats": {
    "total": 8,
    "from_owner": 2,
    "from_others": 6,
    "unique_authors": 2
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdrav칤m v치s, pred치m na v칳voj, budem v치s informova콘. Ospravedl켿ujeme sa za nepr칤jemnosti."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Poziadali ma z vyvoja: ad 1. lze z칤skat 칰kol ke kter칠mu vlastn칤kovi nep콏i코la emailov치 notifikace s po쬬davkem na schv치len칤? ad 2. lze z칤skat email ze kter칠ho p콏i schv치len칤 chyb칤 spokojenost nebo url adresu z tla캜칤tka v emailu?"
    },
    {
      "creator": null,
      "comment": "1) 2)"
    },
    {
      "creator": "Allan Kone캜n칳",
      "comment": "https://app.aliteo.com/task/a07j4agrp01mqk/?debuguseremail=m.prikryl@lesaffre.com&view=comments"
    },
    {
      "creator": "Allan Kone캜n칳",
      "comment": "ad 1. dle na코eho outboxu sendgrid email panu Podiv칤nsk칠mu jako vlastn칤kovi 칰kolu odeslal. 2.7.2025 13:44 na코eho 캜asu. V칤c nedok치쬴 zjistit ad 2. dan칳 칰kol je ji uzav콏en... nicm칠n캩 zkou코el jsem nad sv칳m 칰kolem z emailu na ostr칠 a uzav콏en칤 bylo norm치ln캩 funk캜n칤. Jen upozor켿uji, 쬰 v Aliteo obrazovce ji pak 쮂멳n치 tla캜칤tka nejsou, rovnou se 칰kol schv치l칤."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim, patrali sme a: 1. email z naseho systemu odisiel a bol doruceny (mame na to mechanizmus ktory nam dorucenie potvrdi) - teda je otazka kde realne skoncil na strane prijemcu - spam? nevieme uz povedat 2. islo o nejaku chybicku ktora nastala pri konkretnej situacii, ktora sa pred tym nediala (emailom vytvoreny pripad pre uzivatela v stave pozvanka - ak som spravne pochopil vyvojara.. 游뗵 ) - toto sme opravili, takze by sa uz chyba tohto charakteru nemala opakovat"
    },
    {
      "creator": null,
      "comment": "Dobr칳 den, OK, d캩kuji za info. Budeme to nadale sledovat a kdyby se neco dalsiho objevilo, dam vedet. V tento moment muzeme uzavrit. MP"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Dakujem velmi pekne. Samozrejme hned piste ak by sa dialo nieco podozrive. Majte pekny den."
    }
  ]
}