{
  "id": "a07qfk2egg16i3",
  "created": "2025-08-28T14:24:50.257Z",
  "closed": "2025-09-11T13:21:45.094Z",
  "duration_minutes": 20096,
  "first_response_minutes": 2647,
  "name": "modifik치cia e-mailovej adresyna vytv치ranie 칰loh",
  "description": "Pozdravujem,\r\n\r\nChcem sa sp칳ta콘, 캜i sa d치 nastavi콘 e-mailov치 adresa prostredn칤ctvom, ktorej sa bud칰 vytv치ra콘 칰lohy v projekte. Na코iel som to v nastaveniach projektu ale je tam nejak치 predvolen치. Neviem 캜i je mo쬹칠 ju niekde editova콘 alebo si treba zak칰pi콘 vy코코ie 캜lenstvo pr칤padne nastavi콘 preposielanie z firemn칠ho e-mail-u.\r\n\r\nV캞aka za odpove캞 a pekn칳 v칤kend prajem.\r\n\r\n[Image001]\r\n\r\nTom치코 Pol치k\r\nProject Leader\r\n\r\n[Image002]\r\n\r\n3EC International a.s.\r\nRu쬺v치 605/2\r\n920 42 캛erven칤k\r\nSlovensk치 republika\r\n\r\nMob.:   +421 (0)917 909 353\r\n\r\nwww.3ec.sk< >",
  "owner": "Tomas_Polak",
  "priority": "Norm치ln칤",
  "surveyquality": "Highest",
  "surveyterm": "Highest",
  "type": "Konzultace/dat. servis",
  "area": "Bez",
  "comment_stats": {
    "total": 22,
    "from_owner": 5,
    "from_others": 17,
    "unique_authors": 3
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim Vas, tato adresa je jedinecna a neda sa zmenit. Obsahuje jedinecny identifikator projektu. Standardne sa to robi tak ze sa presmeruju na tuto adresu emaily, ktore pridu na Vas domenovy email. Teda: Zakaznik -> info@3ec.sk -> projekt_aliteo@aliteo.com Musi sa nastavit spravna metoda preposielania aby sa zachoval povodny odosielatel emailu a aby sa potom komunikovalo medzi ALITEO a zakaznikom."
    },
    {
      "creator": null,
      "comment": "Pozdravujem, vid칤m, 쬰 pracujete aj cez v칤kend, postihol ma podobn칳 osud. Rozm칳코쬬m ako to nastavi콘 spr치vne. Vych치dzam z filozofie, 쬰 som ako keby firma vo firme, nesk칪r by som som aj chcel 칤s콘 na I캛O. A beriem to tak, 쬰 v r치mci firmy, na m켿a chodia najr칪znej코ie po쬴adavky (e-mailom, osobne, telefonicky, cez Aliteo, service desk extern칳ch firiem a r칪zne in칠 apky ). A r치d by som si vytvoril jedno centr치lne miesto kam mi tie v코etky 쬴adosti chodia, kde ich budem evidova콘 a rie코i콘. Aby som sa nemusel prep칤na콘 medzi Aliteo-om, e-mailom, ... No a napadlo ma 쬰 da콘 svoju firemn칰 adresu presmerova콘 na adresu projektu. To by bol projekt 3EC service desk (zatia k칳m aliteo vo firme pou쮂셨am len ja) a z neho by som si tie tikety (칰lohy ) pres칰val na konkr칠tne projekty, 캜i u veci t칳kaj칰ce sa projektu IS Karat, alebo z치kazn칤cke projekty na certifik치cie. Neviem 캜i mi rozumiete, ke캞 tak m칪쬰me da콘 call k tomu aby som V치m to vysvetlil, plus mi povedzte 캜i ste ok s t칳mto po캜tom ot치zok a dotazov ktor칠 d치vam alebo to rie코i콘 nejak칳mi poplatkami za anal칳zu. Pracoval som aj na strane dod치vate쬬 a viem 캜o je to ma콘 na linke otravn칠ho z치kazn칤ka 游, tak pokojne kri캜te, v치쬴m si Va코ich slu쬴eb ale samozrejme by som ich ner치d zneu쮂셨al a \"prepaloval\" V pr치ci mi zaplatili licenciu na rok, tak by som sa r치d za ten 캜as 캜o najlep코ie nau캜il robi콘 v ALITEO aby som to vedel prezentova콘 vo firme, pr칤padne ak opust칤m firmu, mohol to pou쮂셨a콘 u seba vo firme miesto Atlasian produktova a podporova콘 CZ produkt."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim Vas, ano, niekedy ak viem pomoct hned tak samozrejme odpisem hned ak mam chvilu - aj v case volna a vsimol som si to 游뗵 Vazim si Vasu ohladuplnost pri kladeni otazok a samozrejme radi pomozeme uzivatelom, ktori ALITEO chcu pouzivat. Naviac od takychto ludi zberame spatnu vazbu, ktora je pre nas cenna. Preto by som navrhol, aby ste si pripravili otazky, a aby sme sa pokojne spojili na 30min napriklad a presli si nad cim premyslate. Idealne by bolo aby ste vizualizovali nejakym diagramom, kde ste vy a ako ste prepojeny na ostatne firmy a nastroje, ktore pouzivate v tychto firmach. Co myslite?"
    },
    {
      "creator": null,
      "comment": "칰plne s칰hlas칤m, vytvor칤m si 칰lohu v ALITEO kde budem zhroma쮃끒va콘 svoje ot치zky a potom si m칪쬰me da콘 Teams / pr칤padne ALITEO meeting / pr칤padne tento tiket eskalujem na V치코 support projekt, aby to bolo 칰plne 캜ist칠 a v s칰lade s procesmi v ALITEO 游뗵 Tento t칳쬯e켿 dokon캜ujem manu치l na IS KARAT pre na코u z치kazn칤cku 칰pravu, tak sa s칰stred칤m na to, ale bud칰ci t칳쬯e켿 by sme to mohli napl치nova콘."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Ved kludne si to naplanujme, aspon budete mat milnik. Dalsi tyzdne Vam to kedy vyhovuje? Napriklad utorok 9.9.2025 o 10:00 ? Ak ano, potom by som tuto ulohu pozastavil dovtedy.."
    },
    {
      "creator": null,
      "comment": "Pravdu vrav칤te,  m칪쬰 by콘. Po코lete mi pozv치nku na MS Teams stretnutie na e-mail tomas.polak@3ec.sk ?  Rozm칳코쬬m, 쬰 si V치s prid치m ako externistu do m칪jho projektu a sprav칤me meeting priamo v Aliteu a vysk칰코ame si funkcionalitu porady, 캜o vy nato ?"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "츼no, pozv치nku som odoslal, prikladam link aj tu: MS Teams K쬿dne m칪쬰me na tento 칰캜el vysk칰코a콘. Prizvite ma do porady, ak ma potom pri jednotlivych bodoch date ako prezentujuceho spolu s vami, budem sa na ne moct dopredu pripravit. pozastavujem teda ulohu do d치tumu konzult치cie"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "@ tomas.polak@3ec.sk (tomas.polak@3ec.sk) ja som Vas takisto pozval do spolocnosti ALITEO a pridal do projektu Support. Napiste mi, ked tu budete a nasledne Vam rpehodim aj tickety aby ste videli tento uz v aplikacii a nemusite emailovat."
    },
    {
      "creator": null,
      "comment": "Uno perfekto, vid칤m projekt support Aliteo, tak쬰 sa m칪쬰me hra콘 priamo tam. Inak toto bude dobr칳 sp칪sob ako implementova콘 ALITEO do na코ej firmy, 쬰 ja budem ten 캜o sa im nad치va early adopters / piooneer ,  budem v tom evidova콘 v코etky po쬴adavky na m켿a, na z치kazn칤cke projekty, projekt IS Karat, zosynchronizujem Outlook calend치r, nastav칤me nejak rozumne posielanie e-mailov z outlook-u rovno do niektor칠ho projektu + budem ma콘 jeden centr치lny service desk, z ktor칠ho budem preposiela콘 (eskalova콘 / premiestnova콘 (interne) ) tikety na partnerov, 캜i u k V치m, na Karat, alebo e코te jedn칠ho dod치vate쬬 캜o m치me, t칤 pou쮂셨aj칰 toto https://www.znuny.org/en . A ke캞 to bude efekt칤vne, a 쬰 bude, vytvor칤m si discipl칤nu, budem ukazova콘 aj ostatn칳m ako sa d치 efekt칤vne riadi콘 svoj 캜as (pl치n / vykazovanie ) , 칰lohy a ka쬯칳 projekt a postupne tam za캜nem prid치va콘 ostatn칳ch kolegov, tak치 Alitero evol칰cia, miesto revol칰cie, to ide v쬯y s men코칤m ment치lnym odporom :)"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Super, tak vlastnika tejto ulohy menim z anonymneho emailu na Vas ako poznaneho uzivatela.. budete vidiet tuto ulohu uz v ALITEO No mozete aj ich motivovat k tomu aby presli zo znuny na ALITEO 游뗵 vzhladom na to, ze to riesi len ticket a ALITEO by im mohlo pomoct aj inde. Takze opat pozastavujem ulohu do 9.9.2025."
    },
    {
      "creator": "Tomas_Polak",
      "comment": "v캞aka. Mysl칤m si, 쬰 hlavn칳 faktor tam zohr치vaj칰 peniaze, ten Znuny je open source a ak som spr치vne pochopil free. Nem치m ni캜 proti open sourcom aj ja h쬬d치m alternat칤vy vo캜i Atlassian produktom, ale treba si uvedomi콘, 쬰 v코etko nie캜o stoj칤, mus칤 t칳ch v칳vojarov niekto 쬴vi콘 游뗵), tak쬰 ni캜 nie je zadarmo a ak chceme ma콘 캞al코칤 v칳voj, support, ... tak skr치tka plat칤me za pridan칰 hodnotu, ktor칰 n치m tie appky prin치코aj칰. Okey, koniec filozofovania ide sa pracova콘, vid칤me sa toho 9.9. sk칰sim tam hodi콘 nejak칠 body (vytvor칤m tiket) a vytvor칤m meeting cez Aliteo."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Pridam k tomu aj svoj poznatok, ked sme zacinali s automatizovanym testovanim tiez sme si nasli nejaky nastroj, ktory bol uplne free od tricentrisu tusim... mal komunitu, blogy atd.. Az jedneho dna sa tento pro bono projekt skoncil, cloudy sa vypli a cele nase usilie (cas aj peniaze) isli do kosa.. od tej chvile sa bojim veci ktore su zadarmo.. Tie body co chcete prebrat vytvorte ako body porady u seba.. a dajte ma za prezentujuceho, mne to pride ako upozornenie"
    },
    {
      "creator": "Tomas_Polak",
      "comment": "m치te automatick칠 testovanie ? wow, mne sa asi sn칤va. To som naposledy na projekte za쬴l v SAPe v 2010 a odvtedy u nikde, lebo 쬿dia nerozumeli pr칤nosom automatick칠ho testovania na projektoch + bolo to pre nich drah칠, ale cenu odstra켿ovania regresi칤, platy konzultantov, 쬿d칤 캜o sa natr치pili s 캞al코칤m odstra켿ovan칤m ch칳b, prestoje vo v칳robe nikto ner치tal. Hovor칤 sa, 쬰 ak je nie캜o zadarmo produktom sme my 游뗵 noooo teaz rozm칳코lam, 쬰 som to mohol rad코ej da콘 ako body = odr치쬶y v agende. Ja som to dal ako okdazy na tikety, ale t칳m p치dom si uber치m z 1000 rozpo캜tu akt칤vnych 칰loh, ale zas na druhej strane m칪쬰me rovno zapisova콘 plnenie do tiketov a sl칰쬴 to ako znalostn치 db. Sk칰ste pozrie콘, hodil som tam nalinkovan칠 tikety aj 칰vod a z치ver."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "No, snazime sa - niektore rutinne testy nam bezia kazdy den, aby sme vedeli vopred ak nieco prestane fungovat Zaroven ladime proces a postupne budem pridavat dalsie.. to je samozrejme napojene na ALITEO takze zodpovedny clovek len skontroluje rano ci zbehli vsetky testy a  ked nie, zisti kde to padlo a rovno v ALITEO posiela na vyvoj na opravu.. takze taka je vizia a postupne to pridat. Bodmi porady myslim toto: Porady mame fakt vymakane 游뗵 (cielom je nechodit s wordmi a excelmi na porady, byt na nich viopred pripraveny, odhadnut ci staci cas a samozrejem nasledne ukolovanie - teda clovek pride z porady a ma na sebe ulohy ktore plynu z porady. Zaroven na nich vidi ze ich dostal z porady)."
    },
    {
      "creator": "Tomas_Polak",
      "comment": "Je to perfektn치 vec. 칔primne ? ja si bez automatick칠ho testovania neviem predstavi콘 v칳voj software. Ke캞 som robil v SAPe Slovensko vo v칳voji, tak sme mali na kolene vyroben칳 software na step recording a vytv치ral som skripty vo Visual Basicu a ako p칤코ete, ka쬯칳 de켿 to i코lo od r치na do ve캜era a malo to za cie odha쬺va콘 regresie v in칳ch 캜astiach (moduloch) syst칠mu, ktor칠 dali developeri do produkcie. Ke캞 r치no nepri코la 쬴adna hl치코ka nebolo 캜o rie코i콘. Viem si predstavi콘 쬰 keby pri코la hl치코ka tak by to automaticky zalo쬴lo tiket v Alieto alebo inom service desku a sledovalo proces ... A teraz ke캞 som robil u partnerov SAPu, tak to bola jedna trag칠dia za druhou. Netestovalo sa, developer len tak od oka nie캜o manu치lne pretestoval, t칰 oblas콘 캜o vyvinul a potom miliarda probl칠mov, projekty sa predra쬺vali, predl쬺vali, opravovali sa chyby za chybou, 캜i쬰 preto som povedal, 쬰 obrovsk치 implement치cia bez automatick칠ho testovania, je implement치cia bezo m켿a, tak칳 adrenal칤n u nepotrebujem a nech치vam priestor mlad칳m a ambici칩znym, ja chcem robi콘 poriadnu poctiv칰 robotu 游뗵 A k bodom. U ch치pem. Teraz som sa s t칳m zahral. Ja som si vyfiltroval 칰lohy k projektu a potiahol som ich do programu sch칪dze. T칳m p치dom otvor칤me dan칳 tiket a hne캞 nap칤코eme plnenie pr칤padne zmen칤me status. Vy ste vytvorili bod programu bez naviazania na tiket. A porady resp. proces som rie코il ke캞 som bol poslanec mestsk칠ho zastupite쬽tva. Uvedomil som si 쬰 to je vlastne proces, ktor칳 za캜칤na pr칤pravou, zberom po쬴adaviek n치vrhov, 캜o poslanci / ob캜ania chc칰 prerokova콘, zamestnankyne a odbory prikladaj칰 materi치ly na rokovanie , potom je samotn칳 priebeh zastupite쬽tva, pravidl치 hlasovania, na za캜iatku sa prech치dzaj칰 uznesenia z minul칠ho zastupite쬽tva, je tam priamy prenos pre ob캜anov + d칪kazov치 nahr치vka. Po zastupite쬽tve s칰 캜asov칠 limity na vypracovanie z치pisnice a zas sa zadali nejak칠 칰lohy a plus za캜칤na znova proces pr칤pravy na 캞al코ie zastupite쬽tvo, zber podnetov, materi치lov ... Je to proste procesn칳 KRUH a to je na tom to kr치sne. A takto isto funguj칰 aj firemn칠 porady a d치 sa t칳mi,obecn칳mi / mestsk칳mi ktor칠  s칰 pr칤sne regulovan칠 z치konom, in코pirova콘."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Presne tak, body porady bez vazby na ulohu su povedzme myslienky ktore clovek ma.. a ked sa rozhodne ze sa nerealizuje, da sa tam zapis a nie je treba nic rusit. Ak sa rozhodne ze sa to realizuje, tak sa cez tlacidlo vytvara uloha z tohto bodu, dava sa to na konkretnu cloveku a dalsimi krokmi. Naviac, ak sa nieco nestihe, daju sa body porady presuvat na dalsiu, pripadne duplikovat, ak si na to chcete nechat viac casu,. odhadujete cas.. takze ak robite celodenne porady a nechcete aby tam vsetci boli cely den, tak si potom viete vygenerovat pdf program porady a ludia vedia cca kedy sa maju zastavit. Je tam aj dochadzka, takze viete kto kedy sa zucastnil. Ak niekto chyba, vie si dodatocne pozriet aktivity a skontrolovat priebeh ktory zmeskal. Ak nie je dostupny teams, ma to aj videokonferenciu (nehrame sa na Teams, ani nebudeme asi tak premakani, ale uz sa stalo kedy teams vypadol a toto nas zachranilo). Skratka je to jedna z najlepsich veci v ALITEO a su dalsie plany a vizie - hlasovanie o napadoch, AI prepisy, teraz vo vyvoji mame aj to aby sa zapis v bode porady prepisal ako forma komentara priamo do ulohy... Mimochodomm, co sa tyka AI, uz teraz testujeme beta verziu a pomaha nam to na ulohach - mame ulohu s 40 komentarmi a potrebujeme rychly brief po case - je to bomba... Takze snazime sa napredovat ako to len ide.. 游뗵"
    },
    {
      "creator": "Tomas_Polak",
      "comment": "super, znie to ve쬸i dobre, vid칤m, 쬰 m치te s poradami sk칰senosti 游뗵  A aj ten n치pad s AI sa mi p치캜i. Ke캞 som sa t칰lal po komunitn칳ch stretk치ch Atlassianu v Prahe, tak tam jeden partner prezentoval ROVO https://www.atlassian.com/software/jira/ai Je to AI v Atlassiane a presne to rob칤 tak칠 veci ako spom칤nate, tak쬰 klob칰k dole, 쬰 v칳voj u n치s ide tak칳mito svetov칳mi trendami."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim Vas, dakujem za vyzivne stretnutie, prebrali sme snad vsetky veci. Mozeme tento pripad uzatvorit?"
    },
    {
      "creator": "Tomas_Polak",
      "comment": "Aj ja 캞akujem za V치코 pr칤stup a 캜as. 츼no, takmer v코etky t칠my sme prebrali, vysvetlili, uk치zali ste mi aj in칳 poh쬬d na komplexnos콘 komunik치cie, zatia teda Aliteo budem pou쮂셨a콘 ja a dopln칤m aj kolegy켿u aby sme rozbehli ten 3 칰rov켿ov칤 helpdesk a ak sa nau캜칤me pracova콘 s IS Karat a bude v칪쬬 칤s콘 do 캞al코ej ment치lnej v칳zvy (prechod z e-mailov, papierikov a outlook 칰loh) do Aliteo tak budeme na코e rie코enie roz코irova콘, nakresl칤me si ho a budete mi robi콘 oponent칰ru 游뗵 Zatia v캞aka a v코etko dobr칠. A 치no, tiket m칪쬰m zatvori콘."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Dakujem za pozitivnu spatnu vazbu a odpoved 游뗵 Dufam ze sa Vam ALITEO bude pacit a pripadne ze bude mat otazky, nevahajte ma na supporte kontaktovat. Prajem pekny den :)"
    },
    {
      "creator": "Peter 캝ur캜치k",
      "comment": "GJ @ Daniel Dzuro (daniel.dzuro@karatsoftware.sk) 游뗵 uz som ho aj Pavlovi dal podchytit ako partnera 游뗵"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Dik @ Peter 캝ur캜치k (peter.durcak@karatsoftware.sk) spominal mi to na poslednom call ze ste mu volali, ale nezdal sa chcel uviazat alebo tak.. ale rad bude odporucat dalej.. tak uvidime."
    }
  ]
}