{
  "id": "a0796mvo8g0eot",
  "created": "2025-04-16T09:29:10.577Z",
  "closed": "2025-04-17T10:06:06.600Z",
  "duration_minutes": 1476,
  "first_response_minutes": 107,
  "name": "API version 2 nepad치 na chybu, kdy po코lu version men코칤",
  "description": "Nyn칤 jsem zkusil poslat na ALFU po쬬davek, na inicializaci datab치zi, kde jsem dal version: 0 a synchronizace m캩 ze strany AO nespadla na to, 쬰 tato verze ji nen칤 podporov치na. M치te to u zapracov치no? J치 bych pot콏eboval odchytit tu chybu, abych mohl nastavit automatickou opravu.\r\n\r\nLubo코",
  "owner": "Lubom칤r Bedn치콏",
  "priority": "Norm치ln칤",
  "surveyquality": "Highest",
  "surveyterm": "Highest",
  "type": "Chyba",
  "area": "Bez",
  "comment_stats": {
    "total": 15,
    "from_owner": 6,
    "from_others": 9,
    "unique_authors": 2
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "predam na AKO.."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "od @ Allan Kone캜n칳 (allan.konecny@karatsoftware.cz) : version 0 skute캜n캩 nepad치, pokud d치코 version 1, spadne to. 0 = neuvedeno v json jsem ponechal z d콢vodu kompatibility - nev칤m jak zajistit, aby neza캜alo padat zalo쬰n칤 칰kol콢 z IS KARAT, dokud se v코ude nedostane verze s version."
    },
    {
      "creator": "Lubom칤r Bedn치콏",
      "comment": "tak za m캩 vol치n칤 bez version = version null a n칠 0 tedy bu캞 neuvedu version a nem콢쬰 padat a nebo uvedu version a pak mus칤 podporovat min. definovanou"
    },
    {
      "creator": "Allan Kone캜n칳",
      "comment": "ne 쬰 by to bylo d콢le쬴t칠, ale m캩n칤m version na nullable int - null nekontroluji, uvedenou hodnotu kontroluji v캜etn캩 0."
    },
    {
      "creator": "Allan Kone캜n칳",
      "comment": "Dane reagoval jsem i v p콏칤padu ve v칳voji a je k patchov치n칤."
    },
    {
      "creator": "Lubom칤r Bedn치콏",
      "comment": "aha, my u orpavili, 쬰 bude m칤t verzi 1, ono moc nen칤 코ikovn칠 to 콏e코en칤 ve v칤ce p콏칤padech o kter칳ch nic nev칤m"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Lubo myslis ze mame viac pripadov na jednu vec? v tomto pripade v supporte a druhu vo vyvoji.. ono vo vyvoji nie je nic viac nez co dam sem.. ale vo vyvoji mame etapy na patchovanie, aby som vedel dat vediet na supprote ked uz je dana vec nasadena a tato este nebola.."
    },
    {
      "creator": "Lubom칤r Bedn치콏",
      "comment": "Dane, myslel jsem jen, 쬰 Allan psal, 쬰 reagoval i v p콏칤padu ve v칳voji a dal k patchov치n칤. Jinak nev칳hodu dvou p콏칤pad콢 vid칤m nap콏칤klad i v tom, 쬰 j치 nap칤코u koment치콏, 콏e코itel zde jsi ty 캜i support t칳m nebo kdo to byl a Allan m캩 na to nereagoval a kdy jsem za n칤m do코el, zda by to mohl ud캩lat (tehdy promazat eid, kdy jste naimportovali jednu 2x stejn칳 칰kol se stejn칳m eid), jeliko my stoj칤me tak byl p콏ekvapen, 쬰 jsem n캩kde j치 n캩co napsal a 콏칤kal, 쬰 on m치 na to jin칳 p콏칤pad, ale na rovinu toto j치 콏e코it nechci, to je v치코 proces, ale asi by bylo vhodn칠 pak ty koment치콏e co se d치vaj칤 v tomto prostoru (projektu) kop칤rovat i do t캩ch v칳vojov칳ch. Lubo코"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Mali sme to jeden cas tak, ze som zakladal pripad do vyvoja a teba som dal potom ako riesitela alebo vlastnika kvoli uzatvoreniu (nepamatam presne) a ked sa spravne pamatam bol tam nejaky problem. Tak som to rozdelil a drzim to takto. Takisto ak sme v jednom pripade a AKO opravi, tak tu len napise ze nema tu etapu \"patchovanie\" co je logicke kedze sme v priestore supprot nie vyvoj takze potom je tazke vediet kedy to uz je nasadene a podobne. Bohuzial nedokazem byt rychlejsi ako ty ked sa postavis zo stolicky a pojdes za Allanom. Ja som komentare a reakcie kopiroval pozri sa sam: #6639 API version 2 nepad치 na chybu, kdy po코lu version men코칤"
    },
    {
      "creator": "Lubom칤r Bedn치콏",
      "comment": "Dane, jednalo se o vyj치d콏en칤 #6531 GetChanges, stejn칠 eid a 2x z치znam? ##3 a za Allanem jsem do코el cca po 30min. zda by byl tak laskav칳 a kone캜n캩 to ud캩lal, 쬰 st치le stoj칤me, nesychronizujeme, tedy ned캩lo se co uv치d칤코 v ##9 , ale to je jedno, prost캩 takto jak to m치te a n캩kte콏칤 pracuj칤 jak pracuj칤 (nemysl칤m Tebe, m캩 je jasn칠, 쬰 nem콢쬰코 b칳t 24h a p콏ekop칤rov치vat koment치콏e), ale prost캩 tv콢rce toho programu ne캜te vyj치d콏en칤, jen kde je zm칤n캩n, pak se u nyn칤 zmi켿uj칤 v코ichni v코echny i kdy jej daj칤 jako 콏e코itele (hr콢za d캩s), ale to jsme jinde, j치 cht캩l upozornit jen na to, 쬰 v치코 proces nen칤 칰pln캩 코콘astn칳, jeliko j치 urguju, ale dokud mu to nezkop칤ruje코, tak to nem치 p콏칤jemce. Lubo코"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "aha tak to bola moja chyba, som si neuvedomil.. Neviem bohuzial ako to inak riesit, v jednem sa neda a v dvoch sa mozu stratit informacie.. No nic.. budem si davat pozor.."
    },
    {
      "creator": "Lubom칤r Bedn치콏",
      "comment": "Dane, asi si nerozum칤me. J치 p칤코u 코patn캩 proces nikoliv Tv치 chyba, p콏eci nen칤 mo쬹칠, 쬰 si nem콢쬰코 odsko캜it 콏e코it n캩co (zab콏ednout do n캩캜eho a b칳t 100x vyru코ov치n p콏ekop칤rov치v치n칤m vyj치d콏en칤), toto je neudr쬴teln칠 a v캩콏칤m, 쬰 ch치pe코 jako tv콢rce sw, 쬰 to je koncep캜n캩 코patn캩. Ano j치 bych si to um캩l vy콏e코it p콏es synchronizaci. Jinak m콢쬰me uzav콏칤t. --jinak nen칤 v SK dneska sv치tek? tedy si na druh칠 stran캩 opravdu Dan nebo n캩jak칳 stroj? :-) Lubo코"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Som zivy Dan a volno nemame :) az zajtra Chapem, no proces si navrhujem a menim ja, takze je to moja chyba 游뗵 No porozmyslam ako to spravit lepsie ale pracujem s tymto: - nechcem aby boli programatori otravovany supportom (musim si to sledovat ja - mam na to cez make aj pushky do telefonu zatial kazdu hodinu ale mozem to teoreticky skratit) - ak vyssie uvedene prezujeme tak neviem ci dosiahnem to ze ulohu prelozim na programatora a ci chcem aby si sami zakladali pripady do vyvoja - ak by to chceli uz by to robili a nepisali by mi tu ze \"nemam tu patchovat\", co je logicke lebo sme v inom procese (service desk a nie vyvoj) Jedine tak, ze komunikaciu budeme robit vzdy tu (opat musia pochopit vyvojari a to nie je vzdy zrejem ked nieco opravuju ci to je zo supportu alebo nie) a stav nasadenia a vykazovanie tam. Druha vec, nie menej podstatna je ta, ze niekedy nechcem aby sa tu Allan vyjadroval ak hrozi ze sa napise komentar ktory nechcem aby vlastnik videl. Takze tych veci je vela co treba zohladnit.. snad som ti nezabil vela casu :)"
    },
    {
      "creator": "Lubom칤r Bedn치콏",
      "comment": "##13 ano pak ch치pu. klidn캩 m콢쬰코 zav콏칤t, ju"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "FYI:맔캩n칤m version na nullable int - null nekontroluji, uvedenou hodnotu kontroluji v캜etn캩 0."
    }
  ]
}