{
  "id": "a07q27p8n00ang",
  "created": "2025-08-25T08:26:48.142Z",
  "closed": "2025-08-25T09:29:12.986Z",
  "duration_minutes": 62,
  "first_response_minutes": 51,
  "name": "rozdiel medzi riadeným projektov / úloh v app. Aliteo a IS Karat",
  "description": "Dobrý deň,\r\n\r\nVedeli by ste mi spísať aké sú rozdiely medzi riadeným projektov, úloh a porád medzi app. Aliteo a IS Karat ?\r\n\r\nVšimol som si, že IS Karat ponúka rovnako možnosť vytvárať projekty, úlohy, priraďovať ich k poradám, tak by som rád pochopil stratégiu Vašej spoločnosti, aby som vedel lepšie argumenovať pred managementom prečo ísť do app. Aliteo, prípadne zostať v IS Karat.\r\n\r\nKeď tak si k tomu zavolajme / naplánujme MS Teams video hovor\r\n\r\nS pozdravom\r\n\r\nTomáš Polák\r\nProject Leader\r\n\r\n[Image001]\r\n\r\n3EC International a.s.\r\nRužová 605/2\r\n920 42 Červeník\r\nSlovenská republika\r\n\r\nMob.:   +421 (0)917 909 353\r\n\r\nwww.3ec.sk< >",
  "owner": null,
  "priority": "Normální",
  "surveyquality": "Unknown",
  "surveyterm": "Unknown",
  "type": "Konzultace/dat. servis",
  "area": "Bez",
  "comment_stats": {
    "total": 2,
    "from_owner": 1,
    "from_others": 1,
    "unique_authors": 1
  },
  "comments": [
    {
      "creator": "Peter Ďurčák",
      "comment": "Dobrý deň, pán Polák, ďakujem za váš podnet aj telefonát, jednotlivé rozdiely medzi riadením projektov a úloh v aplikácii ALITEO vs. IS KARAT sme si spolu prešli po telefóne. Keďže ide o komplexnejšiu tému, najmä z pohľadu možností v samotnom IS KARAT, odporúčame, aby ste sa obrátili na svojho KARAT konzultanta a dohodli si ukážku možností priamo v IS KARAT. Následne si budete vedieť ešte lepšie porovnať oba prístupy a argumentačne to podporiť pred vedením. V prípade otázok k ALITEO samozrejme radi ostávame k dispozícii."
    },
    {
      "creator": null,
      "comment": "ďakujem za telefonát, podľa dohody sa spýtam nášho dodávateľa, vášho partnera, spoločnosť Sango na aplikáciu našich procesov prostredníctvom IS Karat resp. IS Aliteo pre konkrétne agendy."
    }
  ]
}