{
  "id": "a05ghnn7hg0fj3",
  "created": "2024-02-01T08:07:45.63Z",
  "closed": "2024-02-08T15:37:36.1Z",
  "duration_minutes": 10529,
  "first_response_minutes": 21,
  "name": "FW: orientační budgeting pro automatizaci převozu palet",
  "description": "Dobrý den,\r\nMám prosbu – zadal jsem kolegyni do ToDo listu jako řešitele, ale vůbec nevím, jak zajistit, aby o tom byla informována. Ona to nikde nevidí. Jak to mám správně udělat?\r\nDíky moc za informaci.\r\nJirka Dvořák\r\n\r\n\r\nFrom: Flora Tereza Sent: Thursday, February 1, 2024 9:05 AM\r\nTo: Jiří Dvořák Subject: RE: orientační budgeting pro automatizaci převozu palet\r\n\r\nAhoj Jirko,\r\n\r\nKdyž se proklikám na úkol Automatizace tak vidím, že jsem to-do, ale nemám žádnou ntifikaci o tom, že jsi mě tam přidal (ani mail, ani v Aliteu v upozornění. Za mě ideálka kdyby to šlo vidět přímo v úkolech viz níže, které mám přiřazené.\r\n\r\nTerka\r\n\r\n[Image001]\r\n\r\nFrom: Jiří Dvořák mailto:Dvorak@aconte.cz >>\r\nSent: Thursday, February 1, 2024 8:59 AM\r\nTo: Flora Tereza mailto:flora.tereza@ncline.cz >>\r\nSubject: RE: orientační budgeting pro automatizaci převozu palet\r\n\r\nTak pokud ti nic nepřišlo, tak se prosím podívej, zda vidíš tenhle úkol a nějak tě to informuje, že jsi v To Do seznamu\r\nDík moc\r\nJirka\r\n[Image002]\r\n\r\nFrom: Flora Tereza mailto:flora.tereza@ncline.cz >>\r\nSent: Tuesday, January 30, 2024 3:18 PM\r\nTo: Jiří Dvořák mailto:Dvorak@aconte.cz >>\r\nSubject: RE: orientační budgeting pro automatizaci převozu palet\r\n\r\nAhoj,\r\n\r\nJasně proberem a přidej mě do to-do. Zatím teda nic nepřišlo 😊\r\n\r\nJenom tě poprosím, abychom mohli zase s těmi vozíky něco propočítat budeme muset identifikovat i ty benefity, které nám to přinese.\r\n\r\nTerka\r\n\r\nFrom: Jiří Dvořák mailto:Dvorak@aconte.cz >>\r\nSent: Tuesday, January 30, 2024 3:09 PM\r\nTo: Flora Tereza mailto:flora.tereza@ncline.cz >>\r\nSubject: FW: orientační budgeting pro automatizaci převozu palet\r\n\r\nAhoj Terko,\r\nJeště bych se potřeboval sejít nad těmi vozíky. Můžeme to také probrat ve čtvrtek?\r\nS dovolením tě přidám do ToDo v jednom svém úkolu týkající se tady toho a zajímalo by mne, zda tě to bude nějak informovat. Dej mi když tak vědět 😊\r\nJirka\r\n\r\n\r\nFrom: Pavlíková Eva mailto:pavlikova.eva@ncline.cz >>\r\nSent: Monday, January 22, 2024 9:40 AM\r\nTo: Dvořák Jiří mailto:dvorak@ncline.cz >>; Pavlica Marek mailto:mpavlica@ncline.cz >>\r\nSubject: FW: orientační budgeting pro automatizaci převozu palet\r\n\r\nAhoj, přeposílám orientační kalkulaci od Sluno na 3x a 8x AGV\r\nE.\r\nFrom: Rak Jiří mailto:jrak@u-sluno.cz >>\r\nSent: Sunday, January 21, 2024 7:22 PM\r\nTo: Pavlíková Eva mailto:pavlikova.eva@ncline.cz >>; jerabek@ncline.cz< mailto:jerabek@ncline.cz >; 'Klega René' mailto:klega@ncline.cz >>\r\nCc: Tvardek Radim mailto:rtvardek@u-sluno.cz >>; Fáborský Petr mailto:pfaborsky@u-sluno.cz >>\r\nSubject: orientační budgeting pro automatizaci převozu palet\r\n\r\nDobrý večer Vám přeji paní Pavlíková, pane Jeřábku, pane Klego,\r\n\r\nNa základě našeho čtvrtečního meetingu posílám orientační kalkulaci, rozdělenou na pořízení a implementaci tří a osmi robotů. Omluvte prosím čas i formu, točí se nám doma chřipka a angína a mimo, kašle, teploty a bolesti hlavy, se potýkám i s únavou a bolestí kloubů.\r\n\r\nPřipomínám, že se nejedná o formální ani indikativní nabídku, ale o odhad rozpočtu pro Vaše interní potřeby výpočtu ROI. Je evidentní, že mezi jednotlivými variantami se příliš neliší náklady na licence řídícího SW, implementační náklady ani ostatní náklady jako doprava, clo apod. Zásadní dopad na rozpočet má počet potřebných robotů pro potřeby Vašeho provozu.\r\n\r\n\r\nVarianta I\r\n\r\n3 roboti + nabíječky\r\n\r\n218.000 €\r\n\r\nlicence - řídící SW\r\n\r\n43.000 €\r\n\r\nimplementace\r\n\r\n72.000 €\r\n\r\nostatní\r\n\r\n12.000 €\r\n\r\ncelkem\r\n\r\n345.000 €\r\n\r\n\r\nVarianta II\r\n\r\n8 robotů + nabíječky\r\n\r\n556.000 €\r\n\r\nlicence - řídící SW\r\n\r\n48.000 €\r\n\r\nimplementace\r\n\r\n75.000 €\r\n\r\nostatní\r\n\r\n19.000 €\r\n\r\ncelkem\r\n\r\n698.000 €\r\n\r\n\r\nBudeme-li brát do úvahy čistě mzdové náklady, pro návratnost investice ve variantě II do 5-ti let, byste potřebovali ušetřit 6-7 manipulantů. Slíbil jsem Vám návrh možných finančních benefitů, které je třeba vzít do úvahy při výpočtu ROI.\r\n\r\n1. Úspora nákladů na pracovní sílu:\r\n   - Snížení potřeby zaměstnanců pro manuální práci znamená nižší náklady na mzdy, sociální pojištění, benefity a další související náklady.\r\n\r\n2. Zvýšená produktivita:\r\n   - Automatizace může zvýšit celkovou produktivitu, což vede k vyššímu výstupu bez nutnosti zvýšení lidské pracovní síly.\r\n\r\n3. Snížení chyb a ztrát:\r\n   - Méně chyb při manipulaci s paletami znamená nižší náklady spojené s opravami, nahrazováním vadných položek a snížením odpadu.\r\n\r\n4. Nižší náklady na pracovní úrazy:\r\n   - Automatizace snižuje riziko pracovních úrazů, což vede k nižším nákladům na léčbu, odškodnění a další náklady spojené s pracovními úrazy.\r\n\r\n5. Snížení nákladů na školení a rozvoj pracovníků:\r\n   - Automatizace vyžaduje méně školení a vývoje pro pracovníky, což vede k úspoře nákladů na školení nových zaměstnanců a udržování dovedností stávajících zaměstnanců.\r\n\r\n6. Širší pracovní doba a nepřetržitý provoz:\r\n   - Automatizace umožňuje nepřetržitý provoz, což může zvýšit celkový výstup a generování příjmů.\r\n\r\n7. Zvýšená flexibilita a schopnost reagovat na poptávku:\r\n   - Moderní automatizované systémy mohou být lépe přizpůsobeny změnám ve výrobě a poptávce, což může zvýšit flexibilitu firmy a minimalizovat přebytek zásob.\r\n\r\n8. Lepší využití dostupného prostoru:\r\n   - Automatizované systémy mohou být optimalizovány pro efektivnější využití prostoru, což může snížit náklady na pronájem nebo vlastnictví prostor.\r\n\r\n9. Celková konkurenceschopnost:\r\n   - Investice do automatizace může zvýšit celkovou konkurenceschopnost firmy, což může přinést finanční výhody ve formě většího tržního podílu a lepších obchodních příležitostí.\r\n\r\n10. Zvýšený cash flow a rychlejší návratnost investice:\r\n    - Efektivnější výrobní procesy a nižší náklady mohou vést k rychlejšímu generování cash flow a rychlejší návratnosti investice.\r\n\r\nDalší možné nefinanční benefity\r\n\r\n1. Zlepšená kvalita:\r\n   - Automatizace může přinést konzistentnější a přesnější výsledky, což zlepšuje celkovou kvalitu výrobků a služeb.\r\n\r\n2. Zvýšená bezpečnost:\r\n   - Snížení potřeby manuální práce může znamenat nižší riziko pracovních úrazů, což zlepšuje bezpečnost pracovního prostředí.\r\n\r\n3. Zvýšená spolehlivost:\r\n   - Automatizované systémy mohou pracovat nepřetržitě a bez únavy, což zvyšuje spolehlivost procesů.\r\n\r\n4. Flexibilita a adaptabilita:\r\n   - Moderní automatizované systémy jsou navrženy s ohledem na flexibilitu a schopnost přizpůsobit se změnám ve výrobě a poptávce.\r\n\r\n5. Lepší využití lidských zdrojů:\r\n   - Zaměstnanci mohou být přesunuti k pracím, které vyžadují lidskou kreativitu, rozhodování a další dovednosti, což zvyšuje celkovou efektivitu a motivaci.\r\n\r\n6. Lepší dostupnost produktů:\r\n   - Automatizace může zrychlit výrobní a distribuční procesy, což umožňuje rychlejší dostupnost produktů na trhu.\r\n\r\n7. Environmentální udržitelnost:\r\n   - Efektivnější procesy mohou vést k nižšímu energetickému spotřebě a menšímu množství odpadu, což přispívá k udržitelnosti.\r\n\r\n8. Zlepšená image firmy:\r\n   - Investice do moderní technologie a automatizace může posílit image firmy jako inovativní a moderní organizace.\r\n\r\n9. Zvýšená pracovní spokojenost:\r\n   - Zaměstnanci mohou pociťovat větší spokojenost s prací, protože se vyhýbají rutinním a fyzicky náročným úkolům.\r\n\r\n10. Inovace a konkurenční výhoda:\r\n    - Automatizace může podporovat inovace v procesech a výrobě, což může posílit pozici firmy na trhu.\r\n\r\n11. Zlepšená sledovatelnost a kontrola:\r\n    - Automatizace umožňuje lepší sledování a kontrolu výrobních procesů, což vede k rychlejší identifikaci problémů a možnostem jejich řešení.\r\n\r\n12. Zvýšená schopnost dodržovat regulace:\r\n    - Moderní automatizované systémy mohou být navrženy tak, aby snáze splňovaly regulace a normy v oboru.\r\n\r\n\r\nJakmile Vám za Vašich interních rozhovorů vyplyne, že navrhované řešení vyhovuje očekáváním managementu o výši a návratnosti investice, připravíme Vám na míru podrobnou nabídku, vyplývající z Vašich potřeb a reflektující přesnější kalkulace nákladů. Stejně tak platí nabídka využití knowhow naši konzultantů, kteří Vám pomohou s přípravou projektu a vypracováním ROI pro Váš management. Může potom posloužit i jako implementační studie, která zajistí komplexní pohled na plánovanou implementaci, stanoví přesné cíle a metriky úspěchu. Poskytne analýzu nákladů a přínosů, což managementu pomůže lépe porozumět očekávané návratnosti investice a usnadní informované rozhodnutí.\r\n\r\n\r\nJiří Rak  |  Business Manager\r\n+420 771 274 635  |  jrak@sluno.cz< mailto:jrak@sluno.cz >  |  www.sluno.cz< http://www.sluno.cz/ >\r\nU & SLUNO a.s., Sadová 28, 702 00 Ostrava\r\nOdebírejte náš newsletter< https://www.u-sluno.eu/#newsletter >\r\n\r\n[Image003]",
  "owner": "Neregistrovaný užívateľ",
  "priority": "Normální",
  "surveyquality": "Highest",
  "surveyterm": "Highest",
  "type": "Konzultace/dat. servis",
  "area": "Bez",
  "comment_stats": {
    "total": 8,
    "from_owner": 3,
    "from_others": 5,
    "unique_authors": 2
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim Vas, ano, mame v plane vyvoja trochu viac rozpracovat to-do. Vnimame zatial to-do ako nejaku pomocku, nie ako plnohodnotnu ulohu, ale chapem ze ak je tam riesitel bolo by dobre o tom nejakym sposobom vediet. Na tieto ucely, ak to vyslovene delegujeme niekoho odporucame dielcie ulohy., ale rozumiem ze nie stale to moze vyhovovat. Mozete nam poslat svoj nazor k tomu ako by ste si to predstavovali. Upozornenie by asi malo byt samozrejme ale je otazka ci by sa uloha komplet mala zobrazovat uzivatelovi len preto ze je riesitelom to-do, aj ked nie je riesitelom cele ulohy. Alebo by sa mala stat automaticky aj ona riesitelom? Je tu vela otazok, ktore je treba zodpovedat."
    },
    {
      "creator": "Neregistrovaný užívateľ",
      "comment": "Dobrý den, díky za informaci a rychlou odpověď.\r\nV tom případě vidím mírnou duplicitu mezí dílčím úkolem a To Do. Oba slouží v podstatě k témuž a je potřeba je nějak výrazněji odlišit.\r\nJá bych to viděl tak, že pokud je někdo označen v ToDo, stává se automaticky aspoň Sledujícím, případně řešitelem a vidí ten úkol.\r\nPokud mu zadám dílčí úlohu, tak nechci aby mi viděl to tohoto úkolu a dávám mu plnou svobodu, ať si to řeší sám a má \"jen\" dílčí úkol. ToDo bych viděl jako rychlé rozdělení věcí mezi lidmi spolupracujícími na tom úkolu, ať je jasné, co má kdo z nich dělat.\r\nJako minimální bych ale viděl, že dotyčnému dojde aspoň info o tom, že je řešitel nějakého úkolu v ToDo.\r\nJe to tak srozumitelné?\r\nJirka Dvořák"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Presne ste to napisali: - dielcia uloha je oddelena plnohodnota uloha a ani sa neda porovnavat s todo - todo je len nejaky checklist v ramci ulohy Teda duplicita to nie je, vizualne je preto todo len nejaky jeden riadok s checkboxom Takze suhlasim: - ak sa stane riesitelom todo (nie riesitelom ulohy) tak nech pride upozornenie - a teda asi aj aby sa stal sledujucim aby vobec mal pravo na tu ulohu Vec nad ktorou sa musime zamysliet je, ci ak je niekto riesitelom to-do ci by sa nemal pridat medzi riesitelov ulohy a teda sa mu uloha bude zobrazovat medzi reakcnymi. To ale moze byt matuce, lebo on nema riesit celu ulohu iba todo. Druha vec je, ze co ak bude tych todo viac a viac riesitelov a budu na seba nadvazovat teda uloha bude svietit vsetkym na reakciu ale riesit ju nebudu moct. Podobne opacne, ak budu riestelia uloh nie len skutocni riesitelia ale aj riesitela todo a ten skutocny riesitel zoberie ulohu na poradu (alebo da vyjadrenie vlastnika) automaticky sa to odstrani z reakcnych uloch aj tych ostatnych? Tym chcem len povedat ze je mnoho prepojeni a s tym spojenych funkcionalit, ktore je pri tejto poziadavke nutne analyzovat."
    },
    {
      "creator": "Neregistrovaný užívateľ",
      "comment": "Máte pravdu, není to tak jednoduché a chápu, že tam jsou další návaznosti.\r\nCo se týče názvů, tak to máte možná mírně matoucí. Já přidávám řešitele ToDo tj, on se stává řešitelem. Mohlo by se to třeba rozdělit na přidání řešitele a přidání plánu. O plánu přijde jen info a čeká se, až ho dám mezi řešitele. Řešitel se stává automaticky i spoluřešitelem úkolu.\r\nTo si myslím, že dává smysl, ne? A tím by se i odpovědělo na problémy, co dělat s poradami atd. Protože to už si řešíte na úrovni těch řešitelů, ne?\r\nJirka Dvořák"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "@ Peter Ďurčák (peter.durcak@karatsoftware.sk) budeme nieco z toho implementovat pred tym nez sa dostane do vyvoja uloha vo vazbe? - nieco ako upozornenie a pridat do sledujucich by mohlo byt pomerne rychle, ale uz aj tak mame nahustene sprinty.. co myslis?"
    },
    {
      "creator": "Peter Ďurčák",
      "comment": "Rozobrali sme to na porade a do 14.2.2024 sa dohodneme na vysledku."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim pan Dvorak, len pre informaciu, mali sme o tejto veci viac diskusii a stale analyzujeme spravne pouzitie to-do. Urcite to prinesie nejake zmeny, ktore este kompletizujeme."
    },
    {
      "creator": "Neregistrovaný užívateľ",
      "comment": "Díky za info. Určitě jak něco vymyslíte, rád se na to podívám, případně vyzkouším funkcionalitu.\r\nJirka Dvořák"
    }
  ]
}