{
  "id": "a080sqpftg1dlq",
  "created": "2025-10-17T09:50:55.958Z",
  "closed": "2025-10-24T16:03:32.153Z",
  "duration_minutes": 10452,
  "first_response_minutes": 66,
  "name": "Pr칤stup u쮂셨ate쬬 do projektu v spolo캜nosti KARAT a 3EC",
  "description": "Pozdravujem. Potreboval by som preveri콘 a vyrie코i콘 pr칤stup u쮂셨ate쬬 zuzana.maslikova@3ec.sk v spolo캜nosti KARAT na projekte #289 3EC International a.s. . Medzi u쮂셨ate쬸i projektu ju vid칤m ale m치 status Invitation miesto External ako in칳 u쮂셨atelia, ktor칳ch m칪쬰m prida콘 medzi Followerov (treba im preposla콘 pozv치nku, resp. musia ju potvrdi콘 ? )",
  "owner": "Tomas_Polak",
  "priority": "Norm치ln칤",
  "surveyquality": "Unknown",
  "surveyterm": "Unknown",
  "type": "Konzultace/dat. servis",
  "area": "Bez",
  "comment_stats": {
    "total": 8,
    "from_owner": 3,
    "from_others": 5,
    "unique_authors": 2
  },
  "comments": [
    {
      "creator": "Tomas_Polak",
      "comment": "E코te priklad치m screen shot obrazovky p. Masl칤kovej ak si chce pozrie콘 tiket kde som ju pridal ako sledovate쬬 (firma Karat, projekt 3EC International a.s.)"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim Vas, toto nie je asi spravne miesto kde eskalovat projekt, kedze toto je cislo technicky support aplikacie ALITEO a vy popisujte problem KARAT. Ale skusim poziadat kolegu aby sa vyjadril k tomuto."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Petr, prosim Ta, ide o zakaznika asi Sango, vies sa na to pozriet, pripadne mu odpisat aby zalozit pripad na spravne miesto do spolocnosti KARAT?"
    },
    {
      "creator": "Tomas_Polak",
      "comment": "Okey, tak쬰 veci s칰visiace s aplik치ciou Aliteo vo firme  KARAT na projekte 3EC International m치m eskalova콘 priamo na ten projekt ?"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "No berte ze ALITEO je ako iny softweare, napriklad Outlook. Ak mate problem, 쬰 Vam prestava fungovat, je to vec na ticket pre Microsoft ale ak nevidite niekoho v adresari alebo miestnosti, tak je to vec nastavenia a idete za Adminom. Takze v ALITEO podobne.. ak sa Vam zda ze funkcnost nie je podla predstav tak je to na nas.. (to by bol pripad keby ste vy pozvali kolegu a on nedostal pozvanku napriklad, ze nikto iny to ovplyvnit nevie) ale ked to moze byt iba vecou nastavenia, potom treba ist za clovekom, ktory toto dokaze zmenit. A kto vie mozno sa to potom vrati aj k nam, ak zistime ze nastavene vsetko spravne a nieco nefunguje..  游뗵 snad som Vas velmi nezamotal, len som to chcel vysvetlit, ale aj tak predpokladam ze to chapete.."
    },
    {
      "creator": "Tomas_Polak",
      "comment": "nn nezamotal 칰plne jasn칠, pokia ide o aplik치ciu samotn칰 a jej technick칠 nastavenie resp. funk캜nos콘 ide to do support t칤mu produktu a pokia ide o u쮂셨ate쬽k칳 칰캜et resp. nastavenia tak za adminom resp. App. Management Team.  Tak uvid칤me, kde je probl칠m. Ja si mysl칤m, 쬰 t칳m 쬰 maj칰 status invitation tak neprijali pozv치nku a a po jej akceptovan칤 sa zmenia na internal / external. Ale to je len hypot칠za."
    },
    {
      "creator": "KSWPMS - Petr Masa콏칤k",
      "comment": "Ano, mus칤 p콏ijmout pozv치nku, nyn칤 posl치na, pokud nep콏ijde, tak URL vlo쮂셠 sem."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "tak som rad ze sme sa pochopili.. Mimochodom z technickeho pohladu, ak ma na sebe \"pozvanka\" / \"invitation\" znamena ze neprijala pozvanku, ktora jej bola odoslana na email. Ak ju nenajde (aby ju prijala) tak je treba poziadat kompetentnu osobu, ktora jej posle pozvanku znova. Kazdopadne by ale malo platit, ze by ste ju medzi sledujucich/followers mali mat moznost pridat aj v tomto stave (bez pozvania)"
    }
  ]
}