{
  "id": "a072p5kpdg1otp",
  "created": "2025-02-25T12:07:03.316Z",
  "closed": "2025-03-05T08:26:11.319Z",
  "duration_minutes": 11299,
  "first_response_minutes": 9,
  "name": "Organizace porad - z치stup",
  "description": "Dobr칳 den, mohu n캩jak za organiz치tora upravit seznam lid칤, co maj칤 pozv치nku na poradu? M치me organiz치tora mimo sign치l a pot콏eboval bych to zeditovat. V projektu jsem adminem, ale nejsem organiz치torem sch콢zky.\r\nD캩kuji\r\nJirka Dvo콏치k",
  "owner": "Ji콏칤 Dvo콏치k",
  "priority": "Norm치ln칤",
  "surveyquality": "Highest",
  "surveyterm": "Highest",
  "type": "Konzultace/dat. servis",
  "area": "Bez",
  "comment_stats": {
    "total": 8,
    "from_owner": 3,
    "from_others": 5,
    "unique_authors": 2
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim Vas, ono to vlastne to iste ako schodzka ktoru organizujete cez outlook. Ako ucastnik nie je moznost ako upravit udalost, takze to asi bohuzial nepojde."
    },
    {
      "creator": "Ji콏칤 Dvo콏치k",
      "comment": "Nevad칤, jen jsem to zkou코el. Mo쬹치 jako n치pad pro 칰pravu. Je to opakovan치 ud치lost a pot콏eboval bych v n칤 jako z치skok ud캩lat malou 칰pravu 游뗵 Hezk칳 den a t칤m p치dem to m콢쬰te uzav콏칤t."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "rozumiem teda spravne, ze by Vam nevadilo, ak by Vam do Vasej schodzky mohol akykolvek ucastnik porady vojst a Vasim menom upravit Vasu schodzku?"
    },
    {
      "creator": "Ji콏칤 Dvo콏치k",
      "comment": "sp칤코 admin, ne kdokoliv. prost캩 n캩kdo, kdo to ud캩l치 za 캜lov캩ka, kter칳 je n캩jak칳m zp콢sobem dlouhodob캩 vy콏azen. p콏칤padn캩, pokud by admin mohl p콏edat organiz치torstv칤 na n캩koho jin칠ho. takhle jsme toti v pasti a nejsme schopni v porad캩 vym캩nit 칰캜astn칤ky."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Tomu rozumiem, avsak je to standard tak ako je to v pripade akejkolvek schodzky v MS exchange - takisto nie je ziadna moznost ako nieco upravit za organizatora.. Ale porozpravame sa o tom na produktovej porade, co na to kolegovia.."
    },
    {
      "creator": "Peter 캝ur캜치k",
      "comment": "Zaver z porady: Zaplanovane."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "zdravim pan Dvorak, mali sme poradu produktu a zaplanovali sme to vyvoja dodatocne pravo, ktorym budete vediet na porade vybrat ucastnikov, ktori budu moct na zaklade tohto prava menit niektore parametre porady."
    },
    {
      "creator": "Ji콏칤 Dvo콏치k",
      "comment": "Moc d칤ky. To mi p콏ijde jako fajn v캩c. 콎ekn캩me vytvo콏it si tam z치stup. U jedn칠 porady to je asi v pohod캩, ale u s칠rie porad je to probl칠m, kdy to tam nen칤. D칤ky."
    }
  ]
}