{
  "id": "a06lkk082g1icc",
  "created": "2024-11-15T10:13:43.090Z",
  "closed": "2024-11-20T09:35:26.573Z",
  "duration_minutes": 7161,
  "first_response_minutes": 105,
  "name": "Porady",
  "description": "Dobr칳 den, m치me v코ichni probl칠m se zobrazen칤m porady. Kdy klikneme na poradu, tak m치me pr치zdno. M콢쬰te se na to pod칤vat, pros칤m? D캩kuji. Jirka Dvo콏치k",
  "owner": "Ji콏칤 Dvo콏치k",
  "priority": "Norm치ln칤",
  "surveyquality": "Unknown",
  "surveyterm": "Unknown",
  "type": "Kritick치 chyba",
  "area": null,
  "comment_stats": {
    "total": 13,
    "from_owner": 4,
    "from_others": 9,
    "unique_authors": 1
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim vas, dakujem za report a uspravedlnujem sa za neprijemnosti. Hned preposielam na vyvoj na zistenie problemu, alebo pripadnu opravu. Dakujem"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Chcem sa len spytat, ucastnik, od ktoreho ste mi poslali screeny je standardnym uzivatelom, internym clenom a ucastnikomporady? 캝akujem"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Ospravedlnujem sa, teraz som si este raz precital popis, a problemy mate vsetci a aj organizator.. ok.. beriem naspat na seba"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Predsa sa len spytam, ma problem aj sam organizator porady?"
    },
    {
      "creator": "Ji콏칤 Dvo콏치k",
      "comment": "Ano, on mne na to upozornil."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Ano, vidime uz zapisanu chybu, preposlal som vec na vyvoj.. budeme sa snazit vyriesit co najskor.."
    },
    {
      "creator": "Ji콏칤 Dvo콏치k",
      "comment": "Moc d캩kujeme 游뗵"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Ja dakujem a osppravedlnujem sa za neprijemnosti.. mrzi ma ze prave tato jedinecna funkcionalita zaskripala.."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim vas, podla vyvoja by malo byt opravene.. prosim o kontrolu a potvrdenie. Dakujem"
    },
    {
      "creator": "Ji콏칤 Dvo콏치k",
      "comment": "Dobr칳 den, j치 u to vid칤m ok, je코t캩 si to nech치m potvrdit od organiz치tora. Moc d칤ky za rychlou opravu."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "ano, prosim idealne vediet od organizatora.. az nasledne by som to uzatvoril, nech mam ciste svedomie 游뗵"
    },
    {
      "creator": "Ji콏칤 Dvo콏치k",
      "comment": "M콢쬰te m칤t 캜ist칠 sv캩dom칤, te캞 mi to potvrdil 游뗵 Hezk칳 den."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Dakujem pekne, zatvaram teda pripad. Prajem pekny den"
    }
  ]
}