{
  "id": "a05jclas100lkt",
  "created": "2024-02-23T09:48:30.105Z",
  "closed": "2024-02-24T11:36:40.066Z",
  "duration_minutes": 1548,
  "first_response_minutes": 78,
  "name": "FW: Rozsirenie licencie Karat",
  "description": "Dobry den,\r\n\r\nProsim Vas, kedze ma pani Kovacova OOO do 29/2 - vedel by nam prosim niekto pomoct s pripadmi 285490 a 285491?\r\nIde o vygenerovanie licencii k rozsireniu Karatu.\r\n\r\nDakujem\r\n\r\nS pozdravom\r\n\r\nRoman Herchel\r\nFinance Controller\r\n\r\n[Image001]\r\n\r\nKaradzicova 8\r\nBratislava 821 08 Slovakia\r\nOffice: +421 2 5788 0410\r\n\r\nFrom: Kováčová Anna - KARAT Software Sent: piatok 23. februára 2024 10:41\r\nTo: Roman Herchel Subject: Automatická odpoveď: Rozsirenie licencie Karat\r\n\r\nExternal:\r\n\r\nDobrý deň,\r\n\r\nďakujem za Vašu spravu, v čase od 22.2. do 29.2.2024 budem mimo pracovneho procesu. Počas tohto obdobia nebudem mať prístup na e-mail. Po navrate budem reagovat na Vasu spravu.\r\nServisné požiadavky prosím rieste formou ulohy v ALITEO, alebo kontaktujte linku Hotline. Ďakujem\r\nS pozdravom\r\nMgr. Anna Kováčová\r\nService & Customer Manager\r\n\r\nPrivileged/Confidential Information may be contained in this message. If you are \r\nnot the addressee indicated in this message (or responsible for delivery of the \r\nmessage to such person), you may not copy or deliver this message to anyone. In \r\nsuch case, you should destroy this message and kindly notify the sender by reply \r\nemail. Please advise immediately if you or your employer does not consent to email \r\nfor messages of this kind. Opinions, conclusions and other information in this \r\nmessage that do not relate to the official business of Group M Worldwide LLC and/or \r\nother members of the GroupM group of companies shall be understood as neither given \r\nnor endorsed by it. GroupM is the global media investment management arm of WPP.\r\nFor more information on our business ethical standards and Corporate Responsibility \r\npolicies please refer to WPP's website at http://www.wpp.com/WPP/About/",
  "owner": "Neregistrovaný užívateľ",
  "priority": "Normální",
  "surveyquality": "Unknown",
  "surveyterm": "Unknown",
  "type": "Konzultace/dat. servis",
  "area": "ISK",
  "comment_stats": {
    "total": 3,
    "from_owner": 0,
    "from_others": 3,
    "unique_authors": 2
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Ahoj Lubo, prosim Ta, nemam problem im odpisat, ze nech to nezakladaju v ALITEO ale do KARAT, len sa obavam, ze tam nepadne na nikoho alebo na Anku, ktora ma dovolenku. Ako to vyriesime prosim? Dakujem"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Ak si pamatam spravne tak pravidlo ktore nastavuje riesitela sa rovna atributu projektu. Ak to bude Anka, tak sa splni co pisem a ostane to visiet."
    },
    {
      "creator": "Lubomír Bednář",
      "comment": "Dobrý den, úkoly jsem předal na pana Hermana, který je uvedený jako zástup za paní Kováčovou. Urgence prosím případně provádějte v uvedených úkolech. Osoby co řeší obecně ALITEO na dané případy nemají oprávnění. S pozdravem Lubomír Bednář"
    }
  ]
}