{
  "id": "a05k5u30n007n3",
  "created": "2024-02-29T13:02:15.501Z",
  "closed": "2024-03-01T22:22:26.247Z",
  "duration_minutes": 2000,
  "first_response_minutes": 1618,
  "name": "FW: Aliteo - opakovatelnost a upozorn캩n칤",
  "description": "Dobr칳 den,\r\nZa캜칤naj칤 se n치m mno쬴t dotazy, tak se omlouv치m, 쬰 p칤코u tak 캜asto.\r\nPrvn칤, co jsme 콏e코ili - je 칰kol, kter칳 pova쬿jeme pro te캞 za vy콏e코en칳, tak쬰 bychom ho r치di ukon캜ili ale z치rove켿 t콏eba za m캩s칤c bychom se na n캩j znovu pod칤vali, co se stalo. Lze to n캩jak za콏칤dit?\r\nV podstat캩 z podobn칠ho soudku je dotaz kolegy n칤쬰. M치m opakovan칳 칰kol. Je to tam n캩jak 콏e코en칠?\r\nMoc d캩kuji za odpov캩캞.\r\nJirka Dvo콏치k\r\n\r\n\r\nFrom: Dan캩캜ek Radim Sent: Thursday, February 29, 2024 12:30 PM\r\nTo: Ji콏칤 Dvo콏치k Subject: Aliteo - opakovatelnost a upozorn캩n칤\r\n\r\nAhoj Jirko,\r\n\r\nPot콏ebovali bychom v Aliteu, jak nastav칤m notifikaci na po쬬davek a jeho opakovatelnost.\r\nP콏칤klad, m치m zalo쬰n칳 칰kol a chci aby ka쬯칳 p치tek p콏i코la ve 14:00 notifikace, nap콏. mailem.\r\nPop콏. jak칠 jsou mo쬹osti celkov캩 na upozorn캩칤.\r\n\r\nS pozdravem,\r\n\r\nIng. Radim Dan캩캜ek, MBA\r\nVedouc칤 ICT\r\n[Image001]\r\nNC Line a.s.\r\n742 01 Suchdol nad Odrou 233\r\nMobil:  + 420 737 279 699\r\nE-mail:  rdanecek@ncline.cz< mailto:rdanecek@ncline.cz >\r\nInternet: www.ncline.cz< http://www.ncline.cz/ >",
  "owner": "Neregistrovan칳 u쮂셨ate",
  "priority": "Norm치ln칤",
  "surveyquality": "Highest",
  "surveyterm": "Highest",
  "type": "Konzultace/dat. servis",
  "area": "Bez",
  "comment_stats": {
    "total": 3,
    "from_owner": 1,
    "from_others": 2,
    "unique_authors": 1
  },
  "comments": [
    {
      "creator": "Peter 캝ur캜치k",
      "comment": "Zdrav칤m v치s, p치n Dvo콏치k, je to v poriadku, sme tu pre v치s. Podstatn칠 je, aby v치m syst칠m sl칰쬴l, teda sme pripraven칤 si k쬿dne aj zavola콘, ke캞 to bude potrebn칠, a vysvetli콘 veci aj osobnej코ie. Sta캜칤, ak d치te info, kedy, a m칪쬰me.ㅁk prejdem k va코ej ot치zke: 1.) Ak je potreba 칰lohu \"odlo쬴콘\", ale chceme sa k nej vraca콘, mo쬹o by v치m posl칰쬴la funkcia pozastavenia 칰lohy, ktor치 칰lohu o nejak칳 캜as automaticky vr치ti rie코ite쬺vi pod쬬 캜asu, do kedy bude odlo쬰n치. - Druhou variantou je pou쬴콘 코t칤tok na 칰lohe, na z치klade ktor칠ho si dan칰 칰lohu n치sledne vyfiltrujete. - 캝al코ou mo쬹os콘ou je vytvori콘 코peci치lnu Custom Etapu s rie코ite쬽kou skupinou, ktor치 je pr치zdna, a dan치 칰loha by nikomu nezavadzala, a vy by ste sa tak k nej mohli kedyko쭀ek vr치ti콘. - S칰 aj 캞al코ie mo쬹osti, k쬿dne si m칪쬰me zavola콘 a uk치za콘 v치m, ako to je mo쬹칠 nastavi콘. 2.) Opakovan치 칰loha ako funkcionalita je vo v칳voji, kedy sa v치m v쬯y v ur캜itom 캜ase vytvor칤 dan치 칰loha. (napr. potreba faktur치cie) Tu v코ak ch치pem, 쬰 sa sk칪r jedn치 o notifik치ciu, aj to m치me vo v칳voji, a ver칤m, 쬰 do leta by t치to funkcionalita upozornenia na 칰lohu mohla by콘 k dispoz칤cii. Ak by som na nie캜o zabudol, alebo by bolo 캜oko쭀ek nejasn칠, nev치hajte n치s kontaktova콘."
    },
    {
      "creator": "Neregistrovan칳 u쮂셨ate",
      "comment": "Dobr칳 den,\r\nMoc d칤ky za rychlou odpov캩캞. Popravd캩 jsem s t칤m asi komfortn칤. To pozastaven칤 mi p콏ijde p콏esn캩 to, co jsem pot콏eboval.\r\nPar치da, u m치m p치r t캩ch funkcionalit sl칤ben칳ch, tak se t캩코칤m, a je nasad칤te. Ale ch치pu, 쬰 dal코칤 v캩ci maj칤 p콏ednost 游땕\r\nM콢쬰te to uzav콏칤t.\r\nD캩kuji\r\nJirka Dvo콏치k"
    },
    {
      "creator": "Peter 캝ur캜치k",
      "comment": "D칤k, pekn칳 ve캜er prajem."
    }
  ]
}