{
  "id": "a06mebijig1h42",
  "created": "2024-11-21T16:09:20.377Z",
  "closed": "2024-11-29T10:42:09.131Z",
  "duration_minutes": 11192,
  "first_response_minutes": 141,
  "name": "chyba registrace AO u쬴vatele",
  "description": "Ahoj,\r\n\r\npot콏eboval bych do콏e코it registraci AO u쬴vatele viz ID #303907 https://app.aliteo.com/task/a06kc47a701953/?view=comments Nev칤m, na koho p콏edat.\r\n\r\nU쬴vatel Milu코e 맚캩tinov치 pod RABBIT Trhov칳 맚캩p치nov a.s. = byla zneaktivn캩na po p콏evodu z p콢vodn칤ho KA do AO s e-mailem miluse.stetinova@rabbit.cz< mailto:miluse.stetinova@rabbit.cz >\r\nN치sledn캩 zaktivn캩na a p콏es zaslanou pozv치nku se registrovala pod e-mailem miluse.stetinova@rabbitchotysany.cz< mailto:miluse.stetinova@rabbitchotysany.cz >\r\nU osoby v CRM ji st치le vid칤m ve stavu Pozv치nka, p콏i v칳b캩ru v AO je tak칠 zobrazena ve stavu pozv치nka, nefunguje zad치n칤 p콏칤padu z IS KARAT, n캩kde se to nepotk치v치.\r\n\r\nD칤ky.\r\n\r\nJe코t캩 popros칤m zkontrolovat u쬴vatele MEDICA FILTER spol. s r. o. - Miroslava Hor치캜kov치 mhorackova@medicafilter.cz< mailto:mhorackova@medicafilter.cz >\r\nTo je n캩jak칳 칰pln칳 paskvil. 콎e코ili jsme u v ID #297558 https://app.aliteo.com/task/a065tq2kng1u9d/?view=comments Ale z콢stalo to nedo콏e코en칠. Pan칤 Hor치캜kov치 se do AO hl치sila pod 칰캜tem pan칤 Pol칤vkov칠, kter치 v MEDICA FILTER skon캜ila.\r\nN치sledn캩 jsme pan칤 Hor치캜kov칠 zas칤lali pozv치nku, aby si vytvo콏ila vlastn칤 칰캜et, ale n캩jak se to nepotkalo, v CRM je st치le ve stavu pozv치nka, v AO ji nedok치쬿 v콢bec vybrat, ale vypad치 to, 쬰 zad치n칤 p콏칤padu z IS KARAT pro코lo viz ID v칳코e.\r\n\r\nD칤ky\r\nRadek",
  "owner": "Radek Zatloukal",
  "priority": "Nejvy코코칤",
  "surveyquality": "Unknown",
  "surveyterm": "Unknown",
  "type": "Konzultace/dat. servis",
  "area": "Bez",
  "comment_stats": {
    "total": 4,
    "from_owner": 1,
    "from_others": 3,
    "unique_authors": 1
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Ahoj Radek, ani do jedneho pripadu nemam pravo pozerat, takze som sa tam nedostal, ale: ad Miluse Stetitnova - v spolocnosti KARAT ma prioritny email miluse.stetinova@rabbit.cz a preto je pozvanka chodi stale na tento email. ad Miroslava Horackova - tento ucet existuje a a je pozvana do spolocnosti a pozvanku neprijala. Ale pri zalozeni pripadu sa tento uzivatel identifikuje, preto to slo. Ako myslis ze ju nedokazes vybrat? Resp kde?"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "odpoved od @ radek.zatloukal@karatsoftware.cz (radek.zatloukal@karatsoftware.cz) : ad Miluse Stetitnova - v CRM jsem e-mail opravil, ale pozv치nku ne콏e코칤m, ona evidentn캩 registrovan치 je, dle zaslan칠ho obr치zku (d치v치m i do p콏칤lohy)  v ID #303907, p콏idal jsem na 칰kol pr치va, tak vyzkou코ej, jestli uvid칤코. Ale zobrazuje se st치le ve stavu pozv치nka (v AO i IS KARAT) a nem콢쬰 zadat p콏칤pad z IS KARAT = skon캜칤 chybou. 콎e코칤 to za ni spr치vce IT, co tak칠 asi nen칤 칰pln캩 ide치ln칤. 콎e코il jsem to s n칤m v tom v칳코e uveden칠m ID. Ale za m캩 tam n캩kde koliduje n캩jak칳 historick칳 u쬴vatel miluse.stetinova@rabbit.cz< mailto:miluse.stetinova@rabbit.cz > vs nov캩 zalo쬰n칳 miluse.stetinova@rabbitchotysany.cz< mailto:miluse.stetinova@rabbitchotysany.cz > a proto se to nepotk치v치, tak쬰 je n캩jak propojit pod ten nov칳 login ? nev칤m. ad Miroslava Horackova - v ID #297558 je k tomu n캩jak치 komunikace, op캩t jsem p콏idal pr치va. Nem콢쬿 vybrat = moje chyba. Myslel jsem vybrat v AO jako vlastn칤ka nebo sleduj칤c칤ho p콏칤padu. Ale zkou코el jsem znovu a lze ji vybrat, jen se nezobrazuje v horn칤 캜치sti spole캜n캩 s ostatn칤mi 칰캜astn칤ky projektu, ale a mezi lidmi z IS KARAT, kdy zaroluji n칤쬰. Jinak v AO i IS KARAT ji op캩t vid칤m ve stavu pozv치nka. Ale jak to, 쬰 jde vybrat jako sleduj칤c칤, kdy tedy nikdy nep콏ijala pozv치nku ? Nebo m콢쬰 zalo쬴t p콏칤pad z IS KARAT a u쬴vatel se identifikuje, kdy t콏eba v칳코e uveden치 miluse.stetinova p콏칤pad z IS KARAT nezalo쮂, alespo켿 dle toho, co mi p칤코e jejich spr치vce. Ona 칰dajn캩 n캩jakou dobu pou쮂셨ala 칰캜et Lucie Pol칤vkov칠, kter치 ve spole캜nosti ji nepracuje, tak jestli si t콏eba syst칠m nepamatuje tuhle u쬴vatelku a jako Miroslava Hor치캜kov치 registraci nedokon캜ila, proto je st치le ve stavu pozv치nka ? Prost캩 n캩jak칳 paskvil. Ale zase jen va콏칤m z vody 游땕 D칤ky, Radek"
    },
    {
      "creator": "Radek Zatloukal",
      "comment": "aliteo.jpg vizMiluse Stetitnova"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "ad Miluse - skus to u LBE, pretoze v ALITEO v nastaveniach spolocnosti KARAT ma stale email miluse.stetinova@rabbit.cz . Malo by sa jej to zmenit na miluse.stetinova@rabbitchotysany.cz a nasledne poslat pozvanku, ktoru by mala prijat a prihlasit sa pod tymto emailom. Potom bude sucastou spolocnosti KARAT a nemal by byt problem zalozit novy pripad. Co sa tyka fotky - ten KARAT co tam vidis nie je nas KARAT, podla mna si pridala sama spolocnost. To nie je original KARAT, kde bola pozvana. Mozno si mysli ze pridat sa do spolocnosti staci, ak si pridas novu spolocnost v hornom menu ale to tak nefunguje, tym si len vytvoris novu, svoju vlastnu. ad Horackova - ano to je v poriadku, ona je pozvana do spolocnosti na spravny email a ked uz v spolocnosti je, tak s nou mozes pracovat aj ked pozvanku neprijala este. Je to prave preto, aby si ty nemusel cakat na kedy sa registruje a mohol s nou ako uzivatelom pracovat vopred."
    }
  ]
}