{
  "id": "a07t4no8l0003t",
  "created": "2025-09-18T06:14:42.346Z",
  "closed": "2025-09-29T06:31:41.162Z",
  "duration_minutes": 15856,
  "first_response_minutes": 37,
  "name": "pl치novanie opakuj칰cej sa 칰lohy",
  "description": "Potreboval by som poradi콘 ako m치m v ALITEO napl치nova콘 opakuj칰cu sa 칰lohu. Ka쬯칠 r치no si rob칤m Scrum a potreboval by som to nahodi콘 do pl치novania (kalend치ra) napr. od 8 do 8:30 ka쬯칳 de켿. V캞aka za radu",
  "owner": "Tomas_Polak",
  "priority": "Norm치ln칤",
  "surveyquality": "Unknown",
  "surveyterm": "Unknown",
  "type": "Konzultace/dat. servis",
  "area": "Bez",
  "comment_stats": {
    "total": 7,
    "from_owner": 3,
    "from_others": 4,
    "unique_authors": 1
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim Vas, Popisem Vam ako funguje sablona ulohy. Ak mam vytvorenu sablonu a zapnem opakovanie, to znamena ze sa mi v dany den (nie je tam mozne urcit hodinu) vzdy vygeneruje konkretna uloha. Toto ale nerezervuje termin do kalendara, je to len opakovane vytvorenie novej ulohy. Ak sa pozriem na to co potrebujete, tak jedina asi cesta (ak to chcete mat v kalendari ) je vytvorit opakovanu udalost a do jej tela vlozit odkaz na ulohu, ktorou tu danu cinnost obsluzite. Ak Vam toto riesenie z nejakeho dovodu nevyhovuje, skuste napisat preco alebo ako by ste si to predstavovali."
    },
    {
      "creator": "Tomas_Polak",
      "comment": "Zdrav칤m, no chcel som si napl치nova콘 cel칳 t칳쬯e켿, kde ka쬯칳 de켿 r치no od 8 do 8:30 m치m SCRUM o 16:15 - 16:20 캜istenie k치vovaru od 13:00 - 13:30 obed a chcel som si preto napl치nova콘 pravidelne sa opakuj칰cu 칰lohu v ALITEO.  Cez Udalos콘 to ide, to som aj v minulosti sk칰코al s t칳m rann칳m scrumom ale pr칤de mi to tro코ku 코kr치banie za ucho.  Nikto to nepotreboval doteraz ?"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Zatial to nikto nepotreboval uprimne 游뗵 Sablony sa aj tak najcastejsie pouzivaju primarne na to aby sa vyplnili data nez aby sa automaticky planovali do kalendara. Napriklad pri pravidelnych reviziach - aby sa im skratka ta uloha vytvorila, aby ju mali medzi reakcnymi, aby na to nezabudli ale nechceli fixovat cast - na to budeme musiet mysliet. Ono ked sa nad tym tak zamyslam tak je to komplikovanejsie, lebo uloha sa generuje v dany den 00:00. Vy ale chcete aby ste mali vopred v kalendari miesto ale uloha este nebola vygenerovana? Asi rozumiete kam mierim.. kedy ma byt k danemu terminu uloha k dispozii? kedy sa ma generovat?? alebo ma byt nagenerovana dopradu, aby ked chcete hodku pred tym urobit nieco vopred tak aby ste to mali k dispozicii?? Ak dopredu tak kolko? treba pocitat s tym ze tie ulohy budu vo Vasich reakcnych ulohach. Co myslite?"
    },
    {
      "creator": "Tomas_Polak",
      "comment": "칔primne u sa str치cam tro코ku v tom 캜o p칤코ete 游뗵 , ak budete ma콘 z치ujam m칪쬰me da콘 zas nejak칳 teams / aliteo call. Neviem ako technicky vznik치 vytv치ranie 칰loh v Aliteou ale rozm칳코lam nad t칳m, 쬰 napr. ten SCRUM je vlastne jedna 칰loha, kde ka쬯칳 de켿 o tom istom 캜ase prich치dza k jej plneniu resp. aktualiz치cii do koment치ra a trackovaniu 캜asu, ktor칰 som nad 켿ou str치vil. Tak쬰 d치va zmysel 캜o hovor칤te, 쬰 je lep코ie si napl치nova콘 opakuj칰cu sa udalos콘 (rovnako ako to m치m aj v outlooku-u, vol치 sa to appointment nie task) a v r치mci tej udalosti, aktualizujem plneni tejto 칰lohy do koment치ra a z치rove켿 trackujem 캜as na tejto 칰lohe. Ak by som to mal separ치tne tak jednak vytv치ram n치sobne viac 칰loh (berie mi to kapacitu z licencie) ale z치rove켿 sa str치ca nadv칛znos콘 na jednu konkr칠tnu 칰lohu, ch칳baj칰 tam koment치re / plnenie... Tak쬰 to rie코enie 쬰 ma콘 task a vytvori콘 si opakuj칰cu udalos콘 je relevantn칠 rie코enie a systematickej코ie. sk칰sim e코te pozrie콘 ako to rie코ia v Atlassiane (JIRA, Trello), lebo som sa nad t칳m 칰primne nikdy nezam칳코lal a minim치lne sa nie캜o nau캜칤me :)"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Vidite, tak nestratili ste sa 游뗵 pochopili ste presne moj point - ze sice to s udalostou vyzera ako nejaky workaround ale akonahle sa nejaka vec tyka kalendara, tak su to uz udalosti, alebo opakujuce sa udalosti.. nezavisle ma tom ako to vyzera. Ak by sme to aj inak urobili, tak vysledok by bol rovnaky.. udalosti v ktorych bude odkaz na ulohu.. lebo to chcete - rezervaciu v kalendari a zaroven rychlo sa dostat na ulohu ktora tej rezervacie tyka. Ak by to ine SW mali inak, kludne nam dajte vediet a mozme zvazit."
    },
    {
      "creator": "Tomas_Polak",
      "comment": "tak tak pochopili sme sa nakoniec a som r치d, 쬰 som k tomu pri코iel takto s치m resp. s Va코ou n치povedou 游뗵  Cez v칤kend sa sna쮂셠 po캜칤ta캜 nezap칤na콘 v칪bec, ale sk칰sim pozrie콘 ako to m치 rie코en칠 alassian."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "skuste no, za mna maximalne len to UI, ze by to vyzeralo ako na nejaka extra feature na ulohe - zaplanuj si.. ono to tam mame na zalozke kalendar, ale neumoznujeme opakujucu sa udalost.."
    }
  ]
}