{
  "id": "a07rbegfa00rli",
  "created": "2025-09-04T08:30:47.881Z",
  "closed": "2025-09-05T07:21:56.946Z",
  "duration_minutes": 1371,
  "first_response_minutes": 64,
  "name": "Eskal치cia tiketu na spolo캜nos콘 KARAT",
  "description": "Dobr칳 de켿, dnes som v r치mci spolo캜nosti 3EC International a.s. , projektu #7 IS Karat chcel eskalova콘 칰lohu #66 Update Lists of competences do spolo캜nosti KARAT, projektu #289 3EC International a.s. . Syst칠m mi, ale vyhodil t칰to hl치코ku : Preto som vytvoril t칰to 칰lohu a eskalujem k V치m do spolo캜nosti ALITEO do projektu #1 Support ALITEO aby som otestoval funkcionalitu eskal치cie a z치rove켿 V치s po쬴adal o pomoc ako nastavi콘 proces eskal치cie z na코ej spolo캜nosti 3EC International a.s. na spolo캜nos콘 KARAT aby sme fungovali ako L1 support, Sango L2 support a Karat L3",
  "owner": "Tomas_Polak",
  "priority": "Norm치ln칤",
  "surveyquality": "Highest",
  "surveyterm": "Highest",
  "type": "Konzultace/dat. servis",
  "area": "Bez",
  "comment_stats": {
    "total": 12,
    "from_owner": 4,
    "from_others": 8,
    "unique_authors": 2
  },
  "comments": [
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim Vas, podla hlasky ktoru Vam to vypisalo je problem ten ze nemate pravo zakladat ulohu do projektu a sekcie ktora je tam uvedena. Ide Vam to zalozit priamo? Pytam sa preto aby som pochopil, ci je problem v eskalacii alebo je to v poriadku, len skratka nemate pravo a preto Vas to nepusti."
    },
    {
      "creator": "Tomas_Polak",
      "comment": "napriamo m치m mo쬹os콘 zaklada콘, 캜i u cez Karat Assistance alebo priamo z webu."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Tam ale predpokladam ze si nemozete vybrat sekciu ale zakladate bez sekcie. Je tak?"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Predpokladam zle, mate na vyber ale iba jedna je z toho ta kde mozete. Poslal som an vyvoj aby to bolo opravene. Bude sa odstrania vsetky (aby to sedelo s tym ako ked zakladate ulohu rucne) alebo sa odoberie ta kde mate pravo. Kazdopadne by mala eskalacia fungovat v pripade ze vyberiete inu nez tu ktoru ste vybrali pred tym."
    },
    {
      "creator": "Tomas_Polak",
      "comment": "츼no, potvrdzujem, vybral som si t칰 druh칰 sekciu a u to fungovalo. Ide치lne asi aby to bolo bez sekcie resp. predvolen치 bude len jedna."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Uz je to nahlasene, vyriesime to tak aby nebol zmatok, na pozadi je nastavenie este dalsich prav ktore je treba zohladnovat, takze to zanalyzujeme a opravime. mozeme teda tento ticket uzatvorit?"
    },
    {
      "creator": "Tomas_Polak",
      "comment": "okey, robte tak aby dobre bolo 游뗵. E코te jednu ot치zku. 콯e ke캞 som eskaloval tiket, a p. Putyra zo Sanga mi na켿 v spolo캜nosti KARAT odpovedal, pre캜o nevid칤m ten koment치r zrkadlovo aj u seba v spolo캜nosti 3EC International ? Pr칤de tam po 캜ase, alebo je to opr치vnenaniami 쬰 som v KARAT ako externista a on dal asi intern칳 koment치r ? Viete sa pozrie콘 e코te na to ? Ide mi o to aby som mal na코e tikety (chyby alebo po쬬davky ) zalo쬰n칠 u n치s a v코etky inform치cie zost치vali u n치s a zrkadlil sa s partnermi, 캜i u s Vami s Aliteom, Sangom, Karatom, pr칤padnne in칳mi extern칳mi partnermi."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "Zdravim, mozete si pozriet popis eskalacie tu: https://help.aliteo.com/sk/podrobne-upozornenia-a-dalsie-moznosti-3/ Ale v skratke, eskalacia neznamena ze sa veci zrkadlia - znamena to kopiu ulohy z jednej spolocnosti a nastavenie nejakeho vztahu (ale data sa nekopiruju simultanne) Use case: - pani (napriklad uctovnicka) v spolocnosti 3EC napise nejake problem, ktory padne na vas a pisete si vzajomne k tomu komentare - ale len vy ste uzivatelom aj v spolocnosti KARAT (ta pani od Vas nie) - pri eskalacii ale musite povedat co sa ma stat s datami od Vas (nemoze v KARAT vzniknut komentar od panoi od Vas ktora nie je uzivatelom spolocnosti KARAT) - vytvori sa kopia do KARAT a vy, ktory ste ju urobili ste stycnym odstojnikom medzi obidvomi ulohami (v 3EC ste riesitelom a vlatnikom je pani, a v KARAT ste vlasnikom vy a riesitelom niekto s KARAT) - medzi ulohami je vazba a zaroven povodna uloha caka na uzatvorenie tej eskalovanej - ak si potom dopisujete s programatorom v KARAT asi nechcete otravovat komentarmi pani od Vas (naviac by to bolo matuce kde mu mate odpisovat - programator z KARAT takisto nie je uzivatelom v spolocnosti 3EC) - vec vyriesite v KARAT, ulohu uzatvorite a uloha 3EC sa aktivuje, lebo uz moze (doteraz cakala) - nasledne v svojej ulohe napiste pani, ze vec bola opravena, pokojne si tam date nejake svoje zrhnutie - a tym je vec vyriesena Snad som to napisal zrozumitelne, ale kludne to mozte dat ako bod porady na spolocny call a tam Vam to vysvetlim este raz aj s nakresom ak treba."
    },
    {
      "creator": "Tomas_Polak",
      "comment": "Prizn치vam, nie je to jednoduch칠 zosynchronizova콘, ale V치코 poh쬬d sa mi p치캜i a ke캞 ste to rozp칤sali na konkr칠tnom pr칤klade, s칰hlas칤m. M켿a len miatlo to, 쬰 ak v KARAT-e daj칰 public koment치r, ten by sa mohol zrkadli콘 do koment치ra v spolo캜nosti 3EC aby som nemusel prepisova콘 tieto inform치cie zo spolo캜nosti KARAT do 3EC. ALe rozumiem aj V치코mu poh쬬du. m칪쬰me to uzavrie콘"
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "No kludne potom rozoberieme preco mate potrebu to prepisovat.. Ked bude AI aj vydana, potom si jednoducho vytvorite cez AI suhrn riesenia a ten si na konci mozete postnut do svojej ulohy.. zatvaram teda.."
    },
    {
      "creator": "Allan Kone캜n칳",
      "comment": "Opraveno - p콏i eskalaci nebylo zohledn캩no pr치vo extern칤ho u쬴vatele na sekce p콏i p콏id치n칤 칰kolu. Nov캩 se nab칤z칤 pouze jedna sekce, kam m콢쬰 칰kol p콏idat."
    },
    {
      "creator": "Daniel Dzuro",
      "comment": "testoval som to cez zakaznika a zda sa to byt v poriadku"
    }
  ]
}